[
    {
      "version": "7.0.4",
      "date_of_release": "5 December 2015",
      "issue":[
          {
              "issue id": "JRASERVER-47726",
              "issue_description": "Version 7.0.3 of JIRA is unrecognized by Atlassian Marketplace",
              "fixed_version" : "None"
          },
          {
              "issue id":"JRASERVER-47734",
              "issue_description":"some Documentation error"    , 
              "fixed_version": "None"     
          }
      ]
      
    },

    {
      
      "version":"7.0.11",
      "date_of_release":  "Sept 16 , 2016" ,
      "issue":[
          {
              "issue id" : "JRASERVER-62496",
              "issue_description": "example of issue description with security errors ",
              "fixed_version": "None"
          }
         
      ]
  },
  {
    
      "version":"9.0.x",
      "date_of_release":  "Sept 16 , 2016" ,
      "issue":[
          {
              "issue id" : "JSWSERVER-25942",
              "issue_description": "The 'learn more' link is broken in the 'Exclusion Rules' configuration page. When clicking on it, the user is redirected to an invalid page. There by leading to a 'Page not found' error. ",
              "fixed_version": "None"
            },
          {
              "issue id":"JSWSERVER-25902",
              "issue_description":"On Advanced Roadmaps for Jira timeline it's possible to see the capacity assigned to a sprint (for Scrum) or iteration (for Kanban). This is visible in the form of a vertical bar representing the work associated to it. There's an early access feature for Advanced Roadmaps for Jira which is enabled by default called Enhanced capacity distribution, If the early access feature Enhanced capacity distribution is ENABLED we do not have the capacity for iterations in the past.",
              "fixed_version": "None" 
          },
          {
              "issue id":"JSWSERVER-25328",
              "issue_description":"Team data is not correctly invalidated after staged changes done to the plan/scenario are discarded.",
              "fixed_version": "None" 
              
          },
          {
              "issue id":"JSWSERVER-25321",
              "issue_description":"The number of issues at capacity insights for Kanban teams will be incorrect in the Advanced Roadmaps plan in case you will disable the 'Enhanced capacity distribution' feature. It will be incorrectly calculated by summing up estimates (days/hours).The issue  is The number of issues in capacity insight for the current Kanban iteration is defined as the sum of estimates (days/hours).Expected Results is  The number of issues in capacity insight for the current Kanban iteration should correlate with an actual number of the issues assigned to a team",
              "fixed_version": "None" 
          },
          {
              "issue id":"JSWSERVER-25317",
              "issue_description":"The user with only view permission can access the plan setting page and make some configuration changes but cannot save these changes. While trying to save these changes or accessing other options or going back to plan the page is stuck at loading and no error is thrown. An HTTP 401 Unauthorized error is captured on HAR and console log. Expected Results is The user with only view permission should not be allowed to access the plan setting page. The 'cog' icon should only include the 'Get started' and 'Get help' items.",
              "fixed_version": "10.0.0" 
          },
          {
              "issue id":"JSWSERVER-25213",
              "issue_description": "In case you have a custom field of 'User Picker' type added to Advanced Roadmaps for Jira plan then under some circumstances the values of this field will not be included in generated Plan's CSV export. The Issue is  While generating Plan,s CSV export some values of the 'User Picker' custom field(-s) are not included. Expected Results is Generated CSV export should include all appropriate values of the custom fields that are available in the current Plan.",
              "fixed_version": "None" 
          },
          {
              "issue id":"JSWSERVER-24973",
              "issue_description":"JQL search involving Target start/ Target end are returning incorrect results. Performing a JQL search using 'Target start' or 'Target end' return incorrect results when a customfield of a same name is already present. For example:  'project = 'Project name' AND 'Target start' is EMPTY' returns data with Target start having both EMPTY and non-empty results. Thus the issue is It returns data for both empty Target start date and non-empty. But  The result should contain only rows where Target start is EMPTY",
              "fixed_version": "None"
          },
          {
              "issue id":"JSWSERVER-24972",
              "issue_description":"Circular reference using issuesInPlan causes StackOverflowError. issuesInPlan JQL function can cause StackOverflow if this is a circular reference. The stack trace indicates a problem with Jira Advanced Roadmap plugin when a JQL is executed. After that, we saw that all DB connections became busy and this caused Jira to be unavailable. Expected Result should show : Gracefully failed",
              "fixed_version": "None"
          },
          {
              "issue id":"JSWSERVER-21993",
              "issue_description":"When user specifies a non-existent Person ID, REST Api should return a 400 error. When making a REST call and the Person ID is specified, the Person is created which leads to confusion that this endpoint can assign an existing Person with a team. 400 error code should be returned instead. Error is Persona is created and ID is not taken into account. Expected Results should show 400 HTTP error code.",
              "fixed_version": "None"
          },
          {
              "issue id":"JSWSERVER-21974",
              "issue_description":"Jira guardrails will not send email notification to remaining System Administrators when it encounters errors with one of the recipient. Example situation, Instance has 10 System admin and is configured to send notification for jira.safeguards.issue.comments. When triggered, Jira will attempt to send notifications to these 10 admins individually. If it faces a problem with admin #6, it will no longer send emails to admin 7, 8, 9 and 10. This can be replicated if for example the admin does not have an email address. Expected result is Jira will send to the notification to all admins except for the user without email address.Once it fails to send notification to that user, Jira no longer attempts to send notification to the remaining system admins. ",
              "fixed_version": "None"
          },
          {
              "issue id":"JSWSERVER-21944",
              "issue_description":"Old closed issues from a deleted Sprint get automatically added to a new Sprint. When a Sprint is deleted from a board, all the closed issues that belonged to that Sprint get automatically added to the next open Sprint that is on the board.Actual behaviorThe issue that was closed from the deleted Sprint has been automatically added to the new Sprint. Expected behavior should be that The issue that was closed from the deleted Sprint should not be added to the new Sprint.",
              "fixed_version": "None"
          },
          {
              "issue id":"JSW SERVER-21937",
              "issue_description":"Jira guardrails sends email notifications to inactive user or system administrator",
              "fixed_version": "None"
          },
          {
              "issue id":"JSWSERVER-21923",
              "issue_description":"FindOnBoard.jspa?sprintId link is extremely slow and fails to load. Post upgrade to Jira 9, /secure/FindOnBoard.jspa link is extremely slow and fails to load, that is  after clicking the link present in 'Completed sprints' from 'edit issue' section, it navigates to  to /secure/FindOnBoard.jspa?sprintId. Thus the Expected Results is that Loading of board should load faster and successful ",
              "fixed_version": "None"
          },
          {
              "issue id":"JSWSERVER-21849 ",
              "issue_description":"MS Teams integration documentation missing a step for Jira 9.x versions. Our current documentation doesn't reflect additional steps needed by versions 9.x+ to configure MS Teams with Jira. ",
              "fixed_version": "None"
          },
          {
              "issue id":"JSWSERVER-21794",
              "issue_description":"Add Tomcat9w in windows section depending on Jira version in adding startup parameters guide. Windows section in the below guide states to use tomcat8w for setting Jira parameters in Windows, while this is correct for Jira 8, for Jira 9 the executable is tomcat9w. Thus the problem is that Only tomcat8w is listed. Expected  Results is that The article should differentiate between the executable version depending on Jira version. ",
              "fixed_version": "None"
          },
          {
              "issue id":" JSWSERVER-21629",
              "issue_description":"Workflow dropdown text stop working if we re-assign the issue back to logged in user in same session. In a workflow, when you set the condition 'Only the assignee of the issue can execute this transition.' in every transition of a workflow in a project. For any issue for that project when you assign an issue to any other user than logged in user. Later change the assignee to the logged in user. The Workflow drop down text stop coming on the screen.",
              "fixed_version": "None"
          },
          {
              "issue id":"JSWSERVER-21618 ",
              "issue_description":"When navigating to the endpoint to check sync data, the page is broken.. Expected Results is The endpoint show the latest sync data.",
              "fixed_version": "None"
          },
          {
              "issue id":"JSWSERVER-21606",
              "issue_description":"When accessing empty kanban board rest/greenhopper/1.0/xboard/work/transitions.json retuns 400 error. Thus the problem is that Boards are displayed without visual regressions. Expected Results should be that There are no 400 HTTP errors in the console.",
              "fixed_version": "None"
          },
          {
              "issue id":"JSWSERVER-21578",
              "issue_description":"Dragging the sprint footer does not always track issues correctly. ested on 8.20.0 and 9+ (so through deduction it affects at least all 8.20+ version). Have some sprint (not started yet) in the backlog view. Have some issues in the backlog.The Error is that The position of the footer might not reflect the state of which issues are to be moved and The scope of issues to be moved to the sprint is reflected by the gap between issues. Expected Results should be that The current position of the dragged footer should indicate the range of the issues to be moved to the sprint.",
              "fixed_version": "None"
          },
          {
              "issue id":"JSWSERVER-21557",
              "issue_description":"Users with Manage Sprint permission but no Edit Sprint permission can not manage a sprint on a board pulling from multiple projects. User granted the Manage Sprint permission but not the Edit or Start/Stop Sprint permission, can not edit a sprint. The problem is Edit Sprint is grayed out, and user can not Start or Stop the sprint. Expected Results is that User should be able to Edit and Start/Stop the sprint with the Manage Sprint permission. ",
              "fixed_version": "None"
          },
          {
              "issue id":"JSWSERVER-21540",
              "issue_description":"Creating an issue using the 'Create Issue in Epic' button causes surplus webhook events. The issue looks similar to the Jira Cloud Bug,  which is marked as 'Closed' with Resolution status 'Timed out'. Expected Results should be Creating a Story under Epic will generate an issue-created event.",
              "fixed_version": "None"
          },
          {
              "issue id":"JSWSERVER-21533",
              "issue_description":"The JQL query 'Epic name is empty' is not working and always returns 0 result. When using the following JQL query to search for Epics for which the 'Epic Name' is empty, no results are returned. Expected results should be that The search should returns all the Epic for which the 'Epic Name' field is empty.",
              "fixed_version": "None"
          },
          {
            "issue id":"JSWSERVER-21521",
            "issue_description" :"REST call to third-party plugin fails Jira 9.x. A Jira 9.x with the ALM Octane plugin installed failed to load the plugin on the view issue screen. However, the plugin loads fine in the side panel view or when the issue key is clicked in the view issue screen. Thus the problem is that The REST call is not made only when the Issue is viewed from the Board on a full page and Attaching the HAR files for further review. Expected Results is to Make the REST call on all pages while the issue is viewed.",
            "fixed_version": "None"
          },
          {
              "issue id":" JSWSERVER-21514",
              "issue_description":"Version menu not showing status category progress blocks (bars). Project versions do not show the status blocks due to CSS problems The div with CSS class aui-group status-category-blocks is hidden even though it's calculated correctly and the users can't see the statistics graph ",
              "fixed_version": "None"
          },
          {
              "issue id":"JSWSERVER-21498",
              "issue_description":"Users with View Read-Only Workflow can't see 'View workflow' when not able to transition the issue. Users with View Read-Only Workflow can't see 'View workflow' when not able to transition the issue. This started on Jira 9.x when the new issue view moved the 'View workflow' to the status list drop-down.Expected Results is that View Read-Only Workflow permission should at least make available the menu option 'view workflow', instead it shows permission errors when the user can't transition the issue from the current status, making this permission tied to 'transition issue' permission.",
              "fixed_version": "None"
          },
          {
              "issue id":"JSWSERVER-21497",
              "issue_description":"Epic under an Epic. Expected Result is that Epic shouldn't be present under another Epic in Issues in Epic section, Epic cannot have another Epic under issues in Epic section. But Actual problem is Epic still be present in issues in Epic section under an Epic.",
              "fixed_version": "None"
          },
          {
              "issue id":"JSWSERVER-21495",
              "issue_description":"When editing Filter Results gadget drag-dropping fields moves them to the right.Starting from Jira 9.0 version for both Jira DC & Server. When editing the 'Filter Results' gadget in the dashboard, a drag-drop of fields under 'Columns to display' moves the fields to the right.Actual Results is The drag-drop of fields moves toward the right .",
              "fixed_version": "None"
          },
          {
              "issue id":"JSWSERVER-21467",
              "issue_description":"Shared with drop-down missing in Search Dashboards page. There is an issue where the Shared with drop-down box is missing from the Manage Dashboards > Search Dashboards page, preventing users from selecting a value, such as Anyone on the web, Group, Project, and User.Expected Results is that Drop-down box should appear on the page with the ability to select from the list of values. Error is that An empty space exists to the right of the Shared with attribute.",
              "fixed_version": "9.3.0"
          },
          {
              "issue id":"JSWSERVER-21455",
              "issue_description":"High CPU usage during query execution in DVCS plugin. Expected Results is to Smooth and fast query result",
              "fixed_version": "9.1.0, 8.20.11, 8.13.24"
          },
          {
              "issue id":"JSWSERVER-21434",
              "issue_description":"Update Jira CDN documentation.docs do not mention known issue with CDN possibly misbehaving during ZDU upgrade (when cluster is in mixed mode). The recommended action is to disable CDN before the upgrade and enable it after the cluster is in stable state. Expected Results is We have instrustion in the document on what to do with CDN when performing ZDU. ",
              "fixed_version": "8.13.0, 8.18.0, 8.19.0, 8.21.0, 8.22.0, 9.0.0, 9.1.0"

          },
          {
            "issue id":"JSWSERVER-21433",
            "issue_description":"Work log activity entries are showing 'Date Started' timestamps in a relative way. Starting from Jira 9.0, Work log activity entries are showing 'Date Started' timestamps in a relative way ('just now', 'yesterday' etc.) instead of showing absolute date value. This behaviour differs from the previous user experience (Jira 8.22.x/8.20.x) and makes it hard to clarify the exact 'Date Started' time specified during the creation of the work log entry while reviewing the details of these items. Additional context Unlike other activity entries where shown timestamp is the same as the entry's created date, the work log behaves differently — it shows a value specified as 'Date Started' while logging the entry. For all other activity entries (like for example comments) you could hover the mouse cursor over the timestamp and check for the absolute timestamp value in the tooltip. For work log entries it will also show the correct absolute timestamp value of created date, but the tooltip doesn't show the value for the 'Date Started' timestamp. Actual Results is that The Work log activity entries are showing 'Date Started' timestamps are shown relatively and there is no easy way to figure out their actual value. Expected Results is that The Work log activity entries should show a 'full' (absolute) timestamp (like it was before 9.0) or provide an easy option to figure it out (an additional entry in the tooltip would be helpful here)",
            "fixed_version": "9.3.0"
        },
        {
          "issue id":"JSWSERVER-21421",
          "issue_description":"Projects gadget keeps loading indefinitely.The 'Projects' gadget (sometimes) keeps loading indefinitely when displaying 3+ projects. This is an intermittent behaviour as it gets resolved by refreshing the page a few times.Expected Results is that The projects to be displayed consistently after every refresh . Actual Results is that Sometimes the gadget keeps loading indefinitely ",
          "fixed_version": "None"

        },
        {
        "issue id":"JSWSERVER-21418",
        "issue_description":"Update 'Supported Platforms' documentation. The document Supported Platforms for pretty much all Jira versions states the following in regards to Oracle databases:JDBC Driver: For all Oracle versions, use the JDBC 19.3 (ojdbc8) driver listed here. This is the driver we’re using to test Jira with Oracle.However, the Oracle JDBC 19.3 driver is no longer available on the linked page. It is still available at this link. Thus the problem is The linked page no longer lists version 19.3 of the driver. The  expected output should be It is possible to download the Oracle JDBC 19.3 driver from the page linked in our documentation.",
        "fixed_version": "8.13.0, 8.14.0, 8.15.0, 8.16.0, 8.17.0, 8.18.0, 8.19.0, 8.20.0"
        },
        {
           "issue id":"JSWSERVER-21406",
            "issue_description":"External System Import using CSV populates deleted fields . Expected Results: When doing the Mapping Fields, Jira should not let you choose fields that were removed from the project. Actual Results he Jira Admin can import a CSV file containing fields that were removed from the project.",
            "fixed_version": "None"
        },
         {
          "issue id":"JSWSERVER-20841",
          "issue_description":"Fields that are set as hidden in the field configuration still appear as valid options in the 'Issue Detail View' within the board settings in Software projects",
          "fixed_version": "None"
         },
         {
           "issue id":"JSDSERVER-12676",
           "issue_description":" When using Groovy scripts to update object attributes with unique values, if the script is ran multiple times in short period of time, there is an 'ValidationInsightException' message.",
          "fixed_version": "5.8.1, 5.9.0, 5.4.7"
          },
          {
            "issue id":"JSDSERVER-10937",
            "issue_description":"nsight Reports scheduled to run Daily, Weekly, Monthly or Advance (CRON expression) stop synchronising randomly. Expected Results : Reports should be synced. Actual Results: Reports are not synced",
          "fixed_version": "4.22.0, Insight 9.1.6, 4.20.6"
          },
          {
            "issue id":"JSDSERVER-10829",
            "issue_description":"The print label for a timestamp attribute will display differently(without the correct formatting) when viewing it from the new object view - UI Bug",
            "fixed_version": "4.22.0"
          },
          {
            "issue id":"JSDSERVER-10828",
            "issue_description":"The print label for user attributes will display the user key instead of the user's name when printing from the new object view",
            "fixed_version": "4.20.2"
          },
          {
            "issue id":"JSDSERVER-8692",
            "issue_description":"On Customer Portal, Insight Custom Field will display values that belong to the Preset value set for another Customer Portal context. Expected Results: In Project A we do not have a customer selected nor hidden, so no application should be displayed.Actual Results :Applications for the customer1 we set on Project B are displayed on Project A",
            "fixed_version": "None"
          },
          {
            "issue id":"JSDSERVER-8679",
            "issue_description":"When importing Insight objects using AWS, if the user is syncing with too many accounts and combine with many regions, the test configuration will show as spinning forever on UI which prevents from going to the next step. This is due to the backend API is timing out due to testing too many AWS connections at the same time",
            "fixed_version": "None"
           },
           {
            "issue id":"JSDSERVER-8672",
            "issue_description":"Object type Developer are not able to create/edit object when the select type attribute is selected. Expected Results: The user should be able to select the value for an attribute and create the objects as all the necessary permissions are given to the user. Actual Results : The user is getting the ‘unknown’  error response",
            "fixed_version": "4.20.2"
            },
            {
              "issue id":"JSDSERVER-8652",
              "issue_description":"When the user uses basic object search in an objetType that contains for example 5000 objects and it contains 10 different names distributed among these 5000 objects, it would only return 3 names when filtering on name. Expected Results: all the  names should be displayed in the result",
              "fixed_version": "None"
             },
             {
              "issue id":"JSDSERVER-8645",
              "issue_description":"Insight CSV import ignore text surrounded by <> characters when target attribute is of type TextArea",
              "fixed_version": "Insight 8.8.0"

             },
             {
              "issue id":"JSDSERVER-8467",
              "issue_description":"Insight Automation to create issue will not work when there is a required custom field with default value. Issues are not created by automation",
              "fixed_version": "None"
             },
             {
              "issue id":"JRASERVER-77717",
              "issue_description":"Creating a test environment for Jira product documentation doesn't mention required updates if CDN is enabled on production",
              "fixed_version": "None"
             },
             {
              "issue id":"JRASERVER-77686",
              "issue_description":"Wrong information about PAT implementation on Jira and Confluence on public document.While Bitbucket and Bamboo have their own PAT implementation, Jira and Confluence share the same code base through a plugin.Although there's no in-product UI to allow user authentication with a token, the solution doesn't filter out requests from a browser",
              "fixed_version": "None"
             },
             {
              "issue id":"JRASERVER-77679",
              "issue_description":"A Confluence page with an Advanced Roadmaps Plan macro shows a baseURL warning popup every time you visit the page.  You will see a baseURL warning popup when the page loads. Based on your network topology, the message can differ",
              "fixed_version": "10.0.0, 9.4.21, 9.12.8, 9.15.2"
              
             },
             {
              "issue id":"JRASERVER-77638",
              "issue_description":"The logic that decides whether a mention notification should be sent from a Jira Service Management issue when a user does not have application access (no license) is different, depending if batched notifications are enabled or not.Expected Results: The mentioned users should receive a notification saying that someone mentioned them in the ticket, as it's the case when Batched Notifications are disabled. But Actual Results No notification is sent to the user",
              "fixed_version": "None"
              },
              {
                "issue id":" JRASERVER-77604",
                "issue_description":"If the user's language is Japanese, an error occurs when trying to enter the date and time using the Date Time Picker. The error  - Invalid date format. Please enter the date in the format 'dd/MMM/yy h:mm a' ",
                "fixed_version": "None"
               },
               {
                "issue id":"JRASERVER-77589",
                "issue_description":"Jira data pipeline may still report a job a started even if it's not running anymore. This scenario impacts the ability of running subsequent jobs, even though it wasn't previously on status of failure . Data pipeline should be able to identify a job isn't running anymore, marking it as incomplete, and allowing new jobs to start. Expected Results Jira identifies the previous data pipeline job isn't running anymore and properly starts the new job. But Actual Results The previous data pipeline job status is still reported as started and the new one is reported as failed",
                "fixed_version": "None"
               },
               {
                "issue id":"JRASERVER-77582",
                "issue_description":"When users authenticate on Jira, this information should be added as new events on the audit log when full coverage is enabled for the Security category Requests made with personal access tokens (PAT) for REST API won't create a new entry on the audit log. Expected Results A new User login successful event is logged as part of the REST API request. Actual Results No new event is added.It seems the personal access token code isn't firing a user login event. This makes auditing inconsistent when personal access tokens (PAT) are used.",
                "fixed_version": "None"
               },
               {
                "issue id":"JRASERVER-77572",
                "issue_description":"Jira full reindex process does not terminate when it encounters a relevant failure. Expected Results The full reindex fails as soon as the first error occurs. Actual Results The full reindex continues untill 100% and then will be reported as completed with errors. On large instances, an administrator may wait for hours only to know the reindex failed because of an issue that occurred on the initial minutes",
                "fixed_version": "None"
               },
               {
                "issue id":"JRASERVER-77554",
                "issue_description":"Lazy loading of iframe gadgets on dashboard is broken. Expected Results The content of iframe gadget should be loaded only when the gadget is within the viewport. Actual Results The content of all iframe gadgets is loaded on page load, regardless of their position on a page.",
                "fixed_version": "None"
               },
               {
                "issue id":" JRASERVER-77544",
                "issue_description":"Search indexing documentation suggests in the Re-indexing a single project section that Project admins are able to reindex a project. This information is not true and only users with Jira admin permission (or Jira system admin) can see this option under the project settings",
                "fixed_version": "None"
               },
               {
                "issue id":"JRASERVER-77470",
                "issue_description":" Mail notifications from the Comment Safeguards are not being sent to the System administrators if the Outgoing email address is not matching a user in Jira.Expected Results Notifications are triggered and the System admins receive the notification about the limit being exceeded. Actual Results: Couldn't match mail server 'from' address to an existing Jira user. Mail notification will not be sent",
                "fixed_version": "None"
                },
                {
                  "issue id":"JRASERVER-77332",
                  "issue_description":"Division Slider in Search Results screen doesn't work. Expected Results The sidebar should move accordingly there by expanding or contracting the Listed issues section.  Actual Results Instead, the sidebar doesn't move, it causes a flickering issue sometimes but the issues pane doesn't expand or contract and stays the same",
                  "fixed_version": "None"
                 },
                 {
                  "issue id":"JRASERVER-77128",
                  "issue_description":"Audit log events product documentation has wrong information about Field Configuration events",
                  "fixed_version": "None"
                 },
                 {
                  "issue id":"JRASERVER-76846",
                  "issue_description":"MS Teams integration with Jira fails and displays a blank white screen when clicked on Authorize in Jira option. Expected Results  MS Teams should be successfully integrated with Jira.Actual Results MS teams integration with Jira fails with below error snippet: No 'Access-Control-Allow-Origin' header is present on the requested resource",
                  "fixed_version": "None"
                 },
                 {
                  "issue id":"JRASERVER-76720",
                  "issue_description":"Inconsistent behavior between Jira UI and API response when hiding the field Linked Issues The Jira UI and the REST API end point show conflicting/inconsistent results when the Linked Issues field is set to hidden in the Field Configuration",
                  "fixed_version": "None"
                 },
                 {
                  "issue id":"JRASERVER-76688",
                  "issue_description":"Incorrect smart value mentioned in the Smart Value documentation for A4J DC. In the Smart Value documentation for Automation For Jira Data Center,  the syntax to iterate over the Fix Versions from the changelog smart value does not work. Instead of 'ixVersion', we should use 'Fix Version' ",
                  "fixed_version": "None"
                 },
                 {
                  "issue id":"JRASERVER-76676",
                  "issue_description":"Active Objects StringLenght's limitations for Oracle. Expected Results Active Objects should map varchar2 to 4000 characters Actual Results Active Objects should map varchar2 to 450 characters",
                  "fixed_version": "None"
                 },
                 {
                  "issue id":"JRASERVER-76665",
                  "issue_description":"The method getApplicationLinks() on the ApplicationLinkService will only return application links of type internal. Where iit should return both internal and external links",
                  "fixed_version": "9.15.2"
                  },
                  {
                    "issue id":"JRASERVER-76551",
                    "issue_description":"Under some conditions, the default security level is not respected on the quick create issue screen, when switching between projects and issue types. Expected Results The 'Security Level' should be set to the default level configured in the scheme.  The 'Security Level' is set to 'None' ",
                    "fixed_version": "9.14.0"
                   },
                   {
                    "issue id":"JRASERVER-76467",
                    "issue_description":"View workflow menu item in transitions dropdown is not keyboard accessible",
                    "fixed_version": "None"
                   },
                   {
                    "issue id":" JRASERVER-76325",
                    "issue_description":" During the installation of Jira 9.0.0 on Linux platforms using the Linux 64 bit installer, the installer prompts the user to overwrite the file tcnative-1.dll.Expected Results The installer should proceed without prompting to overwrite any existing files, especially given that .dll files are not typically present or needed on Linux systems. Actual Results The installer prompts with the following message: The file already exists. Would you like Setup to overwrite it?",
                    "fixed_version": "None"
                   },
                   {
                    "issue id":"JRASERVER-76322",
                    "issue_description":"When accessing Jira for the first time on the browser, an error appear on the browser console: TypeError: e is null . This error looks harmless and Jira works as expected.",
                    "fixed_version": "None"
                   },
                   {
                    "issue id":"JRASERVER-76297",
                    "issue_description":"Some region names overlap names and titles in Jira Credits. Expected Results Watch the credits rolling nicely from left to right. There should be sufficient gaps between regions, Region names shouldn't be overlapping people names or their titles Actual Results They start overlapping",
                    "fixed_version": "None"
                   },
                   {
                    "issue id":"JRASERVER-76233",
                    "issue_description":" In the Connecting Jira applications to MySQL 8.0 product document we have a step to add autoCommit=false to the mysql configuration. this was wrongly added to the document as it's only suggested for MS SQL Server",
                    "fixed_version": "None"
                   },
                   {
                    "issue id":"JRASERVER-76231",
                    "issue_description":"Product document to run Jira as a service on Windows wasn't updated for Tomcat 9",
                    "fixed_version": "None"
                    },
                    {
                      "issue id":"JRASERVER-76218",
                      "issue_description":"Index snapshot silently fails if parent directory doesn't exist.Expected Results Jira will automatically create in snapshots directory if it doesn't exist and snapshot should successfully be created/saved.Actual Results Jira doesn't create the necessary directory and the snapshot will not be created/saved ",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-76200",
                      "issue_description":"Unable to add Assignee without Browser Project permission . Expected ResultsThe reporter should be able to add an Assignee while he creating the ticket.Actual Results  The Jira server was contacted but has returned an error response.",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-76150",
                      "issue_description":"On Jira 9.x if user mouse hovers over the options under the 'Export' button the highlight/background behaviour works only in one direction",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-76141",
                      "issue_description":" Configuring linked issues in Kanban board layout displays other links instead of only issue links . Confluence links in particular are not displayed properly. The correct behavior would be to either only display issue links like before or display the Confluence link page name correctly",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-76111",
                      "issue_description":"The full reindex process has slowed down significantly for some customers. This is due to extra operations performed during reindexing that improve index correctness",
                      "fixed_version": "9.12.0, 9.4.12"
                     },
                     {
                      "issue id":"JRASERVER-76023",
                      "issue_description":"he improvement of 'Activity tabs improvements' in Jira 9.0 is available for Server license regardless of license types. However the release notes say 'Activity tabs improvements' is only for DC with a 'DATA CENTER' label.",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-75862",
                      "issue_description":"Loading all history entries is very slow on issues with many of them - on the tested instance there were ~4000 history entries associated with a single issue.  The content needs a lot of time to load. Most of this time is waiting for the response from the server",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-75819",
                      "issue_description":"Trying to edit a user with a Chinese/Korean characters in their name/username results in an error",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-75795",
                      "issue_description":"Issue status tooltip on Issue View shows HTML markup if you mouse-over during page load . After loading an issue or refreshing the page while on the Issue view, if you quickly mouse-over the Issue Status you'll be presented with the HTML markup instead of the rendered tooltip",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-75709",
                      "issue_description":"Date picker doesn’t appear when creating an issue from an Administrative page. Reproduced in Jira Service Management 5.6. This also applies to the Date Picker Time custom field as well",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-75472",
                      "issue_description":"Unable to attach the same file consecutively using browse and select . File is not attached again even  you cancel the first attachment",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-75001",
                      "issue_description":"Pressing enter in empty Watchers field throws HTTP 405 – Method Not Allowed error.Expected Results When the field 'add watchers' does not have a value assigned then  pressing enter, the issue view page screen to be reloaded",
                      "fixed_version": "9.11.0, 9.4.9, 9.10.1"
                     },
                     {
                      "issue id":"JRASERVER-74947",
                      "issue_description":"Jira is affected by CVE-2022-42890 & This affects the Batik library from v1.0 - v1.15 Jira 9.0.0 uses Batik v1.14",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-74941",
                      "issue_description":"The dashboard gadgets do not align correctly after a collapse or a refresh. To make them appear properly the gadgets need to be kept expanded and then hit a refresh",
                      "fixed_version": "9.11.0, 9.4.10"
                     },
                     {
                      "issue id":"JRASERVER-74915",
                      "issue_description":"The history tab does not reflect changes made to the inward/outward settings of issue links. Expected results The link direction in both the Issue Links panel and the History tab should match. They should both say 'is blocked by' .Actual results The history tab is not reflecting the change we made (it still shows 'blocks'), while the Issue Links panel is reflecting the change and is showing 'is blocked by' ",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-74882",
                      "issue_description":"When Jira is upgraded from 8.x to 9.x and the first node starts up for the first time, it performs the database upgrade and adheres to the jira-config.properties config. However, if the node's restarted, this second startup kicks-off a full reindex regardless",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-74762",
                      "issue_description":"The page links don't work in the User Picker and Group Picker popup. If the number of users found in the search is higher than the number from Users per page, the results will be split into multiple pages. When clicking on any page other than the 1st page, nothing happens, making it impossible to switch between pages to search for users not shown in the 1st page",
                      "fixed_version": "9.13.0, 9.4.21, 9.12.8"
                     },
                     {
                      "issue id":"JRASERVER-74760",
                      "issue_description":"Inconsistency with the colour of 'To Do' statuses between the status button and the transition dropdown list. The workflow statuses and transitions were all moved to a button in the issue view page. That new design introduced an inconsistency with the colour of statuses that belong in the 'To Do' category, between the status button and the transition dropdown list",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-74747",
                      "issue_description":"Description of workflow transition does not appear in hover tooltip. The description of the workflow transition does not appear in the hover tooltip.The name of the transition appears in the hover tooltip instead.Expected Results is that The description of the workflow transition appears in the hover tooltip",
                      "fixed_version": "9.14.1, 9.4.18, 9.12.5, 9.15.2"
                     },
                     {
                      "issue id":"JRASERVER-74742",
                      "issue_description":"Plugins system timeout, causing Jira startup failure .The issue is intermittent. Upon restart a number of system plugins failed to be enabled. Jira fails to start.JIRA-Bootstrap ERROR  , Creation Timer ERROR. Expected Results is that Jira starts",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-74741",
                      "issue_description":"Some plugins cannot be enabled after restart.  The issue is intermittent. Upon restart some plugins are not enabled. One cannot enable them from UPM. Expected Results is that Jira application starts without errors",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-74715",
                      "issue_description":"When searching by statusCategory QueryComponent!Jql.jspa returns 400 because of 'jqlTooComplex'  Issues are searched correctly but  In the console, you can find that request fails with 400 HTTP code . Expected Results is that There are no HTTP requests that return a 400 error code as it is for any other JQL clauses",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-74605",
                      "issue_description":"Jira rest api allows assigning of a security level from a unrelated issue security scheme. Jira rest api to edit issues (PUT /rest/api/2/issue/issuekey), allows assigning of a issue security level from an unrelated issue security scheme associated with a different project.The unrelated issuesecurity level from the unrelated issue security scheme for the project gets assigned. Afterwards, the issue cannot be viewed, cannot be updated even via rest, cannot be deleted either, all due to permission issues. Expected Results is that The unrelated security level should not be assignable to the issue. And The issue should be viewable",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-74597",
                      "issue_description":"Analytics state (enabled/disabled) cannot be changed.Analytics cannot be enabled/disabled in Jira 9.4.0.This problem is not reproducible in Jira 8.20. Analytics go back to enabled.Expected Results are that Analytics keep being disabled.",
                      "fixed_version": "9.8.0"
                     },
                     {
                      "issue id":"JRASERVER-74577",
                      "issue_description":"The Dashboards Search doesn't work as expected when searching for multiple terms searches.Since the search engine searches the Dashboard's names and descriptions, it brings many different results from the wanted one.Expected Results should be that The more details you give to the search engine, the more refined and assertive the results should be, just like in the Agile Boards search",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-74568",
                      "issue_description":"licking add comment before the Jira page loads, causes the text box to open as a new page.f you load into an issue in a Software or Business project, and click 'Add Comment' before the page fully loads, this will cause the Add comment text to open as a new page, Once a comment is added it takes you back to the issue as normal. If you wait for the page to load fully, then it will create the add comment text box at the bottom of the page as normal. The main problem is The Add comment goes to a new page.  Expected output should be that the add comment box to always created at the bottom of an issue, instead of a new page",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-74528",
                      "issue_description":"Team Calendars cannot display the assignee of the Jira Issue event when the Jira Description field contains a newline character on Jira 9.x. After upgrading Jira 9.x, the assignee of the Jira events cannot be displayed on the Team Calendars if the Jira Description field contains a newline (shift+enter while the Description field is on 'Visual' mode, not new paragraph by using just enter).The 'Assignee' field is displayed as 'Unassigned' even though it is assigned to the user. There are no logs or any faulty indications in the Confluence logs",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-74518",
                      "issue_description":"Team Calendars cannot display Jira Issue events when there are special characters in the Jira Description on Jira 9.x. This problem occurs when the issue description area contains an enter character followed by a semicolon.Actual Results is that The event is not visible on the Team Calendars UI.Expected Results is that The event should be displayed on the Team Calendars for the chosen 'Due Date' while creating the Jira Story issue",
                      "fixed_version": "9.9.0, 9.4.10"
                     },
                     {
                      "issue id":"JRASERVER-74440",
                      "issue_description":"jira.comment.collapsing.minimum.hidden is no longer working Expected Result is that When you have jira.comment.collapsing.minimum.hidden=4 (default value), the result should be: The first 8 comments will show without collapsing; and When the 9th comment is added, Jira shows 5 comments on screen and 4 are collapsed",
                      "fixed_version": "9.4.6, 9.8.1"
                     },
                     {
                      "issue id":"JRASERVER-74414",
                      "issue_description":"Behavior Inconsistencies when the Jira Mail Handler fails to create an issue or add a comment",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-74413",
                      "issue_description":"Fileviewer -previewing pdf attachment & performing zoom in/out action ,giving console errors",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-74388",
                      "issue_description":"Unbatched mode - Visiting Issue View page with multiple page reloads breaks comment editor (RTE) & attachment section with console errors. Attachment section - User unable to attach and Add comment editor - focus indicator missing , unable to use RTE toolbar",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-74387",
                      "issue_description":"Disabling RTE & visiting issue view page, doesn't load project sidebar in dev.mode (batching off). Project sidebar doesn't load",
                      "fixed_version": "None"                       },
                     {
                      "issue id":"JRASERVER-74358",
                      "issue_description":" Minimized gadgets still consume a whole space of expanded gadgets on the dashboard. After refreshing the dashboard page the Minimised gadgets still consume the whole space of expanded gadget",
                      "fixed_version": "9.6.0, 9.4.3"
                     },
                     {
                      "issue id":"JRASERVER-74348",
                      "issue_description":"Issue DELETEs not replicated across cluster indexes. Some sub-tasks may still be present on some indexes. But its is expected that  The issue and all sub-tasks should be removed from the DB and all indexes (across all nodes)",
                      "fixed_version": "9.15.2, 9.12.9"
                     },
                     {
                      "issue id":"JRASERVER-74314",
                      "issue_description":"Upgrade from 8.x to 9.x with large number of comments/worklogs may fail. Error running original upgrade task . It is expected that the  Upgrade task should finish in the expected time (~1min per 1M issue/comments/worklogs)",
                      "fixed_version": "None" 
                     },
                     {
                      "issue id":"JRASERVER-74307",
                      "issue_description":"End bracket shown in the dialog of the move-issue process only for custom field radio button. When there is a required custom field radio button in the project and the custom field radio button has a default value set an end bracket ')'appears Expected Results is that The first option of a custom field radio button should contain the end bracket ')' before it",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-74300",
                      "issue_description":"Adding a comment from 'All' tab does not update the UI. The new comment does not appear in the activity tab content once posted. Expected Results is that the New comment should appear in the activity tab content once posted",
                      "fixed_version": "9.4.0"
                     },
                     {
                      "issue id":"JRASERVER-74275",
                      "issue_description":"Custom comment sorting not being saved.  the way comments are sorted to show the newest comments first.We can change the order using the 'Newest first/Oldest first' button at the top right of the comments, but that is reverted really quickly if the user adds a new comment on any ticket during the same session.Actual Results is that Comments revert back to original Newest first sorting on all tickets. But  Expected Results is that Comments on all tickets are still sorted by Oldest first",
                      "fixed_version": "9.4.6, 9.8.1"
                     },
                     {
                      "issue id":"JRASERVER-74270",
                      "issue_description":"Unable to calculate missing data in index when getting last issue update time returns null. Could not calculate the duration of time where index recovery/catchup needs to be applied! Expected Results is that Jira tries to update the index with missing data it compares the last issue update time in the local index to the last update time in the issue version table. When Jira contains an uncorrupted index (local index during start-up time or index restored from snapshot) it should be able to successfully calculate the missing time range and update the local index",
                      "fixed_version": "9.3.0, 8.20.16"
                     },
                     {
                      "issue id":"JRASERVER-74248",
                      "issue_description":"Jira shows unnecessarily alarming stack trace when reindexing thread is expectedly disabled. Expected Results is that No alarming log messages with stack traces occur int the logs during the process",
                      "fixed_version": "9.3.0"
                     },
                     {
                      "issue id":"JRASERVER-74247",
                      "issue_description":"Error 405 received after updating Index Recovery Settings Error 405 was received after updating Index Recovery Settings and returning to the previous IndexAdmin.jspa if previously the <recover> button was pressed with invalid content. Expected Results is that The new schedule time was saved. The page returns to the main page IndexAdmin.jspa",
                      "fixed_version": "9.3.1"
                     },
                     {
                      "issue id":"JRASERVER-74245",
                      "issue_description":"Sprints missing from Boards. Sprint A is missing from Board B.Thus causing a data inconsistency in the system.  Expected Results is that Sprint A should show up in Board B",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-74221",
                      "issue_description":"View Issue: edit elements should be changed from span to button. At the moment, the edit elements are <span>s with role='button', they should be changed to native <button> elements. Beware, this might lead to some broken tests. Expected Results is that The edit elements should be native buttons",
                      "fixed_version": "9.12.0"
                     },
                     {
                      "issue id":"JRASERVER-74170",
                      "issue_description":" 'Add' button in comments is greyed out when an attachment is added to the comments. When an attachment is added in the comments (in text, not visual mode), the 'Add' button is greyed out unless a 'Space' or some character is added on the comment box.",
                      "fixed_version": "9.9.0, 9.4.6, 9.8.1"
                     },
                     {
                      "issue id":"JRASERVER-74167",
                      "issue_description":"When using the translate option for a custom field, Jira throws a HTTP 405 - Method Not Allowed. Expected Results is that Page renders normally and performs the translate",
                      "fixed_version": "9.3.0"
                     },
                     {
                      "issue id":"JRASERVER-74165",
                      "issue_description":" Comments are not automatically updated once they are posted. After updating the JIRA application to version 9.0.0, The comments are not updated once they are published.Comments should be automatically updated once they are posted",
                      "fixed_version": "9.4.0"
                     },
                     {
                      "issue id":"JRASERVER-74159",
                      "issue_description":"Gadgets overlap after collapse and refresh. The dashboard gadgets do not align correctly after a collapse or a refresh. To make them appear properly the gadgets need to be kept expanded and then hit a refresh. Expected Results is that Gadgets to be aligned properly according to the space available.",
                      "fixed_version": "9.3.0"
                     },
                     {
                      "issue id":"JRASERVER-74149",
                      "issue_description":"  CSV Importer can import into a wrong custom field if there are duplicate named custom fields with differing scopes.Error is that either the data is not imported at all, or it is imported into the global scoped custom field. Expected Results is that It would be expected that the scoped custom field that is on the screen the data is being imported into would have the data populated. Thus data inconsistency is witnessed ",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-74116",
                      "issue_description":"Jira Startup Check Error Page contains hyperlink to Confluence documentation. The Jira errors.jsp page contains a hyperlink to help with the collection of logs. The hyperlink is titled 'the logs', however this link redirects to Confluence documentation. This leads to confusion on how to gather Jira logs.This page actually redirects to Confluence documentation. But Expected Results is thatThis page should redirect to Jira Startup check documentation",
                      "fixed_version": "9.2.1, 9.3.2, 8.20.17, 9.4.2"
                     },
                     {
                      "issue id":"JRASERVER-74115",
                      "issue_description":"The 'jira.field.resolution.include' transition property is not respected by the 'Create Issue' screen. It is possible to restrict the list of resolutions which are listed in the Resolution dropdown menu of a transition screen by using the transition property jira.field.resolution.include and listing the resolution IDs. The problem is that, even though this property is respected by the screens associated to any transition (or other than the Create transition), is it not respected by the Create Issue screen. For that screen, all the resolutions will be listed regardless of that property.Expected results is that The list of resolutions available in the dropdown list should be the same for the Create Issue screen and the transition screen",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-74107",
                      "issue_description":"User Mention does not show full name if username contains '#'. If a username contains the symbol '#', @user mention will not show the user's full name in an issue, whether in the Description or Comment field.Expected Results is that The user full name is properly displayed.",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-74105",
                      "issue_description":"Update/certify JIRA Charting Plugin for compatibility with JIRA 9.0. Jira Charting plugin shows as incompatible with version 9.0",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-74083",
                      "issue_description":"Unable to add groups as board admin if the group name has a colon punctuation ( : ). The group is not added as board admin and there is a error message saying XXXX is not a valid group. Expected Results The group will be added as board admin",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-74081",
                      "issue_description":"Removing Transition permission also removes default View Workflow. The view of workflow as 'Read-Only' is hidden from the user when a user does not have a 'Resolve Issue' permission. This is not the case with the older versions.The read-only view of the Workflow should be visible regardless of the permissions. Or, set a different permission to enable/disable the view of workflow",
                      "fixed_version": "9.4.0"
                     },
                     {
                      "issue id":"JRASERVER-74080",
                      "issue_description":"Redundant trailing '.0' is added to the 'Story Points' custom field value while exporting to CSV/XML . While exporting JQL search results to CSV/XML (but not HTML), the values for the 'Story Points' custom field are appended with trailing '.0' even if this field has a whole number value. Expected Results is that From the user perspective, it is expected that 'Story Points' values would be exported in the way they are stored in DB and represented in Jira UI",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-74076",
                      "issue_description":"Tool Tip after hovering over workflow buttons is missing. The transition name is short and mouse hover does not work. Expected Results is that Mouse hover over the button should show full name and description as is older versions",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-74075",
                      "issue_description":"The success notification which appears when user create any issue is not accessible for screen reader & keyboard users. While navigating with a screen reader, when user Create a new issue from the 'create' modal dialog, a success notification message appears on the page. But screen reader doesn’t announce the same. Also keyboard only users can’t navigate to inside the notification since it automatically disappears after 4 seconds.This makes screen reader and keyboard-only users difficult to access the success notification on Jira. Expected Results is that As soon as the success notification appears the screen reader should announce it. Also the keyboard-only users should be able to navigate to the contents inside it. The notification should not be automatically dismissed. It should be visible on the page until users closes it explicitly",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-74073",
                      "issue_description":"Dashboard with Gadget : Non descriptive link text provided for colour links.Non-descriptive link text is provided for colour links in the gadgets menu present in the system dashboard.In the menu for the gadgets in the System dashboard, the colour links have inappropriate link text provided such as 'Color 1', 'Color 2', etc. to the colour link icons. As a result, screen reader users fail to understand the purpose of the link and won't be able to use the colour pallet effectively. Expected results is that It is advisable to provide descriptive and unique text for presenting links. For example, specify descriptive text 'Red colour' via the 'aria-label' property to make the information available only for screen reader users. Or an alternative could be changing the link text to 'Red colour' ",
                      "fixed_version": "9.5.0"
                     },
                     {
                      "issue id":"JRASERVER-74047",
                      "issue_description":"Versions and Epics filter : Interactive element is missing both a role and a name. The button is missing both a role and an accessible name/label.In the versions expanded filter section, the interactive elements has a missing role and value for it. The functionlity of the element is similar to a menu button. This would not make the screen reader understand the purpose associated with it. Additionally, the elements have missing keyboard support.Expected Results is that The element has a functionality more over like a menu button. The element could be defined as an <button> element or a role='button' could be provided.An accessible name should be provided with an aria-label, such as aria-label='Actions' ",
                      "fixed_version": "9.5.0"
                     },
                     {
                      "issue id":"JRASERVER-74045",
                      "issue_description":"Calender Widget : Button: The Calendars interactive elements have missing both a role and a name. In the calendar picker for the search basic filter, some of the interactive elements such as ' Question mark, Close, Prev Month (Single Left arrow), Next Month(Single Right arrow), Prev Year (Double Left arrow), and Next Year(Double Right arrow)' have a missing role and value for it. Expected Results is that The element has a functionality more over like a button. The element could be defined into an <button> element or a role='button' could be provided ",
                      "fixed_version": "9.5.0"
                     },
                     {
                      "issue id":"JRASERVER-74033",
                      "issue_description":"Browse Pojects : Inaccessible by keyboard and no conforming alternative. When the user navigates to the data table with the keyboard, the column headers 'Project, 'Key', 'Project type' etc, for the data are not accessible by the keyboard. This made it difficult for keyboard-only users to access the functionality associated with the element. Expected Results Ensure that all interactive elements are keyboard accessible",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-74032",
                      "issue_description":"Search Issue Basic : Action cannot be performed by Keyboard alone. There is no way to perform the function on elements such as 'Resolution Date', 'Label' etc using only the keyboard.This makes it keyboard-only and Screen reader users challenging to select 'Resolution Date', 'Label', etc while searching for an issue.Expected Results is that Following are the expected keyboard interactions.Functionality MUST be available using the keyboard unless the functionality cannot be accomplished in any known way using a keyboard.The elements should get activated with the 'Enter' key.The dates inside the modal should be able to receive keyboard focus.The focus should go back to the date input field after the date is selected",
                      "fixed_version": "9.2.0"
                     },
                     {
                      "issue id":"JRASERVER-74029",
                      "issue_description":"Drag and drop feature is not keyboard accessible",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JASERVER-74004",
                      "issue_description":"Select element for the time zone has a missing label in the preferences settings modal.The Time zone for different countries has a missing label on the select form field in the Preferences modal. Hence it would not be able to identify its purpose for the assistive technology users.Labels need to be explicitly associated with their respective form controls for assistive technologies to identify the label accurately and convey the information to the users",
                      "fixed_version": "9.5.0"

                     },
                     {
                      "issue id":"JRASERVER-74003 ",
                      "issue_description":"For the Create board modal, aria-hidden='true' is used on informative content making it inaccessible to assistive technology.The 'aria-hidden' attribute is provided to the Create board macro, which becomes available on activating the Create board button. As a result, screen reader users cannot access the modal effectively",
                      "fixed_version": "9.3.0"
                     },
                     {
                      "issue id":"JRASERVER-74002",
                      "issue_description":"The form field does not have an explicit or implicit <label> relationship for the Version selection element in the Delete Version modal.Labels need to be explicitly associated with their respective form controls for assistive technologies to identify the label accurately and convey the information to the users.Expected Results is to Provide a label such as 'Select version' to the select form element and additionally associate the label explicitly with the form control by providing an identical value that is unique from other IDs to 'for' and 'id' attributes to ensure that assistive technologies identify the label for the form control correctly.",
                      "fixed_version": "9.5.0"
                     },
                     {
                      "issue id":"JRASERVER-74000",
                      "issue_description":"Form elements must have labels.The form field does not have an explicit or implicit <label> relationship with the comment text input field on the User profile page.",
                      "fixed_version": "9.5.0"
                     },
                     {
                      "issue id":"JRASERVER-73989",
                      "issue_description":"Visible label/form field are not associated for the Share link.The 'Link to filter' input field in the Share popup does not have a label explicitly associated with it and the form field has a missing label. The 'for' and 'id' association is missing between the label and the form control",
                      "fixed_version": "9.5.0"
                     },
                     {
                      "issue id":"JRASERVER-73981",
                      "issue_description":"Scrum Software Development Wizard Modal 1 : aria-hidden='true' is used incorrectly.The 'aria-hidden' attribute is provided to the Project management modal, which becomes available on selecting the Project management option from the Create project modal. As a result, screen reader users cannot access the modal effectively",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-73980",
                      "issue_description":"Create an Agile Board Modal : aria-hidden='true' is used incorrectly. The 'aria-hidden' attribute is provided to the Create an Agile board modal, which becomes available on selecting the Scrum board or Kanban board option from the Create board modal. As a result, screen reader users cannot access the modal effectively.",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-73978",
                      "issue_description":"Versions and Epics filter : Missing label for input search field and explicit association.The input field for the Version search does not have a label explicitly associated with it. Additionally, there is a missing label on the input field. The 'for' and 'id' association is missing between the label and the form control. The screen reader announces it as 'edit text', which does not indicate any label associated with it and would not be able to identify its purpose for the assistive technology users",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-73971",
                      "issue_description":"Project icon images must have alternate text. Icon Images for projects in the Browse projects page have missing alt attributes.. It is expected to Provide alternate text for all the images using the 'alt' attribute. Ensure that the alternate text is descriptive of the image purpose",
                      "fixed_version": "9.5.0"
                     },
                     {
                      "issue id":"JRASERVER-73965",
                      "issue_description":"Project Sidebar: Focus indicator is missing on the Project title link.Missing visible focus on the 'Project title' link in the sidebar section for projects.The 'Project title' link is not visible when the user navigates via the keyboard in the sidebar section. However, it receives the keyboard focus forcing users to tab through invisible content. This results in an unpleasant experience for keyboard-only users while accessing the web page as they are not able to locate the focus. Ensure that the link is visible when they receive keyboard focus. Providing a highly visible highlighting mechanism for links or controls when they receive keyboard focus will make the user understand the content and make the user experience more smooth for keyboard-only users",
                      "fixed_version": "9.2.0"
                     },
                     {
                      "issue id":"JRASERVER-73961",
                      "issue_description":"Missing role and state Information of the 'Assignee' button.In search, the 'Assignee' button doesn’t convey the role & state Information to the screen reader users.Moreover the selected assignee values are not conveyed to the screen reader users.While navigating with screen reader, when user navigate to the 'Assignee' element, the screen reader doesn’t announce the role, state & selected assignee Information. The screen reader announces  like 'Admin, Bob, Mark, group' .This makes screen reader users difficult to access the functionality associated with the element",
                      "fixed_version": "9.3.0"
                     },
                     {
                      "issue id":"JRASERVER-73943",
                      "issue_description":" create issue dialog: ARIA role='toolbar'attribute provided unnecessarily.In create issue modal dialog, the <div> element containing 'configure fields' button have role='toolbar' attribute provided unnecessarily",
                      "fixed_version": "9.5.0"
                     },
                     {
                      "issue id":"JRASERVER-73942",
                      "issue_description":"Custom fields using Wiki Style Renderer get disabled after two or more mandatory field validation failures. Jira Fields using Wiki Style Renderer get disable after two or more mandatory field validation failures on Create Issue (pop up version). Create Issue form fields should not get disabled",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-73929",
                      "issue_description":"Switch comment box from visual to text breaks in next comment. When adding a new comment, if you switch from Visual to Text. When you next expand the box to add yet another comment, it will display some weird spacing in the UI.",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-73925",
                      "issue_description":"Using back button on the JQL search doesn't change the search result. This bug appears reproducible in both the list view & the detail view.There may be other scenarios that can produce this problem, those were just the simplest steps I could take to reproduce it. It seems most likely to come up if someone is editing & re-running a query, then wants to go back to prior query",
                      "fixed_version": "9.1.0"
                     },
                     {
                      "issue id":"JRASERVER-73903",
                      "issue_description":"Navigating to issue from traceability tab renders its content blank. The 'Traceability' web panel is present, but contains no content. No errors are found in the console",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-73772",
                      "issue_description":"Description Field is minimized on the 'Edit Screen' when it is NOT EMPTY and using 'Wiki Style Renderer' with 'Rich text editor' option disabled. Irrespective of the Rich text editor configuration, the Description field should display the edit window properly but Description field is minimized if it's using 'Wiki Style Renderer' with 'Rich text editor' disabled option",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-73755",
                      "issue_description":"Accessibility - Keyboard users can not access the global issue nav sidebar when it's undocked/collapsed.When using keyboard, it is not possible to reach the global issue nav sidebar when collapsed /undocked (getting skipped). When global issue nav sidebar is open/docked, it shows tooltip as - Undock the filter panel so it is hidden when not being focused (Type '[') When using screen reader, it doesn't reads out the keyboard shortcut info in this case (Type '[' ) reads it as blank instead of square bracket.We can not access the global issue nav sidebar when collapsed using the keyboard",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-73406",
                      "issue_description":" User are not searchable on assignee field when assigned to a shared group (assignee search dropdown does not return any result). User1, User2 are not displayed in the suggestions. Expected Results is that User1, User2 are displayed in the suggestions and can be selected as assignee",
                      "fixed_version": "None"
                     },
                     {
                      "issue id":"JRASERVER-73392",
                      "issue_description":"  Crop functionality is not keyboard accessible in the Avatar     profile modal.Actual results is that Crop tool inaccessible to keyboard/screen reader users, focus only on Confirm/Cancel buttons. Mouse-dependent resizing/cropping. Expected results is that Interactive crop tool focuses on keyboard and screen reader. Supports various input modes. While cropping, maintains focus unless Custom key is activated. Clear keyboard instructions accessible to screen reader users. Custom key functions facilitate keyboard image cropping.",
                      "fixed_version": "9.3.0"
                     },
                     {
                      "issue id":"JRASERVER-73389",
                      "issue_description":"The popup which shows information regarding release is not accessible to screen reader users.Actual results is that While the popup can be opened with keyboard, when using JAWS screen reader it cannot be opened.The popup stays open and never closes when navigating away from it with a tab.Expected results is that When using any screen reader the popup should be opened with keyboard.The popup should close when user tabs out of popup",
                      "fixed_version": "9.12.0"
                     },
                     {
                      "issue id":"JRASERVER-73380",
                      "issue_description":"The dock/undock element is not accessible by keyboard alone and there is no conforming accessible version of the same functionality reachable from the non-conforming page.Actual results is that In the Search Issues dashboard, the left navigation panel the 'Dock the filters panel' panel does receive keyboard focus when the panel is Undocked. When the panel is docked the element receives keyboard focus. Expected result is that The 'Dock the filters panel' should receive keyboard focus and screen reader.When the user docks and undocks the panel the screen reader should announce the actions",
                      "fixed_version": "9.3.0"
                     }
          ]
    },

    {
        "version": "9.1.x",
        "date_of_release": "5 December 2015",
        "issue":[
            {
                "issue id": "JSWSERVER-25855",
                "issue_description": "Learn more' link under Control Chart is not working. There is no response after clicking on 'Learn more' button. User clicking 'Learn more' expected to redirect Control Chart",
                "fixed_version" : "None"
            },
            {
                "issue id":"JSWSERVER-25321",
                "issue_description":"The number of issues at capacity insights for the Kanban team will be incorrectly calculated if 'Enhanced capacity distribution' feature disabled. The number of issues at capacity insights for Kanban teams will be incorrect in the Advanced Roadmaps plan in case you will disable the 'Enhanced capacity distribution' feature. It will be incorrectly calculated by summing up estimates (days/hours)."  , 
                "fixed_version": "9.14.0, 9.12.5"     
            },

            {
                "issue id":"JSWSERVER-25066 ",
                "issue_description": "After deleting the sprint the plan does not load. After deleting a sprint that had its capacity updated inside of a Plan, the referred Plan fails to load properly (the screen remains blank/empty ",
                "fixed_version" :"None" 
            },
            {
                "issue id":"JSWSERVER-24976",
                "issue_description": "Filter name with underscore is not listed in suggestion while creating the plan in Advanced Roadmaps. The Issue sources dropdown list should list suggestions for filters with an underscore in the filter name. ",
                "fixed_version" :"None" 
            },
            {
                "issue id":"JSWSERVER-24972  ",
                "issue_description": " Circular reference using issuesInPlan causes StackOverflowError.issuesInPlan JQL function can cause StackOverflow if this is a circular reference",
                "fixed_version" :"None" 
            },
            {
                "issue id":"JSWSERVER-21633",
                "issue_description": "Adding comment from Kanban Board causes contents of comment box to be erased. The comment is wiped. The comment should remain in the preview box. ",
                "fixed_version" :"None" 
            },
            {
                "issue id":"JSWSERVER-21470",
                "issue_description": "Basic search fails with error if the selected field has 'lozenge' formatted values.When a user tries to search for issues (in the basic search) and includes a customfield that has values formatted with lozenge, Jira immediately gives the pop-up error:The Jira server could not be contacted. This may be a temporary glitch or the server may be down. The error message pops up and the search cannot be done ",
                "fixed_version" :"None" 
            },
            {
                "issue id":"JSWSERVER-21450 ",
                "issue_description": " Clicking 'Where is my field' when adding Epic from Epics panel makes JSW hanging.Jira is hanging and to escape you have to click on 'Create' multiple times. But the expected result is to  configure fields without any issues",
                "fixed_version" :"None" 
            },
            {
                "issue id":"JSWSERVER-21437",
                "issue_description": "Comments toolbar: Non-descriptive link text for the 'Text color' toolbar. The link text for the 'Text color' link is non-descriptive in the comments toolbar. it is advisable to provide descriptive and unique text for presenting links. This will ensure that screen reader users can understand the purpose of the links when read out of context. For example, specify descriptive text 'Red- Text color' via the 'aria-label' property to make the information available only for screen reader users",
                "fixed_version" :"None" 
            },
            {
                "issue id":"JSWSERVER-21423 ",
                "issue_description": "Work log activity entries are showing 'Date Started'timestamps in a relative way. The Work log activity entries are showing 'Date Started' timestamps are shown relatively and there is no easy way to figure out their actual value. Expected Results is that The Work log activity entries should show a 'full' (absolute) timestamp (like it was before 9.0) or provide an easy option to figure it out (an additional entry in the tooltip would be helpful here) ",
                "fixed_version" :"9.3.0" 
            },
            
            {
                "issue id":"JSWSERVER-21423",
                "issue_description": " When having more than 1 Project in the Projects Gadget on a Dashboard, Jira v9.1.0 will not finish loading the Gadget. When using only 1 Project in the Gadget, Jira loads this successfully. Jira should  load and show the available Projects ",
                "fixed_version" : "9.1.1" 
            },
            {
                "issue id":"SWSERVER-21417 ",
                "issue_description": "Jira access token getting expired after 2 hours while connecting to Gitlab. The token expires and cannot be refreshed. Looks to be issue with threads in order to overwrite the new token. The token refresh should take place in the background and sync should work",
                "fixed_version" :"9.3.0 " 
            },
            {
                "issue id":"JSWSERVER-21416",
                "issue_description": "An incorrect link will be generated for viewing incomplete issues for the 'Version Report' report if you have statuses with the '&'' (ampersand) character. A generated link will not have '&' encoded as an HTML entity and the final JQL will not be able to complete successfully",
                "fixed_version" :"None" 
            },
            {
                "issue id":"JSWSERVER-20256 ",
                "issue_description": "Sprint Health Gadget return incorrect JQL when Status contains a 's&'' symbol when clicking on View in Issue Navigator link. JIRA will open Issue navigator with JQL below cut off after '&'' symbol ",
                "fixed_version" :"None" 
            },
            {
                "issue id":"JSDSERVER-11253",
                "issue_description": "objects do not appear on the Insight Project Information page if the child object inherits Project type attributes from the parent.Nothing is displayed on the Insight Project Information page. But We should see the object referenced object on the Insight Project Information page",
                "fixed_version" :"none" 
            },
            {
                "issue id":"JRASERVER-73422",
                "issue_description": "On the backlog page, the issue count menu popup is not accessible for screen reader users. The required ARIA attributes are not provided in the code. ",
                "fixed_version" :"9.5.0" 
            },
            {
                "issue id":"JRASERVER-73406",
                "issue_description": "User are not searchable on assignee field when assigned to a shared group. The issue reproducible on Jira software versions >= 8.19.1. ",
                "fixed_version" :"None" 
            },
            {
                "issue id":"JRASERVER-73272 ",
                "issue_description": "On Dashboard page, the drag and drop feature for widgets such as 'Bubble chart' is not accessible for keyboard & screen reader users.The element to drag/drop widget doesn’t receive keyboard focus.Expected Results: The users should be able to drag & drop widgets with keyboard alone. Also there should be instructions on the page providing the Information on accessing drag & drop functionality with keyboard. ",
                "fixed_version" :"9.3.0" 
            },
            {
                "issue id":"JRASERVER-27438 ",
                "issue_description": "If the plugin system gets an exception while trying to delete the Felix OSGI cache, JIRA gets locked and is unusable. There are two known causes for this issue: The inconsistency of OSGI plugin caches triggered from inappropriate shutdown of Tomcat. The Tomcat user does not have the correct permissions to access the directory.Expected Results:  JIRA is able to clear out the directory and start up. ",
                "fixed_version" :"None" 
            },
            {
                "issue id":"JIRAAUTOSERVER-1009",
                "issue_description": "When we export an automation rule and subsequently import it on the same instance with a duplicate name, as per the functionality application should rename the automation rule with 'Copy of' in the prefix. However, it fails to do so. ",
                "fixed_version" :"9.2.0, 10.0.0 " 
            },
            {
                "issue id":"BAM-25706 ",
                "issue_description": "Bamboo YAML Validator does not support the !include tag in YAML files.Expected Results:  The YAML Validation should validate YAML files even if they have !include tags in it.Actual Results: A pop-up message appears in the UI with the message: he YAML configuration is invalid.   There's something wrong with the YAML configuration. Fix the errors and try again. ",
                "fixed_version" :"None" 
            },
            {
                "issue id":"BAM-25400 ",
                "issue_description": " Encrypting passwords in server.xml page contains a banner that may mislead users to believe this is a DB password encryption . Expected Results:  The highlighted text should be modified to clarify that the encrypted passwords will still be sent in a clear-text format when using the AJP protocol over HTTP and advise customers to use HTTPS whenever possible.",
                "fixed_version" :"None" 
            },
            {
                "issue id":"BAM-22469",
                "issue_description": "When running multiple Remote Agents on the same server using the same user, a race condition exists where multiple Docker Login tasks can overlap and the wrong credentials can be used.n limited scenarios where the docker login tasks are executed in a very short period of time the credentials may get overwritten before being referenced by the task, or when a task ends it performs a docker logout and removes any credentials from the system. Task fails with invalid credentials error. ",
                "fixed_version" :"None" 
            },
            {
                "issue id":"BAM-22248 ",
                "issue_description": "Generating Java code using OpenAPI spec does not match the JSON response.Expected Results: The JSON response and the XML definition are matching.  Actual Results:       There is a mismatch between them meaning the spec requires manual intervention to make it correct. ",
                "fixed_version" :"None" 
            },
            {
                "issue id":"BAM-22119",
                "issue_description": "O(n) complexity in DeploymentAggregator. where n is number of versions related to a JIRA ticket.For each related deployment version, Bamboo runs 2 additional queries ",
                "fixed_version" :"9.3.0, 9.1.2, 8.2.8, 9.0.3, 9.2.3 " 
            },
            {
                "issue id":"BAM-22096 ",
                "issue_description": "Bamboo Elastic Instance fails to mount EBS snapshot volume if an Instance Store volume is present on the EC2 instance.Expected Results: Bamboo should be able to mount the EBS volume regardless of the presence of other non-EBS volumes in any order ",
                "fixed_version" :"9.3.0, 9.1.2, 9.2.3" 
            },
            {
                "issue id":"BAM-20248",
                "issue_description": "The scheduler worker thread pool can completely block with a hung TCP connection waiting for an HTTP CONNECT response from an outbound proxy because there's no SocketTimeout.Expected Results: Socket timeout should be hit and an exception should be thrown. Actual Results: Thread sits waiting indefinitely until the TCP connection is closed or Bamboo is restarted. Each scheduler thread gets put into an infinite wait each time a Stash Polling Quartz job is run while waiting for cache population. Eventually, the whole thread pool is starved and no scheduled jobs run. ",
                "fixed_version" :"9.3.0, 9.2.3," 
            },
            {
                "issue id":" ",
                "issue_description": " ",
                "fixed_version" :" " 
            },
            {
                "issue id":" ",
                "issue_description": " ",
                "fixed_version" :" " 
            },
            {
                "issue id":" ",
                "issue_description": " ",
                "fixed_version" :" " 
            },
            {
                "issue id":" ",
                "issue_description": " ",
                "fixed_version" :" " 
            },
            {
                "issue id":" ",
                "issue_description": " ",
                "fixed_version" :" " 
            },

            {
                "issue id":" ",
                "issue_description": " ",
                "fixed_version" :" " 
            },
            {
                "issue id":" ",
                "issue_description": " ",
                "fixed_version" :" " 
            },
            {
                "issue id":" ",
                "issue_description": " ",
                "fixed_version" :" " 
            },
            {
                "issue id":" ",
                "issue_description": " ",
                "fixed_version" :" " 
            }


        

        ]
        
      },
      {
        "version": "9.2.x",
        "date_of_release": "5 December 2015",
        "issue":[
            {
                "issue id": "JRASERVER-74244",
                "issue_description": "When the exception is thrown from full reindex during node startup, Jira will end in the state with a non-dismissible Johnson page and display a stack trace of this exception.Actual result is that a non-dismissible Johnson page is displayed with stack trace only.Expected result is that Dismissible Johnson page with the more readable error message. ",
                "fixed_version":  "9.3.0, 9.2.1 "
              },
              {
                "issue id": "JRASERVER-65645 ",
                "issue_description": "If the same username exist in multiple directories, when auto suggest/auto complete the users in issue navigator and assignee field, it will display duplicate username. ",
                "fixed_version":  "None  "
            },
             {
                "issue id": "BAM-25786 ",
                "issue_description": "Enable repository caching on agents' in Plan Branches Repositories custom configuration remains checked even if it is unchecked. Using a linked repository in a Branch plan we are unable to disable the 'Enable repository caching on agents' option.Expected result is that The 'Enable repository caching on agents' option is disabled. ",
	            "fixed_version":  "10.0.0, 9.5.5, 9.6.3, 9.2.15"
             },
             {
                "issue id": "BAM-25781",
                "issue_description": "All releases of a deployment are loaded at once, causing slowness  is that When loading the Releases page of a deployment project or running a new deployment and selecting 'Promote existing release to this environment', Bamboo runs SQL queries that retrieve the details and information about all the releases tied to that deployment. In large data environments where releases have not been purged over time, the long list of releases to be loaded can cause slowness/sluggishness. ",
                 "fixed_version":  " 10.0.0 "
             },
             {
                "issue id": " BAM-25762",
                "issue_description": "When using source code checkout task for bitbucket repository with submodules in bamboo on Windows(with windows remote agent), the source code checkout task for submodule fails when SSH key applies to submodules option is enabled in the bamboo linked repository. ",
                 "fixed_version":  " None "
              },
              {
                "issue id": " BAM-25743",
                "issue_description": "When a Build Project is deleted in Bamboo and the build project is dedicated to an agent, the agent remains in dedicated state and does not get unassigned. This prevents the agent not able to take up any more build or deployment jobs. ",
                "fixed_version":  "  10.0.0, 9.5.4, 9.6.2, 9.2.14"
            },
            {
                "issue id": "BAM-25721 ",
                "issue_description": "HTTP Compression for Artifacts cannot set to Disable for specs plan is that HTTP Compression for Artifacts cannot set to Disable when using specs to manage plan.For plans created manually, HTTP compression can be set to Disable by unchecking the Compression option in the Artifact definition. ",
                "fixed_version":  " 9.6.1, 9.2.13, 9.5.3 "
            },
            {
                "issue id": "BAM-25694 ",
                "issue_description": "When a branch is marked for deletion by a repository event, it enters a grace period before being permanently deleted by Bamboo. During this interim, the branch remains listed in the Bamboo specs scan dropdown menu, allowing users to select it for scanning operations. This unintended behavior can lead to scan failures as operations are attempted on branches that are in the process of being removed. ",
                "fixed_version":  " None  "
            },
            {
               "issue id": "BAM-25648",
               "issue_description": "Plans which are created by Bamboo YAML Specs gets disabled on Bamboo GUI when any incorrect changes are done on the specs file and the specs scan is done.When these incorrect changes are corrected and the specs scan in Bamboo in succesfull, the plan remains in disabled state, ideally it should get enabled automatically if the specs scan is succesfull.The only way to make this work in to enable all the plans manually and then do the specs scan, this creates problem when there are multiple plan under a single specs project. ",
               "fixed_version":  "  9.6.0"
            },
            {
              "issue id": "JRASERVER-74705 ",
              "issue_description": "Getting an error when trying to save an Outgoing Mail configuration in Jira using the JNDI Location setting is that It is not possible to save an Outgoing Mail configuration in Jira using the JNDI Location setting. When clicking on the Save button after testing the connection, the user is redirected to the Oops error page, with the error Sorry.",
              "fixed_version":  "9.9.0, 9.4.7 "
             },
             {
                "issue id": "JRASERVER-74695 ",
                "issue_description": "In the Rich Text Editor, when editing table properties in visual mode and saving the changes, all new values disappear and seems to be lost if you enter into the edition mode again.",
                "fixed_version":  "None  "
            },
            {
             "issue id": "JRASERVER-74628 ",
             "issue_description": "Remote link update entries incorrectly listed when accessing issues on Jira 9.2 is that Jira will create an entry on both activity feed and also on issue history whenever a user authenticates.Actual result is Incorrect reporting on the issue history/activity gadget ",
            "fixed_version":  "9.9.0, 9.4.7 "
            },
            {
                "issue id": "JRASERVER-74528 ",
                 "issue_description": "After upgrading Jira 9.x, the assignee of the Jira events cannot be displayed on the Team Calendars if the Jira Description field contains a newline (shift+enter while the Description field is on 'Visual' mode, not new paragraph by using just enter). ",
                "fixed_version":  "None  "
            },
            {
                "issue id": "JRASERVER-74518 ",
                "issue_description": "Team Calendars cannot display Jira Issue events when there are special characters in the Jira Description on Jira 9.x.This problem occurs when the issue description area contains an enter character followed by a semicolon. It does not matter if additional characters exist between enter and semicolon characters. The bug can easily be reproducible when using only one entered character followed by a semicolon in the description area of the issues. However other special characters can cause the same issue which has not been identified yet. ",
               "fixed_version":  "9.9.0, 9.4.10  "
            },
            {
                "issue id": "JRASERVER-74480 ",
                 "ssue_description": "This issue seems to be apparent on all projects across our instance. When a user is on the backlog and has the EPICS panel open on the left hand side and all issues displayed to the right of the EPICS panel. If a user move a ticket from all issues to an Epic and then goes on to select that epic in the EPICS panel to view all issues in that Epic it still continues to show all issues. ",
                 "fixed_version":  "  "
            }
      
      
            
        ]
    },

    {
        "version": "9.3.x",
        "date_of_release": "5 December 2015",
        "issue":[
            {
                "issue id": "JSWSERVER-25861",
                "issue_description": "Jira returns HTTP/503 instead of HTTP/403 or HTTP/404 when a JS source map is requested. Jira responds with HTTP/403 Forbidden or HTTP/404 Not found since source maps are not available.",
                "fixed_version" : "None"
            },
            {
                "issue id":"JSWSERVER-25853",
                "issue_description":"The excluded releases are added back if any excluded issue is added back to the plan. The list of Excluded Releases for a plan is entirely removed when a previously excluded Issue is Re-included. Operations pertaining to Issues being excluded/re-included should have no effect on the list of Excluded"    , 
                "fixed_version": "None"     
            },
            {
                "issue id":"JSWSERVER-25839 ",
                "issue_description":"User Picker from Reporter field is allowing to add users who do not have Browse Project permission. Manually typing the username and clicking anywhere on the screen add the user as Reporter.Expected Result is that  We shouldn't be able to add the user by manually typing it's username, as this user does not have Browser Project permission. "    , 
                "fixed_version": "None"     
            },
            {
                "issue id":"JSWSERVER-25825",
                "issue_description":"Jira keyboard shortcut of 'm' doesn't work after uploading a file via copy/paste. Expected Results is that The m shortcut should work fine after copying/pasting a file as it works while using the drag-and-drop feature"    , 
                "fixed_version": "None"     
            },
            {
                "issue id":"JSWSERVER-25776",
                "issue_description":" Updating an issue in epic in Kanban board throws a Javascript error. Expected Result is that The update should work without any javascript error"    , 
                "fixed_version": "None"     
            },
            {
                "issue id":"JRASERVER-47734",
                "issue_description":"some Documentation error"    , 
                "fixed_version": "None"     
            },
            {
                "issue id":"JSWSERVER-25509",
                "issue_description":"Plan settings menu overlaps dropdown items from the top navigation bar. Jira will successfully display a dropdown for the items."    , 
                "fixed_version": "None"     
            },
            {
                "issue id": "JSWSERVER-25501",
                "issue_description": "Quick Filter caused javascript errors  When a quick filter hides stories under epic or subtasks under story, user will hit Javascript error when editing the issue using edit action on right tab panel on story/subtask. There shouldn't be any Javascript errors happening. If does not allow, Jira should warn the user that they have a Quick Filter blocking the request. ",
                "fixed_version": "None"
            },
            {
                "issue id": "JSWSERVER-24972",
                "issue_description": "Circular reference using issuesInPlan causes Stack Overflow Error. issuesInPlan JQL function can cause StackOverflow if this is a circular reference. ",
                "fixed_version ":  "None"
            },
            {
                "issue id": "JSWSERVER-24947",
                "Issue_description": "Multiple fix versions are no longer displayed on Advanced Roadmap plans. Only one fix version is displayed. Expected Results is that Multiple fix versions are displayed as they were in Live Plans",
                "fixed_version":  "None"
            },
            {
                "issue id": "JSWSERVER-21978",
                "issue_description": "Right-click context menu stuck based on cursor movement. Right-click context menu within boards (scrum and kanban) gets stuck when moving the cursor to a different direction.The cursor option is stuck, and can only move to the next menu item that follows the order (ascending or descending) in which it started at.Expected Results is that The expected menu option is highlighted and the menu is functional.",
                "fixed_version":  "None"
            },
            {
                "issue id": "JSWSERVER-21653",
                "issue_description": "Issue searching of component field value are not saved. The component field values selected under more options are not saved, and getting reset to default when other fields (like issue type, date, etc) values are changed. This behavior is impacting saved filters. The component field gets reset to the default value.Expected Results is that the Component field search should retain values ",
                "fixed_version": "None"
            },
            {
                "issue id": "JSWSERVER-21621",
                "issue_description": "Jira Calendar Dashboard Gadget isn't respecting selected value. We see that the value selected for Date to Display always set as Created. Expected Results is that We expect that the Date to Display  set value should be the result returned.",
                "fixed_version":  "None"
             },
             {
                "issue id": "JSWSERVER-21554",
                "issue_description": "Several issues with mouse focus and clicking on links.You have to click multiple times or refresh the page.When clicking on this menu items, Jira should react faster and you should not have to repeat the mouse clicking.",
                "fixed_version": "None"
            },
            {
                "issue id": "JSWSERVER-21543",
                "issue_description": "When viewing a board's backlog, the epic panel is not expanded and no epic details are shown, if the Epic is listed based on search.Epic data cannot be seen, and the information hides shortly. Expected Results Expect to see Epic information in Epic panel after clicking expand ",
                "fixed_version":  "9.4.1"
            },
            {
                "issue id": "JSWSERVER-21495",
                "issue_description": "When editing Filter Results gadget drag-dropping fields moves them to the right. The 'Column to display' fields should move in a linear way during drag-drop ",
                "fixed_version" : "None"
            },
            {
                "issue id": "JSWSERVER-21481",
                "issue_description": "When hovering over the menu items in the right-click context menu for an issue in a sprint or backlog the gray background does not follow the cursor when scrolling across the menu items.Instead the gray background will appear on the first few menu items when scrolling but freezes quickly.Expected Results is that The gray background should follow the cursor as you scroll over the menu items",
                "fixed_version":  "9.6.0"
            },
            {
                "issue id": "JSWSERVER-20841",
                "issue_description": "Fields hidden in the field configuration scheme appear as option in the Issue Detail View.Fields that are set as hidden in the field configuration still appear as valid options in the Issue Detail View within the board settings in Software projects The newly created field shouldn't appear as an option ",
                "fixed_version":  "None"
            },
            {
                "issue id": "JSWSERVER-19928",
                 "issue_description": "Priority text is overlapping with the issue summary. The name of the Priority field is overlapping with the issue summary in some of the cards in the Backlog view.The priority field is not showing as an icon, but as text, and the text is overlapping with the issue description",
               "fixed_version":  "None"
            },
            {
                "issue id": "JSWSERVER-13494",
                 "issue_description": "Readonly user gets error when viewing board configuration if Card Colour JQL.It seems, the code wants to do something with an card colour create element, but it is absent. It is absent, because a user doesn't have the permission to edit the JQL query on Card colors tab and therefore the <textarea> doesn't exist.",
                 "fixed_version":  "None"
            },
            {
                "issue id": "JRASERVER-77587",
                 "issue_description": "Jira Dashboard Columns Text does not always wrap when using Multiselect Custom Fields.Jira Dashboard Columns Text does not always wrap when using Multiselect Custom Fields.Text is cut off. Expected Results is that The text Should wrap and continue on a second line.",
                "fixed_version":  "None"
            },
            {
                "issue id": "JRASERVER-77563",
                 "issue_description": "Copy and pasted images to issues containing a '/' (forward slash) cannot be viewed in GUI and they result in 400 errors (malformed request). Expected Results is that System should allow the users to access these attachments as they are uploaded and thumbnails clearly show the screenshots attached.",
             "fixed_version":  "None"
            },  
            {
                "issue id": "JRASERVER-77554",
                 "issue_description": "Lazy loading of iframe gadgets on dashboard is broken.The content of all iframe gadgets is loaded on page load, regardless of their position on a page. Expected Results is that The content of iframe gadget should be loaded only when the gadget is within the viewport.",
              "fixed_version":  "None"
            },
            {
                "issue id": "JRASERVER-77526",
                 "issue_description": "In basic search, the issue navigator only displays limited values selected for the multi-level custom field, even when more values are chosen in advanced search.Expected Results is that All values chosen in the advanced search should be visible in the basic search as selected.",
              "fixed_version":  "None"
             },
             {
                "issue id": "JRASERVER-77497",
                 "issue_description": "Searching for Boards by applying both filters not returning the correct information.When we apply Kanban filter, we get only Kanban Boards are visible. apply Both Kanban and Scrum filters and notice only Kanban Boards are visible. The system should display the correct board information when the right filter (Scrum OR Kanban) is selected.When both filters are selected system should return all the boards including Scrum Boards instead of only Kanban Boards.",
             "fixed_version":  "None"
            },
            {
                "issue id": "JRASERVER-77461",
                 "issue_description": "Change Customer Request Type field is selected automatically in the bulk edit screen. When we do a bulk edit for the issues that have the same request type, in the bulk edit screen the value for the Change Customer Request Type field is selected default.Expected Results is that The change Customer Request Type field should give the option to select the necessary option.",
              "fixed_version":  "None"
            },
            {
                "issue id": "JRASERVER-77332",
                 "issue_description": "Division Slider in Search Results screen doesn't work. Expected Results is that The sidebar should move accordingly there by expanding or contracting the Listed issues section. ",
              "fixed_version":  "None"
            },
            {
                "issue id": "JRASERVER-77055",
                 "issue_description": "CSV import allow future date cause index summary showing inconsistent data. CSV import allows to import the future date and cause the inconsistent data showing in the lastUpdatedInIndex information from the rest/api/2/index/summary endpoint.. Expected Results is that CSV import shouldn't be allowed to import the future date.",
           "fixed_version":  "None"
              },
            {
                "issue id": "JRASERVER-76983",
                 "issue_description": "Comment keyboard shortcut 'm' doesn't work after changing assignee or reporter. Comment box does not open after changing the assignee or reporter fields.Expected Results is that Comment box should open at all times when you press 'm'.",
               "fixed_version":  "None"
            },
            {
                "issue id": "JRASERVER-76851",
                 "issue_description": "Progress pop-up shows up in HTML format instead of the progress bar graph.The progress bar shows data in HTML format when you hover the mouse over the progress field.Expected Result is that When you hover the mouse over the progress field, the progress bar graph should pop - up.",
             "fixed_version":  "None"
          },
          {
            "issue id": "JRASERVER-76634",
             "issue_description": "Jira allows adding attachments with unsupported characters in the filenameThe attachment with unsupported characters is being added to the issue. For any unsupported character in the filename, Jira will show a thumbnail in the Attachments section correctly. When Attachment is not added, and the error about the special characters  is thrown",
          "fixed_version":  "None"
         },
         {
            "issue id": "JRASERVER-76452",
             "issue_description": "Style issues with fields. The edits on the fields like label, version, etc have issues retaining the colour as defined under the Look and Feel option.The text is highlighted in red without the mouse hover.The pencil icon stays until the next action is done.A loom recording is attached for your reference. Expected Result is that Colouring should only change when the mouse hover is done.The pencil icon should be hidden when the edit is done.",
           "fixed_version":  "None"
         },
         {
            "issue id": "JRASERVER-76426",
             "issue_description": "Status dropdown malfunctions when there are more than 100 statuses.Expected Results are that The selected status is displayed as a selected option. And The dropdown can be interacted as expected (other options can be added without losing current selection, etc.) ",
            "fixed_version":  "None"
        },
        {
            "issue id": "JRASERVER-76141",
             "issue_description": "Configuring linked issues in Kanban board layout displays other links instead of only issue links.Kanban board layout allows you to display many different types of fields including 'Linked Issues'. In Jira 8.x, linked issues showing in the Kanban board card wouldn't include other links (e.g. Confluence links) but starting in Jira 9.x other links are displayed.Expected Result is that the issue with links to other issues (no other links like confluence)",
            "fixed_version":  "None"
         },
         {
            "issue id": "JRASERVER-74818",
             "issue_description": "The 'Connection Test' fails on the Outgoing Mail server when the option 'Change password' is not ticked. Expected behaviour is that The connection test should be successful as it was earlier, since , nothing was changed in the outgoing mail configuration and the SMTP mail server does not require any username/password for the authentication ",
              "fixed_version":  "9.11.0"
         },
         {
            "issue id": "JRASERVER-74762",
            "issue_description": "The page links don't work in the User Picker and Group Picker popup.From the Jira Edit Issue page, it is possible to open a User Picker pop-up for any multi-user picker field, to search for users.If the number of users found in the search is higher than the number from Users per page, the results will be split into multiple pages.Expected Result is that The results from the 2nd page should be displayed.",
             "fixed_version":  "9.13.0, 9.4.21, 9.12.8"
        },
        {
        "issue id": "JRASERVER-74711",
        "issue_description": "Released/Unreleased version split missing in Edit issue screen. Released/Unreleased split is missing for Fix Versions and Affected Versions on the Edit Issue Screen.Expected Result is that Released unreleased split is present",
        "fixed_version":  "None"
        },
  
        {
            "issue id": "JRASERVER-74687",
            "issue_description": "Workflow dropdown options not loading if opened before conditions met. If you have a condition on every transition of a workflow, such as 'Only the assignee of the issue can execute this transition.', then when you open the workflow dropdown, you will get an error. If you then meet the condition, such as assign the issue, and open the dropdown again, the contents will not load until you refresh the page. The dropdown should properly show the workflow transitions if the conditions have been met. ",
           "fixed_version":  "None"
           },
           {
            "issue id": "JRASERVER-74589",
             "issue_description": "Dragging and dropping files on transition screen results in duplicate attachments. Two copies of the file are attached.Expected Result is that One copy of the file is attached.",
              "fixed_version":  "9.4.3, 9.7.0"
         },
         {
        "issue id": "JRASERVER-74585",
        "issue_description": "Linking issues with remote link creates duplicate history entries.Linked issues using application links create duplicate entries in the issue history tab.A new entry with original and new values set to the same issue link is added to the issue history.this entry is added every time the remote issue is transitioned to a new state or a new user tries to make the new remote link.  this behaviour is causing flooding of the issue history. and in turn causing inconvenience for customers to identify real change.Expected Result is that Only one entry in the history tab to be seen. ",
        "fixed_version":  "9.9.0, 9.4.6"
       },
       {
        "issue id": "JRASERVER-74576",
         "issue_description": "Browse projects page performance regression. Our performance tests detected ~10% regression on the Browse projects action. ",
       "fixed_version":  "9.4.1"
        },
        {
            "issue id": "JRASERVER-74568",
             "issue_description": "Clicking add comment before the Jira page loads, causes the text box to open as a new page.I expect the add comment box to always created at the bottom of an issue, instead of a new page.",
             "fixed_version":  "None"
        },
        {
            "issue id": "JRASERVER-74563",
             "issue_description": "Creating a comment puts absolute date as a timestamp. Comment is instead shown with date in ISO format.Expected Result is that the Comment is shown with relative timestamp, e.g. Just now.",
         "fixed_version":  "9.4.2"
        },
        {
            "issue id": "JRASERVER-74555",
             "issue_description": "Kanban Backlog shows blank content and two scrollbars. The Board shows blank content at the end of the page after you scroll down the issues (i.e. backlog).This happens only with Chrome and Edge but not with Firefox. A screen recording is attached for reference.No blank space is required at the end of the page while a board is viewed.Expected Result is that The blank space/panel appears at the end of the page.",
          "fixed_version":  "9.5.0, 9.4.1"
       },
  
       {
        "issue id": "JRASERVER-74542",
         "issue_description": "Project Import with archived issues. Whenever using the Jira’s Project Import feature to import a project from a backup file, the archived issues are imported as unarchived in the target instance, the Jira Project Import handler might be not importing the correct value for the “ARCHIVED” column in the target instance.The issues that were archived returned as not archived.Expected Result is that the Issues that were archived should remain as archived after importing.",
         "fixed_version":  "None"
         },


        {
        "issue id": "",
         "issue_description": "Project reindex is not replicated to an offline node. When a node is offline while a project is being reindexed, the project won't be present in index when that node comes back online.Node that has been offline does not re-index the project.Issues don't appear in the search results.Expected Result is that Node that has been offline re-indexes the project during startup.Issues from the project can be searched.",
          "fixed_version":  "9.4.1"
     },


        {
        "issue id": "JRASERVER-74530",
         "issue_description": "The help icon links are opening in a new tab without warning.Expected result is that As a best practice provide an icon beside the link to provide a visual cue about link opening in new tab.",
        "fixed_version":  "9.13.0"
    },
    {   
        "issue id": "JRASERVER-74525",
         "issue_description": "Using the chrome scrollbar to Scrolling through the backlog using the chrome scrollbar breaks the screen with white spaces.Expected Result is that The page should be seamless and should display like a normal page with data on it without white spaces that covers part of the page.",
        "fixed_version":  "9.4.1"
     },
     {
        "issue id": "JRASERVER-74522 ",
         "issue_description": "Multiple links redirects to same page.The links adjacent to each other should not be used to redirect the user to same page unless it is required.In this case remove the user profile icon <a> element present inside <span class=”user-icon”> since it is redundant & similar link is available right next to the profile icon.",
         "fixed_version":  "9.10.0 "
  },


{
        "issue id": "JRASERVER-74521",
         "issue_description": " System Dashboard: Inappropriate heading structure.Heading structure is found to be inappropriate on the page. Text such as 'Introduction', 'Assigned to me', 'Activity stream', etc are marked as <h3> and 'Your company Jira' is marked as <h3> inappropriately.Expected Result is that The heading levels should be announced as per the visual hierarchy by screen reader to understand the page structure.",
        "fixed_version":  " 9.6.0"
  },


  {
        "issue id": "JRASERVER-74518",
         "issue_description": " Team Calendars cannot display Jira Issue events when there are special characters in the Jira Description. After upgrading Jira 9.x, Jira events cannot be displayed (or partially displayed*) on the Team Calendars if the Jira ticket has special characters in its 'Description' field.This problem occurs when the issue description area contains an enter character followed by a semicolon. It does not matter if additional characters exist between enter and semicolon characters.Expected Result is that The event should be displayed on the Team Calendars for the chosen 'Due Date' while creating the Jira Story issue. ",
         "fixed_version":  "9.9.0, 9.4.10"
  },
  {
    "issue id": "JRASERVER-74506",
     "issue_description": "Product document Running Jira applications over SSL or HTTPS has incorrect step for command line installation.Document Running Jira application over SSL or HTTPS, has an inconsistent step on section Advanced configuration",
"   fixed_version":  "8.13.0, 8.14.0, 8.15.0, 8.16.0, 8.17.0, 8.18.0, 8.19.0, 8.20.0,"
},


{
    "issue id": "JRASERVER-74499",
     "issue_description": "  Placeholder text fails minimum color contrast requirement. When checked with Color contrast analyser tool, the colour contrast of placeholder text i.e ‘Search’ present for ‘Search’ input field fails with its background color . Expected Result is that On all pages, ensure that each text/background color combination presents a contrast ratio of at least 4.5:1 for small text and 3:1 for text that is at least 18 points or bold 14 points.The mentioned placeholder text should have color contrast ratio of 4.5:1. This helps low vision users to perceive the text more effectively.",
    " fixed_version":  "None "
},


{
    "issue id": "JRASERVER-74498",
     "issue_description": "  Text fails minimum color contrast requirement. When checked with the colour contrast analyzer tool, the colour contrast for mentioned text fails minimum colour contrast requirements of 4.5:1.Expected Result is that On all pages, ensure that each text/background color combination presents a contrast ratio of at least 4.5:1 for small text and 3:1 for text that is at least 18 points or bold 14 points.The mentioned text should have color contrast ratio of 4.5:1. This helps low vision users to perceive the text more effectively.",
    "fixed_version":  "9.5.0"
},


{
    "issue id": "",
     "issue_description": " In the backlog, users are unable to refine issues per Epic when moving an issue into an Epic.This issue seems to be apparent on all projects across our instance. When a user is on the backlog and has the EPICS panel open on the left hand side and all issues displayed to the right of the EPICS panel. If a user move a ticket from all issues to an Epic and then goes on to select that epic in the EPICS panel to view all issues in that Epic it still continues to show all issues.After moving an issue to an Epic, user sees all issues after clicking on the Epic from the Epic panel.Expected Result is that After moving the issue to an Epic, the user should be able to see all issues under the epic after click on Epic instead of showing all other Epic issues.",
    "fixed_version":  "9.4.1"
},
{
    "issue id": "",
     "issue_description": "color palette is inaccessible for keyboard & screen reader usersWhile navigating with Keyboard & screen reader, when user opens 'more options(...)' menu inside epics section, the different color elements are present which doesn’t receive Keyboard & screen reader focus. However currently they are only accessible via mouse click. Expected Result is that All the interactive elements on the page must be Accessible with Keyboard & screen reader. The color palette present inside more epic options should be accessible for keyboard & screen reader users.",
"fixed_version":  "None"
},


{
    "issue id": "",
     "issue_description": " Editing Project Roles from user management menu causes 405 Error. Jira throws error 405 and doesn't allow the user to continue. Expected Result is that The administrator will be directed to the hidden entries where they can bulk select the project roles for the user.",
"fixed_version":  "9.4.0 "
},


{
    "issue id": "",
     "issue_description": "Announcement banner showing code outside the announcement box. When a code (HTML, JS, CSS) is placed in the announcement banner box, and click set banne ' the code is displayed at the bottom of the box. Expected Result is to Set the announcement banner, and display the text in the ' announcement box only.",
"fixed_version":  "None"
},


{
    "issue id": "JRASERVER-74443",
     "issue_description": " The key combination provided inside description textarea does not work with keyboard While focus is inside description textarea, as per the label when user presses alt + 0 (or option + 0 in mac) nothing happens.This makes screen reader users difficult to understand the functionality associated with the key combinations Expected Result is that When user presses alt + 0 (or option + 0 in mac) the help functionality should be made available to the users.",
        "fixed_version":  " 9.9.0"
},


{
    "issue id": "JRASERVER-74395",
     "issue_description": "Trying to display a user's Uncategorized Projects results in a http status 405 error. Expected Result is to Assign permission to the selected project. ",
    "fixed_version":  "None"
},


{
    "issue id": "JRASERVER-74358",
     "issue_description": "Minimized gadgets still consume a whole space of expanded gadgets on the dashboard.Expected Result is that Minimized gadgets will still consume only the space required for the header row after page refresh",
"fixed_version":  "9.6.0, 9.4.3"
},
{
    "issue id": "JRASERVER-74342",
"issue_description": "Projects with underscore in project key are broken/redirect removes the underscore of the issue key, sidebar fails to loadExpected Result is that When using a link to access the issue it should load without error. Underscore should not be removed from project key and the issue should open on the page refresh.",
"fixed_version":  "9.4.0, 9.5.0"
},


{
    "issue id": "JRASERVER-74330",
"issue_description": "Node doesn't catch-up issue archiving operations. On node1 archived issues appear in the search. Expected Result is that On node1 you cannot search for archived issues",
"fixed_version":  "9.4.0, 9.3.2 "
},


{
    "issue id": "JRASERVER-74329",
     "issue_description": "Starting a node while other node is performing full reindex may lead to inconsisten index.The index might not reflect the change in issues indexing configuration for example if indexer of custom field changed. Expected Result is that Node 2 index is healthy after startup and index contains all the changes introduced during full re-index.",
"fixed_version":  "None"
},


{
    "issue id": "JRASERVER-74326",
     "issue_description": "The username field is treated as a mandatory field in the outgoing mail server configuration. The connection test is not executed when the username field is not filled in, and the Jira admin user is forced to enter a username. Expected Result is that The connection test should be executed even if the username field is not filled in",
"fixed_version":  "9.11.0, 9.4.9, 9.10.1"
},
{
    "issue id": "JRASERVER-74321",
     "issue_description": "Upgrade from 8.x to 9.1 triggers full reindex twice. Full re-index is triggered twice: once before upgrade task as part of every node index startup flow and once after upgrade task is completed. Expected Result is that Full re-index is triggered once after upgrade task",
"fixed_version":  "9.4.0, 9.3.2"
},


{
    "issue id": "JRASERVER-74304",
     "issue_description": "Index snapshot can miss up to 30s worth of indexing when periodic snapshot is used, or when snapshot is created after full background reindex.Index snapshot misses the most recently indexed issues.Expected Result is that the Index snapshot contains everything that has been indexed so far. ",
"fixed_version":  "9.4.1, 8.20.19"
},


{
    "issue id": "JRASERVER-74303",
     "issue_description": "Activity tabs are not initialised. It is necessary to reload the page to see activity tab. Expected Result is that Activity tab show load in first access on the Issue.",
"fixed_version":  "9.4.0"
},


{
    "issue id": "JRASERVER-74300",
     "issue_description": "Adding a comment from ‘All’ tab does not update the UI.The new comment does not appear in the activity tab content once posted.Expected Result is that the New comment should appear in the activity tab content once posted. ",
    "fixed_version":  "9.4.0"
},


{
    "issue id": "JRASERVER-74285",
     "issue_description": "While changing Issue Type Scheme for a Project 'Use a different scheme' screen is rendered incorrectly. User has both options: to choose an existing schema and to choose an existing project. Expected Result is that User has only an option to choose an existing scheme, as this option's radio button is default selected",
    "fixed_version":  "None"
},


{
    "issue id": "JRASERVER-73265",
     "issue_description": " Missing scrollbar in two dimensional filter. If the list is greater than the screen, there is no scrollbar.Expected Result is that If the list is greater than the screen, it should have a scrollbar.",
    "fixed_version":  "None"
},


{
    "issue id": "JRASERVER-73193",
     "issue_description": "Performance of Create Issue dialog creation degrades with high number of versions. The delay is not in generating the version list on the server, rather, the front-end creating the AUI dialog containing the versions. The screen turns dark grey with a loading spinner, and takes significantly slower compared to the lower version count test.Expected Result is that The dialog should open at the same speed, regardless of the version count",
    "fixed_version":  "9.2.0, 9.12.0, 9.4.11, 9.11.2"
},
{
    "issue id": "JRASERVER-72786",
     "issue_description": "Need to refresh the page when opening the linked issue. When an issue is linked to another issue (e.g. relates to) and you click on the linked issue you will be forwarded to the issue but the space and navigation bar does not change to the new project information.The linked issue page sidebar will display information from the previous issue.Expected Result is that After accessing the linked issue page, the sidebar information will be updated automatically.",
"fixed_version":  "None"
},


{
    "issue id": "JRASERVER-42310",
     "issue_description": "Superscript or subscript markup fails if not preceded by spaces. Expected result is that Correct markup with superscript (first case) and subscript (last case) is shown.",
"fixed_version":  "None"
},


{
    "issue id": "JRASERVER-41388",
     "issue_description": "WebHooks will not log any errors or throw an exception when there's a connection error. No exception is written to the logs or thrown.Expected Result is that The exception is written to the logs.",
"fixed_version":  "9.3.2, 9.4.1, 8.20.16"
},


{
    "issue id": "BAM-25781",
     "issue_description": "All releases of a deployment are loaded at once, causing slowness. Expected Result is that Performance-wise, it would be more interesting to load the data about only the most recent releases and retrieve the data about older releases only once the user chooses one of those to deploy. ",
"fixed_version":  " 10.0.0"
},


{
    "issue id": "BAM-25651",
     "issue_description": "Database version validation not working correctly allowing version rollbacks without rolling back the database.Expected Result is that Bamboo does not start as the database version is 90307 and reports an error about version mismatch.",
"fixed_version":  "9.4.3, 9.3.7, 9.2.11, 9.5.1, 9.6.0 "
},


{
    "issue id": "BAM-25637",
     "issue_description": "Please update Bamboo plugins Developer documentation. Contains outdated information.Expected Result is that Update the latest information for example supported JDK in use and Bamboo version, developer setup.",
"fixed_version":  "None"
},


{
    "issue id": "BAM-25608",
     "issue_description": "Compression of artifacts with special characters in the name fails. When generating an artifact that will be compressed (number of files exceeds Package threshold) bamboo will fail the compression and transfer of the artifact.Expected Result is that The artifact should be compressed and transferred to S3. ",
"fixed_version":  "9.5.0 "
},


{
    "issue id": "BAM-25566",
     "issue_description": "Deleted project can be accessed in Bamboo UI.The deleted project with marked_for_deletion is marked true in the Database, and can be accessed in Bamboo UI using the Project key.Expected Result is that The customer shouldn't be able to access the Project through Bamboo UI once project is deleted (marked_for_deletion is true in DB) ",
"fixed_version":  "9.4.2, 9.2.8, 9.3.6"
},


{
    "issue id": "BAM-25518",
     "issue_description": "Unable to post forms that exceed the 4096 bytes size limit in Bamboo.Expectation is that Saves the 8192-bit SSH key. ",
"fixed_version":  "9.4.2, 9.2.8, 9.3.6"
},


{
    "issue id": "BAM-25159",
"issue_description": "Cannot uninstall Bamboo on Windows via uninstall.exe. Bamboo uninstallation fails using uninstall.exe, throws error. Expected Result is that Bamboo uninstallation should finish successfully",
"fixed_version":  "9.4.0, 9.3.5"
},


{
    "issue id": "BAM-25145",
     "issue_description": "On Bamboo instances with large amount of Agents All Agents Updated Event may cause 720 seconds errors. Expected Result is that Queued objects should not get locked during Agent calculations. If something had already been dispatched, it should continue its flow and get picked up by an available Agent",
"fixed_version":  "9.4.0, 9.3.4"
},
{
    "issue id": "BAM-22608",
     "issue_description": "Queue section in Build Activity dashboard are shown as empty for non-system admin users, Queue is showing as empty and the illegal argument exception occurred in the atlassian-bamboo.logs.Expected Result is that It should show build which are queued under queue section of build activity dashboard. ",
"fixed_version":  " 9.4.0, 9.3.4"
},


{
    "issue id": "BAM-22607",
"issue_description": "Elastic instances are incorrectly marked as 'pending' after seamless restart of Bamboo server. Expected Result is that Elastic agents should not count as 'pending' once the agent reconnects",
"fixed_version":  " 9.3.4, 9.2.6"
},


{
    "issue id": "BAM-22476",
     "issue_description": "Change description under Linked repository for Bitbucket Cloud user and password. Right now we have the description for the password as 'The password required by the Bitbucket Cloud username'.If the password used is the username from Bitbucket Cloud, it won't work. It needs to be the app password due to Deprecating Atlassian account password for Git and Bitbucket API activity. Expected Result is that Under username change the description to use the Bitbucket Cloud username. Under password change the description to use App Password or Shared Credentials with the hyperlink on how to set up those options.",
"fixed_version":  "9.4.0, 9.2.5, 9.3.4 "
},


{
    "issue id": "BAM-22474",
     "issue_description": "robots.txt file not working in Bamboo after the upgrade. robots.txt file throws page not found error. robots.txt should be working and should be accessible. ",
"fixed_version":  " 9.4.0, 9.2.5, 9.3.4"
},




{
    "issue id": "BAM-22472",
     "issue_description": "Using a Tomcat Reload Stop or Undeploy Task on a build returns a NoClassDefFoundError. Tomcat task should complete successfully ",
"fixed_version":  "9.4.0, 9.3.4"
},


{
    "issue id": "BAM-22469",
"issue_description": "Executing multiple Docker tasks simultaneously on multiple remote agents on the same machine can cause incorrect credential usage. When running multiple Remote Agents on the same server using the same user, a race condition exists where multiple Docker Login tasks can overlap and the wrong credentials can be used. Expected Result is that TEST-A and TEST-B both use the appropriate credentials as defined in the web UI.",
"fixed_version":  "None"
},


{
    "issue id": "BAM-22463",
     "issue_description": "Branch Status auto refresh causes resource starvation when active on very busy Repositories. The number of DB connections increases and Overall Heap usage goes up and may generate slowness and crash in the application. Expected Result is that Queries should be optimised for large/busy/mono-repositories and  The page's auto-refresh feature should be controllable ",
"fixed_version":  "9.4.0, 9.3.3"
},



{
    "issue id": "BAM-22441",
     "issue_description": "'Enable repository caching on agents' in Linked repositories remains checked even if it is unchecked. New linked repository has 'Enable repository caching on agents' checked.Expected Result is that New linked repository has 'Enable repository caching on agents' unchecked. ",
"fixed_version":  " 9.3.4, 9.2.6"
},


{
    "issue id": "BAM-22440",
     "issue_description": "Bamboo cannot import encrypted strings via Exported zip. Export feature adds clear text password to the directories configuration on the zip file - Import fails with 'Can't decrypt data', a regression makes Bamboo fail to import an exported configuration due to unavailable cipher key pairs in the DB and filesystem.The import process should succeed.  ",
"fixed_version":  "9.4.0, 9.2.5, 9.3.3 "
},


{
    "issue id": "BAM-22417",
     "issue_description": "Pagination not working for Variables for deployment environments page for Bamboo 9.3. Expected Result is that description for the variables should be clear to read. ",
"fixed_version":  " "
},


{
    "issue id": "BAM-22415",
     "issue_description": "Application links with impersonation does not work properly. The same user base is not able to see the build via Jira issue development panel and release a new or existing build.Expected Results.The same user base should be able to see the build via Jira issue development panel and release a new or existing build. ",
"fixed_version":  "9.4.0, 9.2.4, 9.3.2 "
},
{
    "issue id": "BAM-22104",
     "issue_description": "Bamboo permissions are not getting assigned to usernames that contain uppercase letters via Specs. Bamboo permissions are not getting assigned to external users that contain uppercase letters in their usernames via Bamboo Specs. This only affects users coming from an external user directory (e.g. Crowd, Microsoft Active Directory, and etc). This problem does not affect Bamboo internal users.This issue is also applicable to Deployment project permissions and environment permissions as well. Expected Result is that Navigate to the plan's permissions page from the UI using an account with access to the plan you're making changes. And Both users will show up in the page with all the permission boxes checked.",
"fixed_version":  "9.4.0, 9.3.2, 9.2.5 "
},


{
    "issue id": "BAM-20606",
     "issue_description": "Job with dependent artifact can hang during branch creation if triggered before artifact exists.Expected Result ia that Consumer plan job that downloads the artifact fails as dependent artifact is not found.",
"fixed_version":  "9.3.4, 9.2.6"
}



     ]
 },


 {
    "version": "9.4.x",
    "date_of_release": "5 December 2015",
    "issue":[
        {
            "issue id": "JSWSERVER-25774",
             "issue_description": "Cursor focus not changing in Sprints when right-clicking on Issues. This is observed with Jira version 9.4.9. No functional impact observed as clicking on the menu item performs the action. Seems like a cosmetic issue atm. Expected Result is that The cursor focus should go to the menu items once it is on them.",
      "fixed_version":  "9.13.2, 9.14.1, 9.12.5, 9.15.2"
      },
  
  
  {
            "issue id": "JSWSERVER-25773",
             "issue_description": "The highlighting of the Sprint options is not following the cursor and gets stuck.The highlighting of the options in the Sprint '3 dots' menu is not following the cursor and gets stuck when hovering (mouse overing) up and down each option. Expected behavior is that The highlighting should follow the cursor if the cursor is on 'Edit Sprint', then the highlighting should on 'Edit Sprint'. if the cursor is on 'Move Sprint down', then the highlighting should on 'Move Sprint down'.",
             "fixed_version":  "9.13.2, 9.14.1, 9.12.5, 9.15.2 "
      },
  
  
  {
            "issue id": "JSWSERVER-25517",
             "issue_description": "Retrieving the value of Advanced Roadmap's Team custom field executes multiple slow SQL queries. When the Team custom field value is fetched, it can result in up to 4 database queries being executed. This can be especially problematic in situations that retrieve the value for many issues, like exporting or viewing Agile boards with the Team field displayed on cards.Expected Result is that Fetching the value of the Team custom field has an acceptable performance",
      "fixed_version":  "10.0.0, 9.15.2"
      },
  
  
  {
            "issue id": "JSWSERVER-25517",
             "issue_description": "Retrieving the value of Advanced Roadmap's Team custom field executes multiple slow SQL queries. The slowest query is used to check in which plan the team is being used. It often involves a full table scan and includes a JOIN.Expected Result is that Fetching the value of the Team custom field has an acceptable performance",
      "fixed_version":  "10.0.0, 9.15.2 "
      },
  
  
  {
            "issue id": "JSWSERVER-25498",
             "issue_description": "Jira is displaying incorrect OS info. Windows Server 2019 10.0 is displayed under Operating System.  Windows Server 2022 10.0 should be displayed under Operating System. ",
      "fixed_version":  "9.12.0"
      },
  
  
  {
            "issue id": "JSWSERVER-25445",
             "issue_description": "Adding custom fields with many select options to Advanced Roadmaps plan makes the whole UI sluggish.Expected Results UI performance is not degraded, or at worst is only degraded in parts that directly interact with custom fields with thousands of select options (e.g. rendering a filter dropdown). ",
      "fixed_version":  "9.13.0 "
      },
  
  
  {
            "issue id": "JSWSERVER-24898",
             "issue_description": "Issues in projects with hidden fix version field are not imported into Portfolio plans.When setting up an issue source that contains projects with hidden Fix Version/s field, no issues are shown in the Scope view.Issues are not displayed in the Scope view of the Plan. Issues should be displayed in the Scope view of the Plan. ",
      "fixed_version":  "9.13.0"
      },
  
  
  {
            "issue id": "JSWSERVER-21915",
             "issue_description": "Smart commits are processed in Jira for repositories without smart commits when synced via git webhooks.This bug shows up only for integration using webhooks. Smar commits works correctly when data is being synced during hourly polling job.Expected Result is that Only development panel data is updated.No comment added to the issue, because we have turned off smart commits for this repository.",
      "fixed_version":  " 9.12.0, 9.13.0"
      },
  
  
  {
            "issue id": "JSWSERVER-21764",
             "issue_description": "New Comments do not automatically appear without refreshing when comments are sorted Oldest First. Your comment will not automatically appear after being posted. It is necessary to refresh the page to see it appear. Expected result is that Comments should appear automatically once they are posted. ",
      "fixed_version":  "9.4.9, 9.10.1"
      },
  
  
  {
            "issue id": "JSWSERVER-21724",
             "issue_description": "When I clicked the down arrow to expand the epic, it quickly expands, then collapses.When we clicked the down arrow to expand the epic, it quickly expands, then collapses. Expected Result is that After expanding it should not collapse which will impact having a view of a bunch of info in that function. ",
      "fixed_version":  "9.4.5 "
      },
  
  
  {
            "issue id": "JSWSERVER-21667",
             "issue_description": "When creating issues from Bitbucket Server side, the Create Issue screen show fields in incorrect order.Expected Result is that The Create Issue modal window in Bitbucket should show the fields in the same order ",
      "fixed_version":  " 9.9.0, 9.4.7"
      },
  
  
  {
            "issue id": "JSWSERVER-21621",
             "issue_description": "Jira Calendar Dashboard Gadget isn't respecting selected value. We see that the value selected for Date to Display always set as Created. Expected Result is that We expect that the Date to Display set value should be the result returned. ",
            "fixed_version":  "10.0.2 "
      },
  
  
  {
            "issue id": "SWSERVER-21543",
             "issue_description": "Epic Panel does not expands in backlog view if a search is performed.When viewing a board's backlog, the epic panel is not expanded and no epic details are shown, if the Epic is listed based on search.Epic data cannot be seen, and the information hides shortly. Expect to see Epic information in Epic panel after clicking expand ",
      "fixed_version":  "9.4.1"
      },
  
  
  {
            "issue id": "JSWSERVER-21417",
             "issue_description": "Jira access token getting expired after 2 hours while connecting to Gitlab. The token expires and cannot be refreshed. Looks to be issue with threads in order to overwrite the new token.The token refresh should take place in the background and sync should work. ",
      "fixed_version":  "8.20.13, 9.3.0"
      },
  
  
  {
            "issue id": "JSWSERVER-13098",
             "issue_description": "JIRA Agile doesn't delete rank from table when the Custom Field was deleted.The board disappears from the Agile Menu and Manage Boards page.Expected Result is that The board should be still be present in Manage boards and when GH detects that it is not having the associated filter, it should request the owner of the board to re-associate it with a filter or with project",
      "fixed_version":  "9.11.0 "
      },
  
  
  {
            "issue id": "JRASERVER-77566",
             "issue_description": "Label suggestions with empty input are too slow on systems with many labels.The thread becomes long running on the server and is usually not even useful to the end-users, as they may start typing labels to narrow the search, but the original request is still running.Expected Result is that The autocomplete would not take so long to run everytime.",
      "fixed_version":  "9.12.6, 9.14.2, 9.15.2 "
      },
  
  
  {
            "issue id": "JRASERVER-76729",
             "issue_description": "Jira doesn't check if the user has admin permission before sending healthcheck email notifications. If a user once subscribed to the healthcheck notifications in Jira, but later loses admin access (becomes normal user or gets deactivated), he will continue to receive those emails.Expected Result is that The user will not get the health check notifications anymore.",
      "fixed_version":  "9.15.2 "
      },
  {
            "issue id": "JRASERVER-76558",
             "issue_description": "Clicking Edit or Save after edit on top-left gadget in a Dashboard does not update placement of other gadgets and may lead to overlap.Expected Result is that The gadget will expand to show the configuration settings and the gadget below will be relocated to be properly spaced below it.",
  "fixed_version":  "9.15.2 "
      },
  
  
  {
            "issue id": "JRASERVER-76551",
             "issue_description": "The default security level is not respected on the quick create issue screen.The Security Level should be set to the default level configured in the scheme. ",
      "fixed_version":  "9.14.0"
      },
  {
            "issue id": "JRASERVER-76355",
             "issue_description": "Add a comment  Focus is not set onto the newly added content when the page is updated. Make sure that the focus is managed appropriately when the page is updated. Make sure that when the user activates the link that says This comment will be viewable by all users. , the focus goes onto the newly added listbox. ",
      "fixed_version":  "9.14.0"
      },
  {
            "issue id": "JRASERVER-76354",
             "issue_description": "Add a comment  Expandable link has inappropriate reading order. When the 'This comment will be viewable by all users' link is expanded, the expanded listbox associated with this link is available at the end of the page for screen reader users. This is because this content is not coded directly after the link in the DOM. Expected Result is that Content must have an appropriate reading order. Assistive technologies navigate content using the order in which elements appear in the DOM. ",
      "fixed_version":  "9.14.0"
      },
  {
            "issue id": "JRASERVER-76344",
             "issue_description": "Issue Type Changing when Moving Issues. Issue Type changes while moving the issue. Expected Result is that Issue Type should be retained while moving the issue.",
      "fixed_version":  "9.13.0"
      },
  {
            "issue id": "JRASERVER-76240",
             "issue_description": "Applying a Jira product license might break the whole instance with duplicate license keys in the database. The product license key is stored in the productlicense database table and there must be only one key for each licensed product.Expected Result is that Jira continues to handle well the operations that are applying the license keys.  Automation for Jira is also properly disabled/enabled.",
      "fixed_version":  "9.12.0,, 9.4.12 "
      },
  {
            "issue id": "JRASERVER-76132",
             "issue_description": "In Header Sign-up popup not keyboard accessible. The Sign-up popup is not keyboard accessible, users can not reach the UI elements in the popup. The focus is set to the next interactive element behind the popup.The popup is receiving keyboard focus at the end of the page.Expected Result is that The popup is to be adjusted in such a way that keyboard users can reach the content of the popup with the keyboard.",
      "fixed_version":  " 9.13.0"
      },
  {
            "issue id": "JRASERVER-76122",
             "issue_description": "Backlog error popup close button cannot be perceived by screenreader users. Error message close button has no unique accessible name, which is why it cannot be perceived by screen reader users.The button should be perceptible to screen reader users via an accessible name.",
      "fixed_version":  "9.13.0 "
      },
  {
            "issue id": "JRASERVER-76121",
             "issue_description": "Backlog error details link is not accessible with the keyboard. Error message details button is not accessible by keyboard, which is why it cannot be perceived by screen reader users.The button should be accessible by keyboard.",
      "fixed_version":  "9.13.0 "
      },
  {
            "issue id": "JRASERVER-76099",
             "issue_description": "Jira 9.4.8 Upgrade Task to Update Archived Issues Fails with More than 2100 Projects in MS SQL. Upgrade should  complete normally",
      "fixed_version":  "9.6.0, 9.4.11 "
      },
  {
            "issue id": "JRASERVER-75886",
             "issue_description": "'Excluded events' option is missing from the audit log page in Jira.You are able to see the 'Excluded events' section . ",
      "fixed_version":  "9.4.8"
      },
  {
            "issue id": "JRASERVER-75836",
             "issue_description": "Update Documentation on Anonymizing users. Documentation of Anonymizing users needs to be updated with the current behaviour of Jira where even for the new user this dropdown appears and looks to be a mandatory field in order to anonymize the user.",
      "fixed_version":  "None "
      },
  {
            "issue id": "JRASERVER-75773",
             "issue_description": "The Current User Sessions admin page displays time in 12h clock without AM/PM. The time stamps on the Current User Sessions admin page shows the times in a 12h clock format without AM/PM indicators, making it impossible to distinguish between 5 in the morning and 5 in the afternoon.",
      "fixed_version":  "9.9.0,9.4.7 "
      },
      {
        "issue id": "JRASERVER-75745",
         "issue_description": "Kanban board: When user clicks clear all filter link focus is set to top of page.When user activates  the clear all filters  link the focus should be set to Quick filter section.",
  "fixed_version":  " 9.10.0, 9.4.9"
  },
{
        "issue id": "JRASERVER-75578",
         "issue_description": "Mentions and creating comment sometimes not working on standalone issue view pages. On browsers where cache is disabled, users can encounter inoperative mentions and comment creation. Expected Result is that The rich text editor loads with the existing content and is editable.",
  "fixed_version":  "9.9.0, 9.4.6 "
  },
{
        "issue id": "JRASERVER-75527",
         "issue_description": "Unable to change outgoing mail server from Oauth to Basic Auth.When you try to modify the outgoing mail server going from Oauth authentication to basic authentication, it does not save the configuration.Upon modifying the configuration, Jira should save and work. ",
  "fixed_version":  "9.11.0 "
  },
{
        "issue id": "RASERVER-75342",
         "issue_description": "Concurrent modification of single issue might result with stale values of its fields in index. It is expected that JQL searches by value set to cf1 in issue1 in pt 2.2.1 should return issue1",
  "fixed_version":  " 9.14.1, 9.4.22, 9.12.9"
  },
{
        "issue id": "JRASERVER-74939",
         "issue_description": "Session invalidation should be propagated to other nodes in the cluster.In Jira there are some events (like password change, user delete) which invalidates user sessions. Currently those events only invalidate sessions on the node where the event was triggered. ",
  "fixed_version":  "9.11.0"
  },
{
        "issue id": "JRASERVER-74877",
         "issue_description": " Transition popup screen is not showing up correctly in Jira 9.4.x. The pop up workflow issue screen should be the same in Jira 8.x:. But The pop up workflow issue screen should be the same in Jira 8.x:",
  "fixed_version":  "9.12.0 "
  },
{
        "issue id": "JRASERVER-74869",
         "issue_description": "Searching assignable users in assignee field retrieves multiple results when user being searched is registered in multiple directories.Expected Result is that A single result should appear when searching for the user to be selected as the assignee on the issue. ",
  "fixed_version":  "9.9.0, 9.4.11 "
  },
{
        "issue id": "JRASERVER-74815",
         "issue_description": "TLS option in the outgoing mail server page is automatically unticked after the authorization process is complete.After the Authorization is completed, the TLS option should still be ticked.After the Authorization is completed, the TLS option is automatically un-ticked",
  "fixed_version":  "9.11.0 "
  },
{
        "issue id": "JRASERVER-74791",
         "issue_description": "When a Custom Field rendering fails, Jira's error message is not correct xml.When a Custom Field rendering fails during the XML export, Jira's error message is not correct in the XML format. This occurs with one of the third-party plugins, but, the rendering is done by the Jira application.",
  "fixed_version":  "9.9.0"
  },
{
        "issue id": "JRASERVER-74787",
         "issue_description": "Full reindex operation slow down in Jira 9.0.0 caused by fetching issue versions from database in a single thread.The full reindex process has slowed down significantly for some customers. This is due to extra operations performed during reindexing that improve index correctness.There is no significant time degradation comparing to 8.20.x. ",
  "fixed_version":  "9.7.0, 9.4.6 "
  },
{
        "issue id": "JRASERVER-74669",
         "issue_description": "Jira custom field optimizer fails on fields used on issues of archived projects.UI error, field remains with global context. The below exception is thrown in the atlassian-jira.log file. Expected Result is that Custom Field global context is removed, set to specific project.",
  "fixed_version":  "9.6.0, 9.4.6"
  },
{
        "issue id": "JRASERVER-74597",
         "issue_description": "Analytics state (enabled/disabled) cannot be changed.Analytics go back to enabled. Expected Result is that Analytics keep being disabled.",
  "fixed_version":  "9.8.0"
  },
{
"issue id": "JRASERVER-74589",
"issue_description": "Dragging and dropping files on transition screen results in duplicate attachments. Two copies of the file are attached. The following REST endpoint is being called twice. Expected Result is that One copy of the file is attached.",
  "fixed_version":  "9.4.3, 9.7.0 "
  },
{
        "issue id": "JRASERVER-74585",
         "issue_description": "Linking issues with remote link creates duplicate history entries. A new entry with original and new values set to the same issue link is added to the issue history.this entry is added every time the remote issue is transitioned to a new state or a new user tries to make the new remote link.  this behaviour is causing flooding of the issue history. and in turn causing inconvenience for customers to identify real change. Expected Result is that Only one entry in the history tab to be seen with the remote link",
  "fixed_version":  " 9.9.0, 9.4.6"
  },
{
        "issue id": "RASERVER-74576",
         "issue_description": "Browse projects page performance regression. Our performance tests detected ~10% regression on the Browse projects action. ",
  "fixed_version":  "9.4.1"
  },
{
        "issue id": "JRASERVER-74567",
         "issue_description": "Project Automation: Roles and labels not provided for combobox element.The combobox element has missing roles and labels to select the type of Project for automation.Expected Result is that Try to implement the following component into an <select> element as the structure and functionality match it.",
  "fixed_version":  "9.12.0"
   }

  
    ]
},

    {
        "version": "9.5.x",
        "date_of_release": "5 December 2015",
        "issue":[
            {
                "issue id": "JSWSERVER-25888",
                 "issue_description": "Wrong link under board config for Simplified Workflow.For board config under the column section the link to 'Contact an Administrator' takes to HTTP 405 Method Not allowed.",
          "fixed_version":  "None"
          },
      
      
      {
                "issue id": "JSWSERVER-25821",
                 "issue_description": "Tool tip on Agile Board Card does not work. On hovering over assignee, tool tip does not work and does not show assignee details or other details Expected Result is that On hovering over the assignee and other icons tool-tip should work fine",
          "fixed_version":  "None"
          },
      
      
      {
                "issue id": "JSWSERVER-25034",
                 "issue_description": "Create issue with field required does not save the changes. Creating an issue from the plan view does not save the changes on other required fields such as summary and epic name.Issue summary and epic name value remain the same even though Jira allow users to change the value in the pop-up box.Expected Result is that Users should allow changing the issue summary and epic name when they modify the value in the pop-up box.",
          "fixed_version":  "None"
          },
      
      
      {
                "issue id": "JSWSERVER-24972",
                 "issue_description": "Circular reference using issuesInPlan causes StackOverflowError. issuesInPlan JQL function can cause StackOverflow if this is a circular reference.exception is thrown in the xxxxxxx.log file. Expected Result is that i should Gracefully fail",
          "fixed_version":  "None"
          },
      
      
      {
                "issue id": "JSWSERVER-24745",
                 "issue_description": "The jql query order by Epic Link fails on large results. When the JQL search order by 'Epic Link' is executed in an environment containing a large number of issues example 2 000 000 issues , Jira does not return a result and the search fails",
          "fixed_version":  "None "
          },
      
      
      {
                "issue id": "JSWSERVER-21936",
                 "issue_description": "Clicking confirm in Board configuration in new Date picker will not add highlighted date to configuration. Highlighted date is not added without a manual click. Expected Result is that After confirmation, the date should be added. Only after clicking highlighted date once again, the date is added.",
          "fixed_version":  "9.12.0, 9.11.1"
          },
      {
                "issue id": "JSWSERVER-21930",
                 "issue_description": "After clicking prev/next month icon in Date picker - the light blue border stays behind in old previous value. The position of the light blue border is not correct after moving date picker to a next month.Expected Result is that The light blue border and blue headlight should have the same position after clicking next month button.",
          "fixed_version":  "None"
          },
      {
                "issue id": "JSWSERVER-21685",
                 "issue_description": "Tooltip that displays the number of days in column under the Board active sprint is no longer working. Tooltip does not display the number of days in column.Expected Result is that Tooltip should display the number of days in column.",
          "fixed_version":  "9.9.0"
          },
      
      
      {
                "issue id": "JSWSERVER-21615",
                 "issue_description": "Hover functionality to move up not working for Export and Tools menu. When trying to hover over the Export or tools menu in Issue search, The hover functionality is not working after scrolling down the menu. It remains static and hovering up the menu is not working. Scrolling up the Menu using the hover functionality is not working.Expected Result is that We should be able to hover up and down the tools and Export options.",
          "fixed_version":  "None"
          },
      
      
      {
                "issue id": "JSWSERVER-21516",
                 "issue_description": " 'Order by Epic Link' has performance limitations. The result should be retrieved fast. There's slowness in retrieving the result. Once 'Order by Epic Link ASC' is removed, it retrieves the results faster",
          "fixed_version":  "None"
          },
      
      
      {
                "issue id": "JSWSERVER-20283",
                 "issue_description": "Having more than 65,000 closed sprints breaks the JQL function closedSprints(). JQL fails with error. Expected Results is that issues are listed without errors",
          "fixed_version":  "None"
          },
      
      
      {
                "issue id": "JSWSERVER-19970",
                 "issue_description": "Board Administrators cannot switch to a Simplified Workflow. despite having met the requirements for the workflow. The ‘Simplified Workflow’ button is disabled.Granting the user administrative rights and refreshing the Column Management screen causes the ‘Simplify Workflow’ button to be enabled.",
          "fixed_version":  "None "
          },
      
      
      {
                "issue id": "JSWSERVER-15915",
                 "issue_description": "Search for a page is not working from Scrum/Kanban Board. When we tried to link a Confluence page from a Board issue detail view, searching for a page is not possible. Expected Result is that The pop-up will refresh and it will show the search function.",
          "fixed_version":  "None"
          },
      
      
      {
                "issue id": "JRASERVER-77639",
                 "issue_description": "Issuetype text popup not appearing when hovering over issue-type icon on software active sprint board. Expected Results is that A popup should appear indicating the issue-type name as shown",
          "fixed_version":  " None "
          },
      {
                "issue id": "JRASERVER-77548",
                 "issue_description": "Performance regression on full reindex for Jira 9.5 onwards.It takes roughly double the time comparing to 9.4.Expected Result is that It should take about the same time as it used to on Jira 9.4.",
          "fixed_version":  "9.12.6, 9.15.2"
          },
        {
                "issue id": "JRASERVER-77487",
                 "issue_description": "Application navigator may leave spurious entries on the database related to removed application links. Throughout the lifecycle of a Jira instance, administrators may add/remove entries for/from Application Navigator, which is reflected on the database. Sometimes there may be spurious entries related to old application links that will still be on the database, but won't make any effect on the UI.Expected Result is that Confluence doesn't appear as an option on the Application Navigator.Checking from the database, there won't be an entry related to Confluence. ",
                 "fixed_version":  "None"
          },
      
      
      {
                "issue id": "JRASERVER-76452",
                 "issue_description": "Style issues with fields. The edits on the fields like label, version, etc have issues retaining the colour as defined under the Look and Feel option.Also, the edit icon (pencil icon) stays there until a click action is done.Expected Results is that Colouring should only change when the mouse hover is done.The pencil icon should be hidden when the edit is done.",
          "fixed_version":  "None"
          },
      
      
      {
                "issue id": "JRASERVER-76426",
                 "issue_description": "Status dropdown malfunctions when there are more than 100 statuses.",
          "fixed_version":  "None"
          },
      
      
      {
                "issue id": "JRASERVER-76231",
                 "issue_description": "Product document to run Jira as a service on Windows wasn't updated for Tomcat 9.The Running Jira applications as a Windows service details the steps to configure a Windows service to run Jira. ",
          "fixed_version":  "None"
          },
      
      
      {
                "issue id": "JRASERVER-76224",
                 "issue_description": "Jira does not work when switching to Java 17 in a supported release. Jira main page is blank, errors are seen in the logs . Expected Result is that Jira to work correctly since it is in the supported platforms list",
          "fixed_version":  "9.11.0 "
          },
      
      
      {
                "issue id": "JRASERVER-76209",
                 "issue_description": "Date headers after the first one in the Activity tab and Activity steam gadgets are displayed at the bottom, not above the relevant activity items. Date headers after the first are displayed together at the bottom, underneath all the activity items. Expected Result is that Date headers after the first should be displayed above the activity items they're associated with.",
          "fixed_version":  "None"
          },
      
      
      {
                "issue id": "JRASERVER-76190",
                 "issue_description": "Date Time Picker not working when Jira is using Korean, Japanese, Chinese",
          "fixed_version":  "None "
          },
      
      {
                "issue id": "JRASERVER-75946",
       "issue_description": "Transition screen removed when project admin edits a transition. Expected Result is that Changes are saved and the transition still has a screen configured",
          "fixed_version":  " None"
          },
      
      
      {
                "issue id": "JRASERVER-75862",
                 "issue_description": "Loading all history entries is very slow on issues with many of them. The content needs a lot of time to load. Most of this time is waiting for the response from the server.Expected Result is that The content of the tab loads in less than 10 seconds.",
          "fixed_version":  "None"
          },
      
      
      {
                "issue id": "JRASERVER-75847",
                 "issue_description": "Jira multi-user picker does not seem to recognize comma as a delimiter. Ticket failed to get created with error as could not find username. User name should accepted and ticket should get created successfully. ",
          "fixed_version":  "None"
          },
      
      
      {
                "issue id": "JRASERVER-75762",
                 "issue_description": "Editing a existing comment to add another attachment would not add the attachment in the comment.The attachment link is not added in the comment. It is expected that The attachment link for the second attachment should also be added in the comment..  ",
          "fixed_version":  "None "
          },
      
      
      {
                "issue id": "JRASERVER-77474",
                 "issue_description": "Activity Stream is blank for users not authenticated in the external application when using application links configured as Local authentication.This would be an issue if the users don't have access permission to all the application links configured.It is expected that Both the Activity Stream dashboard and the User profile gadgets should display data even without the authentication with the external application",
          "fixed_version":  "9.16.0, 9.12.8, 9.15.2"
          },
      
      
      {
                "issue id": "JRASERVER-76224",
                 "issue_description": "Jira does not work when switching to Java 17 in a supported release. Expected Result is that Jira to work correctly since it is in the supported platforms list",
          "fixed_version":  "9.11.0 "
          },
      
      
      {
                "issue id": "JRASERVER-75166",
                 "issue_description": "WARNINGS in JSM log - ISSUE with id=xxxxxx should have a version by now although all issues have versions.No WARN messages for the index operation happens if issue has a version. ",
          "fixed_version":  "9.9.0, 9.4.11 "
          },
      
      
      {
                "issue id": "JRASERVER-74939",
                 "issue_description": "Session invalidation should be propagated to other nodes in the cluster. ",
          "fixed_version":  " "
          },
          {
            "issue id": "JRASERVER-74818",
             "issue_description": "The 'Connection Test' fails on the Outgoing Mail server when the option 'Change password' is not ticked. Expected behaviour is The connection test should be successful as it was earlier, since nothing was changed in the outgoing mail configuration",
      "fixed_version":  "9.11.0 "
      },
  
  
  {
            "issue id": "JRASERVER-74787",
             "issue_description": "The full reindex process has slowed down significantly for some customers. This is due to extra operations performed during reindexing that improve index correctness.There should be no significant time degradation compared to 8.20.x. ",
      "fixed_version":  "9.7.0, 9.4.6"
      },
  
  
  {
            "issue id": "JRASERVER-74786",
             "issue_description": "Dates in the Activity tab are shown in the wrong timezone. ",
      "fixed_version":  "9.9.0 "
      },
  
  
  {
            "issue id": "JRASERVER-74762",
             "issue_description": "The page links don't work in the User Picker and Group Picker popup. The results from the 2nd page should be displayed.",
      "fixed_version":  "9.13.0, 9.4.21, 9.12.8 "
      },
  
  
  
  
  
  
  {
            "issue id": "JRASERVER-74705",
             "issue_description": "Getting an error when trying to save an Outgoing Mail configuration in Jira using the JNDI Location setting.hen clicking on the Save button after testing the connection, the user is redirected to the Oops error page, with the error Sorry, we had some technical problems during your last operation. The saving of the configuration should be successful, and the mail server should be showing in the Outgoing Mail Server",
      "fixed_version":  "9.9.0, 9.4.7 "
      },
  
  
  {
            "issue id": "JRASERVER-74669",
             "issue_description": "Jira custom field optimizer fails on fields used on issues of archived projects.UI error, field remains with global context. Expected Result is that Custom Field global context is removed, set to specific project ",
      "fixed_version":  "9.6.0, 9.4.6"
      },
  
  
  {
            "issue id": "JRASERVER-74589",
             "issue_description": "Dragging and dropping files on transition screen results in duplicate attachments. One copy of the file should be attached.",
      "fixed_version":  " 9.4.3, 9.7.0"
      },
  
  
  {
            "issue id": "JRASERVER-74585",
             "issue_description": "Linking issues with remote link creates duplicate history entries.A new entry with original and new values set to the same issue link is added to the issue history.this entry is added every time the remote issue is transitioned to a new state or a new user tries to make the new remote link.  ",
      "fixed_version":  "9.9.0, 9.4.6 "
      },
  
  
  {
            "issue id": "JRASERVER-73338",
             "issue_description": "When clicking the attachment button in the description field it disappears while creating Issues from Dashboard and from Project too.The Browse doesn't show and the attachment button disappears. Expected Result is that It should display a dropdown as Browse",
      "fixed_version":  "9.16.0, 9.4.21, 9.12.9 "
      },
  
  
  {
            "issue id": "JRASERVER-39809",
             "issue_description": "workflow transition's name truncated when exist more than 25 characters. Currently when you create a workflow transition whereby the name contains more than 25 characters the wording will be truncated even though there is still ample white spaces left.",
      "fixed_version":  "9.6.0, 9.5.1, 9.4.2 "
      },
  
  
  {
            "issue id": "JRASERVER-37267",
             "issue_description": "duplicate issues created when clicking on create button multiple times. Multiple duplicate issues created with the same Summary field being created.Expected results is that It is possible to create one issue only.",
      "fixed_version":  "9.12.0, 9.4.12, 9.11.3 "
      },
  
  
  {
            "issue id": "BAM-25765",
             "issue_description": "Bamboo stages cannot be deleted with an internal server error. Stage should be deleted successfully",
      "fixed_version":  "9.5.4, 9.6.2"
      },
  
  
  
  
  
  
  {
            "issue id": "BAM-25753",
             "issue_description": "Bamboo Label variable values are not resolved when a regex is used.Build summary labels were unresolved. Expected Result is that Label variable values were replaced correctly",
      "fixed_version":  "10.0.0, 9.5.4, 9.6.2, 9.2.14 "
      },
  
  
  {
            "issue id": "BAM-25739",
             "issue_description": "Bitbucket Cloud integration REST endpoint ignores security settings for anonymous users.Expected Result is that the Http response 401 should be returned as admin doesn't allow anonymous user to trigger change detection or specs scanning",
      "fixed_version":  "9.6.1, 9.5.3 "
      },
  
  
  {
            "issue id": "BAM-25700",
             "issue_description": "Unable to send Bamboo Build status/state to GITHUB.Expected Result is that The build status , target url , description and context arer passed to GITHUB for the commit ID. ",
      "fixed_version":  "9.6.0, 9.5.2, 9.2.12, 9.4.4"
      },
  
  
  {
            "issue id": "BAM-25674",
             "issue_description": " Cloning a Bamboo Instance document still references old directory structure. The correct path should be shown for versions 8+.",
      "fixed_version":  "None "
      },
  
  
  {
            "issue id": "BAM-25665",
             "issue_description": " Usernames containing '@' symbol on Bamboo 9.5 user's avatars keeps loading forever. The user's avatar keeps spinning.You should be able to save successfully. ",
      "fixed_version":  "9.5.1 "
      }
        
      

        ]
    },

{
    "version":"9.6.x",
    "date_of_release":"5 December 2015",
    "issue":[
        {
            "issue id": "JSWSERVER-25434",
             "issue_description": "Adding a multiple-choice custom field to a Program, will make it inaccessible",
      "fixed_version":  " 9.13.0"
      },
      {
        "issue id": "JSWSERVER-25340",
         "issue_description": " Sprint cache invalidation may block other regular operations leading to performance degradation of the Jira Software Data Center instance",
        "fixed_version":  "9.14.0"
     },
     {
        "issue id": "JSWSERVER-21753",
         "issue_description": " when you create a new project from the 'Software' section the next step will lack workflow images and icons of some issues. Expected Results :  Workflow and icon images should be shown at the appropriate steps of the wizard",
        "fixed_version":  " 9.14.0"
     },
     {
        "issue id": "JRASERVER-76224",
         "issue_description": "Jira does not work when switching to Java 17 in a supported release ",
        "fixed_version":  "9.11.0"
     },
     {
        "issue id": "JRASERVER-74964",
         "issue_description": "Search for issue:The button is included in the heading mark up inappropriately. Additionally, an inappropriate label is provided for the button. ",
        "fixed_version":  " 9.13.0"
     }
    ]
},

 {
        "version": "10.0.x",
        "date_of_release": "5 December 2015",
        "issue":[
            {
                
             "issue id": "JRASERVER-76481",
            "issue_description": "Redirect from searchrequest.html page to login screen.We would like to open an improvement request to allow the searchrequest.html page to be redirected to the login page if the user is not logged on. This desired behavior is similar to the issue view page, since it automatically redirects you to the login screen if you're unauthenticated. Currently anyone can access this URL even if they are not logged in, this is a security thread, please look into this and make it more secure.",
              "fixed_version":  "None "
             },
          
          
          {
              "issue id": "JRASERVER-77501",
            "issue_description": "Registering a Jira Gadget on Confluence results in error.When registering a Jira gadget on Confluence error like 'Data with key 'com.atlassian.plugins.atlassian-plugins-webresource-plugin:context-path.context-path' has already been claimed' is displayed.",
              "fixed_version":  "None "
              },
          {
          "issue id": "JSDSERVER-12037",
               "issue_description": "When trying to edit an object attribute value of type Object that has a large number of references, the Edit window overlaps the 'Update' button..",
          "fixed_version":  "None "
          },
          
          
          {
          "issue id": "JSDSERVER-10994",
               "issue_description": "Object page UI issue, when editing an object with an object reference dropdown.When editing an object in the Object Page, opening a Referenced Attribute dropdown will open the dropdown, overlapping the screen behind it.",
          "fixed_version":  "10.0.7"
          }
          
        ]
    },



    {
        "version": "10.75.x",
        "date_of_release": "5 December 2015",
        "issue":[
            {
                "issue id": "JSWSERVER-25888",
                 "issue_description": "Wrong link under board config for Simplified Workflow.For board config under the column section the link to 'Contact an Administrator' takes to HTTP 405 Method Not allowed.",
          "fixed_version":  "None"
          }
        ]
    },

    {
        "version":"10.78.x",
        "date_of_release":"5 December 2015",
        "issue":[
            {
                "issue id": "JIRAALIGN-2794",
              "issue_description": "Unable to filter Teams by status (active: yes/no). Expected Results: Active should be available on the grid filter and columns shown modal no matter the context menu selections.",
           "fixed_version":  "10.107.4 "
           },
           {
            "issue id": "JIRAALIGN-2257",
            "issue_description": "Details Panels Settings page is missing Jira Project field for Defect work item type",
            "fixed_version":  "None "
            },
            {
                "issue id": "JIRAALIGN-2148",
                "issue_description": "Permission error when accessing Stories By State.",
                "fixed_version":  "10.84"
            },
            {
                "issue id": "JIRAALIGN-2145",
                "issue_description": "Unable to launch Google page from a Check List Item",
                "fixed_version":  "10.101.0"
            },
            {
                "issue id": "JIRAALIGN-2126",
                "issue_description": "Program Tracking report only shows the items with the program set as the 'Primary Program.' The items that show the program as an 'Additional Program' will not show up in the Program Tracking report.",
                "fixed_version":  "10.88"
            },

            {
                "issue id": "JIRAALIGN-2108",
                "issue_description": "In the Work Tree Strategy View, when attempting to expand the capability to view the Features underneath, the Expansion appears to be stuck and the user is unable to see the list of child Features underneath.",
                "fixed_version":  "10.97.0"
            },
            {
                "issue id": "JIRAALIGN-2107",
                "issue_description": "No notification email is sent if a Team is assigned to a Story work item",
                "fixed_version":  "10.105.0"
            },
            {
                "issue id": "JIRAALIGN-2101",
                "issue_description": "When clicking on the ID of a kanban board to open its details window, the slide-window content never loads and internal server error is logged.",
                "fixed_version":  "10.82"
            },

            {
                "issue id": "JIRAALIGN-2046",
                "issue_description": "We are seeing performance issues when users open external entities on the dependency view. We are encountering the following error: HTTP error: status code 404",
                "fixed_version":  "10.81"
            },
            {
                "issue id": "JIRAALIGN-2035",
                "issue_description": "Expanding Features in Work Tree page throws HTTP 500 error",
                "fixed_version":  "10.81"
            }
        ]
    },
        {
            "version":"10.95.x",
            "date_of_release":"Sept 16 , 2016",
            "issue":[
                {
                    "issue id": "JIRAALIGN-3618",
                    "issue_description": "In the Roadmaps page, when team is selected at Tier1 config bar, its corresponding features are hidden and the user is unable to expand its parent epic Conversely,",
                    "fixed_version":  "10.111.0 "
                },
                {
                    "issue id": "JIRAALIGN-3364",
                    "issue_description": "Program Increment Progress Report: Team Burndown chart it is showing an inconsistent number of remaining story points for a team. The points remaining cant be located under any related story assigned to the team.",
                    "fixed_version":  "10.104.2"
                },
                {
                    "issue id": "JIRAALIGN-3342",
                    "issue_description": "Program Increment Progress Report: Team Burndown chart it is showing an inconsistent number of remaining story points for a team. The points remaining cant be located under any related story assigned to the team.",
                    "fixed_version":  "10.98.2"
                },
                {
                    "issue id": "JIRAALIGN-3336",
                    "issue_description": "When trying to update an Objective via API, it errors with it can't update due to inactive owner.HTTP 400 Bad Request:Cannot update milestone with id 464. Value for ownerId is invalid.",
                    "fixed_version":  "10.97.2"
                },
                {
                    "issue id": "JIRAALIGN-3299",
                    "issue_description": "New User and Password Reset emails aren't getting sent.",
                    "fixed_version":  "10.114.0"
                },
                {
                    "issue id": "JIRAALIGN-3298",
                    "issue_description": "External Ideation Users are able to create ideas on a ideation group that they are not authorized to.",
                    "fixed_version":  "10.98.0"
                },
                {
                    "issue id": "JIRAALIGN-3223",
                    "issue_description": "Users are getting kicked out of the Jira Align UI when they click the save button on the active PI. This is blocking users from being able to add programs to this PI which in return is blocking teams from aligning work within the correct portfolio via the current PI.",
                    "fixed_version":  "10.97.0"
                },
                {
                    "issue id": "JIRAALIGN-3218",
                    "issue_description": "API 2.0: GET /Products returns an empty list for non-superadmin users, GET /Products/{id} returns 404.Expected Results : Should get the same list of Products the user has access to via API.",
                    "fixed_version":  "10.98.0"
                },
                {
                    "issue id": "JIRAALIGN-1554",
                    "issue_description": " When a team to team dependency or program to program dependency is requested outside of the target completion, this is causing the feature and dependency to be red (which is expected). However, when the team commits to it within the target completion the dependency and feature are still showing red which should not be the case since they have agreed to get the work done within the target completion.",
                    "fixed_version":  "10.107.0"
                }
            ]
        },
        {
            "version":"10.96.x",
            "date_of_release":"5 December 2015",
            "issue":[
                {
                    "issue id": "JIRAALIGN-3375",
                    "issue_description": "Epics with blocked child Features are not displayed if 'Feature by Epic' filter is selected  ",
                    "fixed_version":  "10.105.0"
                },
                {
                    "issue id": "JIRAALIGN-3344",
                    "issue_description": "Delete functionality for strategic snapshots is only available to Super Admin. There is a single toggle for the strategic snapshot in role permission. We need to add toggles for Add, Save and Delete.",
                    "fixed_version":  "10.114.0"
                }
                

            ]
        } ,
        
        {
            "version":"10.98.x",
            "date_of_release":"5 December 2015",
            "issue":[
                {
                    "issue id": "JIRAALIGN-3521",
                    "issue_description": "Objective Still linked to Program Even After Deletion",
                    "fixed_version":  "10.100.0"
                },
                {
                    "issue id": "JIRAALIGN-3519",
                    "issue_description": "When Default User in Jira Settings is not set to an existing user ID, Canceling a Synced Feature in Jira hides it in Jira Align instead of putting it in Canceled Bin",
                    "fixed_version":  "10.101.0"
                },
                {
                    "issue id": "JIRAALIGN-3478",
                    "issue_description": "Estimations are not getting converted as the estimation method is changing for a Portfolio. The original numbers for that type of estimation method are remaining in the fields. This could mean if a customer changed back after some time, that the system would be using the wrong figures to calculate its financials, forecasting, and estimating",
                    "fixed_version":  "10.104.0"
                },
                {
                    "issue id": "JIRAALIGN-3445",
                    "issue_description": "change security options has impact on any user with checklist open.Checklist permissions changed from Public to Private while User 2 had it as their last screen. After logging in, received 'You Need More Access to View This Page'  error with no indication as to why.",
                    "fixed_version":  "10.100.0"
                }
                
            ]
        },

    {
        "version":"10.98.x",
        "date_of_release":"5 December 2015",
        "issue":[
            {
                "issue id": "JIRAALIGN-3619",
                "issue_description": "Reference attribute was removed from Audit Log after 10.98 release",
                "fixed_version":  "10.103.2"
            },
            {
                "issue id": "JIRAALIGN-3550",
                "issue_description": "After a Program was deleted from the Solution Objective, the deleted program is still listed on the GET request. When a user tries to PATCH the  Solution Objective, he/she receives an error 'Cannot update the Milestone'.",
                "fixed_version":  "10.100.0"
            },
            {
                "issue id": "JIRAALIGN-3546",
                "issue_description": "Jira Align Change Log displays 10 records per screen regardless of what is defined under 'Records Displayed Per Screen' user preference",
                "fixed_version":  "10.103.0"
            },
            {
                "issue id": "JIRAALIGN-3529",
                "issue_description": "Primary key constraint error while trying to access the Customer List table in Enterprise Insights API",
                "fixed_version":  "10.99.1"
            },
            {
                "issue id": "JIRAALIGN-3510",
                "issue_description": "In the Program Room at the Team View, the future sprint is shown as complete (full green bar) even though the sprint has not been started. The team has no stories assigned to the sprint.",
                "fixed_version":  "10.123.0"
            },
            {
                "issue id": "JIRAALIGN-3503",
                "issue_description": "For any system role besides Super Admin or a role that was copied from Super Admin, the Save button will not display in the upper-righthand corner when the Details Panels Settings toggle is enabled in the permissions",
                "fixed_version":  "10.100.0"
            }
        ]
    },

    {
        "version":"10.99.x",
        "date_of_release":"5 December 2015",
        "issue":[
            {
                "issue id": "JIRAALIGN-3662",
                "issue_description": "API to return all 'Key Results' is having an Error 500: 'Nullable object must have a value'.",
                "fixed_version":  "10.103.0"
            },
            {
                "issue id": "JIRAALIGN-3632",
                "issue_description": "When attempting to export data using the Time Submission Metrics export on the Time Tracking->Reports page, the data exports as a corrupt .xls file..",
                "fixed_version":  "10.102.0"
            },
            {
                "issue id": "JIRAALIGN-3611",
                "issue_description": "The tooltip of the process steps fields on themes are referring to Epic when customers hover the mouse whereas it should reflect information about the theme itself.",
                "fixed_version":  "10.120.0"
            },
            {
                "issue id": "JIRAALIGN-3606",
                "issue_description": "The user tried to add the users in the Analysts/Approvers field in Hypothesize tab, confirmed it saved successfully, however, when the user check Bet and Pivot/Perservere tab, the user is not assigned. the user needs to follow the same steps 4-6 times, then the users are assigned.",
                "fixed_version":  "10.113.0"
            },
            {
                "issue id": "JIRAALIGN-3585",
                "issue_description": "When trying to update an Epic through the API (be it a PATCH/PUT) it will throw an error if the Theme associated with it is inactive or deleted, the same if the owner is not active anymore. The problem is that the UI allows updates in both cases.",
                "fixed_version":  "10.103.0"
            },
            {
                "issue id": "JIRAALIGN-3250",
                "issue_description": "Jira Project field gets reset to 'No Sync' value and becomes disabled. Jira Project field should not default to 'No Sync' value and become inactive when user selects different PI in the integrated release vehicle",
                "fixed_version":  "10.99.0"
            }
            

        ]
    },
            
   
                
            
    


    {
        "version": "10.100.x",
        "date_of_release": "5 December 2015",
        "issue":[
            {
                "issue id": "JIRAALIGN-3650",
              "issue_description": "Program Dependencies shows TypeID inconsistency between GUI and DB/EI.Dependencies GUI shows Program Dependency type.Dependencies EI & JA Database shows Team Dependency type for same Dependency.",
           "fixed_version":  "None "
           },
       
       
       
       
       {
                 "issue id": "JIRAALIGN-3590",
                "issue_description": "Details panels settings have different toggles for slide-out view and column view for stories and defects.Details panels settings have different toggles for slide-out view and column view for stories and defects.Expect result is that There should be one toggle to handle both slide-out view and column view.Actual result is that At present we have two toggles to handle one field in slide-out view and column view.",
           "fixed_version":  "None "
           },
       
       
       {
                 "issue id": "JIRAALIGN-2904",
                  "issue_description": "Admin: Creating a new user fails if the email address contains an apostrophe.We are seeing an issue when users are created with apostrophes in the email address. The application throws an error code in UI as a result of a Type mismatch error in Splunk.",
           "fixed_version":  "10.127.0 "
           },
           {
            "issue id": "JIRAALIGN-3807",
             "issue_description": "Objectives: Enabled Feature Toggle 26 causes HTML tags to be added permanently in the Description field of Objectives.Creations/edits/updates made while Feature Toggle 26 is Enabled causes HTML tags to be added permanently in the Description field of Objectives. These cannot be reverted by disabling the toggle.Expected result is that Just like in Features, the Description field should not contain HTML tags regardless of whether FT26 is on/off, and the formatting of this field should be left to Rich Text Renderer.",
      "fixed_version":  "10.107.0 "
          },
          {
          "issue id": "JIRAALIGN-3804",
       "issue_description": "Import: Pressing 'Import Data' without any file causes unexpected objects to be imported.Expected result is that Getting an error message that we didn't select any files and seeing all the numbers on the left as 0.",
	"fixed_version":  " None "
    },


{
          "issue id": "JIRAALIGN-3756",
      "issue_description": "Points Planned vs Points Accepted Report: Points planned changes even though the sprint has started.The report is showing inconsistent value for planned story points.Ideally, the planned story points/planned velocity should be locked as soon as the sprint starts.",
	"fixed_version":  "None"
    },


{
          "issue id": "JIRAALIGN-3653",
           "issue_description": "Opening Manage Runway page from Program Room Runway (Cog) displays a list that does not use Platform Terminology customization.The Program Room Runway shows customised Terminology, for Epics, Features and Stories, in the runway itself, but when the Cog (on the right-hand end of the runway) is used to open the Manage Runway page, the list shows the default terminology. Expected result is that the list in the Manage page launched from the Program Room Runway should use the same customized terminology as the Runway itself uses.",
	"fixed_version":  "10.122.0"
    },


{
          "issue id": "JIRAALIGN-3651",
          "issue_description": "Ideation, Setup slideout: Admins and Internal Contributors fields have invisible clickable elements next to them.Ideation, Setup slideout: Admins and Internal Contributors fields have invisible clickable elements next to them that interact with the User selection.It's possible to click on empty space and visually reset the users in the Admins and Internal Contributors fields, but it doesn't seem to go through when clicking 'save'.",
	"fixed_version":  "None"
    },


{
          "issue id": "JIRAALIGN-3747",
           "issue_description": "STORY MAPS - Save disabled - Add Story Map button is still visible.Customer is trying to create a read-only role. This includes read-only view of Story Maps.With the expected permissions set, the 'Add Story Map' button is still visible.",
	"fixed_version":  "None "
    },


{
          "issue id": "JIRAALIGN-3745",
           "issue_description": "STORY MAPS – Save Enabled - Save button does not exist even though permission is turned on.Story Maps Save permission is Enabled, but no Save button visible.",
	"fixed_version":  "None"
    },


{
          "issue id": "JIRAALIGN-3741",
        "issue_description": "When viewing the Program Predictability Report, if there are Programs added to the parent Solution after the creation of the Program Increments shown on the Report, the data calculation is displaying incorrectly.",
	"fixed_version":  "10.104.0 "
    },


{
          "issue id": "JIRAALIGN-3709",
          "issue_description": "Adding a FixVersion to a Jira Story is clearing or changing to an incorrect Sprint on Jira Align.Sprint/iterations in some Stories are getting cleared or moved by the Jira connector after adding a FixVersion on Jira. Some of the affected stories had no changes at all on Jira, but share the same timeframe of others that were changed.",
	"fixed_version":  "10.115.0 "
    },


{
          "issue id": "JIRAALIGN-3708",
           "issue_description": "Program Board : The Capture button on the Program Board is displaying a blank page with only the dates shown.Expected result is that create a screen capture of the Program Board.",
	"fixed_version":  "None "
    },


{
          "issue id": "JIRAALIGN-3699",
           "issue_description": "Feature Process Step not updated as per the mapping when child story is moved to 'In Progress' in Jira.Expected result is that along with default status update, relevant Process step is also updated as per the mappings",
	"fixed_version":  " 10.110.0"
    },


{
          "issue id": "JIRAALIGN-3698",
    "issue_description": "Theme name and description are getting updated when different themes are opened in different browsers tabs.Theme names and descriptions are getting updated when different themes are opened in different browsers tabs. Other Theme details seem to be impacted by this, like Strategy, Fiscal year goal, Report color, Program, and PI.",
	"fixed_version":  "10.119.0 "
    },


{
          "issue id": "JIRAALIGN-3689",
           "issue_description": "Date timestamp of changes in state are not correctly captured - NULL.When the state of a work item is changed the correte date timestamp is not being captured in all scenarios. If the user changes the state on JA and hit save, it got recorded, but if the same happens without the save (like being changed on Jira and synced to JA), the timestamp is not recorded even though the state changes.Expected result is that regardless of how the state changes, the timestamp will be captured on the corresponding fields.Actual result is that Depending on how the state is changed, the timestamp is not captured accordingly.",
	"fixed_version":  "10.104.0 "
    },


{
          "issue id": "JIRAALIGN-3687",
           "issue_description": "Theme: when creating a Theme without a Program, an error is thrown and it disappear from the Grid.When a Theme is created without a Program associated with it, an error is thrown and the Theme doest't appear on the Grid. If you search on throught the universal search (the magnifuing glass at the right corner of the screen), you can find the Theme, and if any update is made on it, the Theme will appear on the Grid after it.Also if a Theme that is on the grid has the Program removed from it, it will throw an error and disappear form the grid as well.",
	"fixed_version":  "10.105.0 "
    },


{
          "issue id": "JIRAALIGN-3673",
           "issue_description": "Status Report: User was removed from Program Team but is still appearing in the Status Report as an icon.",
	"fixed_version":  "None "
 },




{
          "issue id": "JIRAALIGN-3667",
           "issue_description": "Adding an empty state mapping and then editing it causes state mapping duplicity.If the user clicks on the 'Add' button from the State Mapping page without selecting any state, it will create a temporary state that could allow users to bulk editing/adding states.The problem is that the user will be able to enter a value that already exists or will be imported from Jira.As the state is duplicated, it will appear twice in the State Mapping, and in the Manage Custom Fields, where it won't save for the duplicated items.",
	"fixed_version":  "10.103.0 "
    },


{
          "issue id": "JIRAALIGN-3663",
       "issue_description": "Advanced Configurations filter: Group Layer drop-down menu does not reflect updated platform terminology.",
	"fixed_version":  "None"
    },


{
          "issue id": "JIRAALIGN-3510",
           "issue_description": "Future Sprint Shown as Complete in Program Room when there are no stories assigned to it.In the Program Room at the Team View, the future sprint is shown as complete (full green bar) even though the sprint has not been started. The team has no stories assigned to the sprint.",
	"fixed_version":  "10.123.0"
  }

  
        ]
},

    {
        "version": "10.101.x",
        "date_of_release": "5 December 2015",
        "issue":[
            {
                "issue id": "JIRAALIGN-3777",
        "issue_description": "Kanban Board: Setup Workflow becomes unresponsive.When accessing the Setup Workflow on a Kanban Board,  the page becomes unresponsive.",
          "fixed_version":  "None "
          },
      
      
      {
                "issue id": "JIRAALIGN-3827",
                 "issue_description": "Program Board : Entities with same ID are highlighted regardless of their relation to the hovered object.",
          "fixed_version":  "10.104.0"
          }
        ]
    },

    {
        "version": "10.102.x",
        "date_of_release": "5 December 2015",
        "issue":[
            {
                "issue id": "JIRAALIGN-3793",
                 "issue_description": "Capabilities: Notes created on Status Report don't reflect on Roadmap and vice versa.If a Note is created for a Capability on the Status Report, it will not appear on the Roadmap, and the opposite is true as well, Notes created on Roadmap will not appear on Status Report.",
          "fixed_version":  "10.113.0 "
          },
      
      
      {
                "issue id": "JIRAALIGN-3768",
                 "issue_description": "The drop down list from Recycle Bin/Cancel Objects pages does not reflect the Platform Terminology naming customisation.If we change the platform terminology in the Administration page, the change is not reflected in the drop down list of the Access Canceled objects or Recycle Bin pages.",
          "fixed_version":  "10.103.0"
          },
      
      
      {
                "issue id": "JIRAALIGN-3755",
                 "issue_description": "Reports disabled as part of Standard Plan still show up in the Role Permissions and on a report page dropdown.",
          "fixed_version":  "None"
          },
      
      
      {
                "issue id": "JIRAALIGN-3744",
                 "issue_description": "Jira API Log reports 404 'board cannot be viewed' when a non-integrated board is deleted from Jira.",
          "fixed_version":  "None "
          },
      
      
      {
                "issue id": "JIRAALIGN-3731",
                 "issue_description": "When an email is sent by the Responsibility Assignment Matrix that is related to a change in a Capability, the terminology used on it is the one that is assigned to Epics instead of the one for Capabilities.",
          "fixed_version":  "10.103.0 "
          },
      
      
      {
                "issue id": "JIRAALIGN-3698",
                 "issue_description": "Theme names and descriptions are getting updated when different themes are opened in different browsers tabs. Other Theme details seem to be impacted by this, like Strategy, Fiscal year goal, Report color, Program, and PI.",
          "fixed_version":  "10.119.0 "
          }
      
            
        
          
        ]
    },








    {
        "version": "10.103.x",
        "date_of_release": "5 December 2015",
        "issue":[
            {
                "issue id": "JIRAALIGN-3918 ",
                 "issue_description": "Create Objectives link does not work in an empty objectives view.In the Objectives view, the 'Create an Objectives here' link that appears when there are no objectives being displayed, does not work.Expected result is that to display the Objectives creation window.Actual result is that nothing happens.",
          "fixed_version":  "10.115.0 "
          },
      
      
      {
                "issue id": "JIRAALIGN-3899",
                 "issue_description": "Jira Align new OKR creation experience does not allow the editing of the OKR description after it was created while the legacy experience did. ",
          "fixed_version":  "10.108.0 "
          },
    
      
      
      
      {
                "issue id": "JIRAALIGN-3890",
            "issue_description": "Enterprise Insights: when using the Story API, using select with fields “Rank Feature” or “State with Accepted” returns an error.When using the Story API for the Enterprise Insights, if a 'select' statement is used with the field “Rank Feature” or “State with Accepted”, errors is returned.Expected result is that the fields would be returned.",
          "fixed_version":  "10.104.2 "
          },
      
      
      {
                "issue id": "JIRAALIGN-3889",
              "issue_description": "Team Sprints: Duplicate Members are added to the team sprint by the Jira Connector sync.The Jira Connector synchronization creates duplicate entries, in the team sprint, for users who have been previously removed from the Team.The sync not adds only the members to the team but as well to the sprint although there is already an existing entry for these users. ",
          "fixed_version":  "10.107.0 "
          },
      
      
      {
                "issue id": "JIRAALIGN-3868",
                 "issue_description": "Date timestamp of changes in state are not correctly captured - wrong timestamp.Expected result is that Regardless of when the state changes or the frequency, the CORRECT timestamp will be captured on the corresponding fields.Actual result is that depending on the frequency of the state change, the timestamp is not correctly captured accordingly. ",
          "fixed_version":  "10.105.0 "
          },
      
      
      {
                "issue id": "JIRAALIGN-3862",
                 "issue_description": "Epics are still considered orphan in ‘no budget’.While checking orphan Epics, the epic is still considered orphan in 'no budget' although Theme, Estimation, budget, or theme group are in place.Expected result is that The Epic set with Theme, Estimation, budget, or theme group is no longer listed/considered an orphan in the 'no budget' section.Actual result is that Epics are still considered orphans in ‘no budget’ ",
          "fixed_version":  "10.104.0 "
          },
      
      
      {
                "issue id": "JIRAALIGN-3850",
       "issue_description": "Remove Feature Owner field inconsistencies between WEB UI and REST API.Using the Web UI, you can successfully update a feature, with the userId of a user who does not belong to the Program team but belongs to the Portfolio team.This is not possible with the REST API as it will throw the error message ",
          "fixed_version":  "10.107.0 "
          },
      
      
      {
                "issue id": " JIRAALIGN-3847",
             "issue_description": "Roadmap - Missing Epics in RoadMap once compared to Epic Grid.The Roadmap is not presenting a few Epics no matter the filtering options used.The number of Epics in the Epic Grid is discrepant when compared with the Roadmap.Expected result is that after Tier 1 filtering, the same amount of Epics should appear in the Roadmap as in the Epic Grid  ",
          "fixed_version":  "10.105.2 "
          }
      
            
        
          
        ]
    },








    {
        "version": "10.104.x",
        "date_of_release": "5 December 2015",
        "issue":[
            {
                "issue id": "JIRAALIGN-4078",
                "issue_description": "Refreshing the page on the Program Team or Team page gives a user the ability to edit team members when not possible before refreshing the page.A user who does not have the ability to add/remove members of a program team is suddenly given that ability upon refreshing the page under the Program team member's list.Expected result is that If the user does not have the ability to add or remove program team members, refreshing the page should not give them that ability.Actual result is that A user who does not have the ability to add/remove program team members is suddenly given the ability to do so when refreshing the page on the program team member's page.  ",
           "fixed_version":  "10.109.0 "
           },
       
       
       {
                 "issue id": "JIRAALIGN-3945",
                  "issue_description": "Already resolved story in Jira when synced, returns wrong 'State' via API.Expected result is that the story API response for state is consistent with the state shown in UI.Actual result is that The story API response for state is different and not consistent with UI. ",
           "fixed_version":  "10.117.0"
           },
       
       
       {
                 "issue id": "JIRAALIGN-3935",
                  "issue_description": "When setting up custom team field mapping between Jira and Jira Align, spaces are allowed in the Custom Field ID value which can lead to connector sync failures for both Stories and parent Features.Expected result is that Not allow spaces in custom field ID values either by trimming spaces automatically or throwing error during Save.Actual result is that Custom field ID values can be entered with a space without warning which leads to sync failures that are difficult to identify. ",
           "fixed_version":  "10.115.0"
           },
       
       
       {
                 "issue id": "JIRAALIGN-3918",
                  "issue_description": "Create Objectives link does not work in an empty objectives view.Expected result is that To display the Objectives creation window.Actual result is that To display the Objectives creation window.Actual result is that Nothing happens. ",
           "fixed_version":  "10.115.0 "
           },
       
       
       {
                 "issue id": "JIRAALIGN-3913",
                  "issue_description": "When updating a custom field for an Epic through a PATCH, the audit logs will not record the change made, which is only recorded if the change is made on the UI.Expected result is that The change made by the API would be recorded as the one made on the UI.Actual result is that PATCH call made to the custom field is not captured on the audit log.",
           "fixed_version":  "10.107.0 "
           },
       {
                 "issue id": "JIRAALIGN-1554",
             "issue_description": "When a team to team dependency or program to program dependency is requested outside of the target completion, this is causing the feature and dependency to be red (which is expected). However, when the team commits to it within the target completion the dependency and feature are still showing red which should not be the case since they have agreed to get the work done within the target completion.Expected result is that If the team commits to the dependency within the target completion even though the request was outside the target we shouldn't flag a planning issue. ",
           "fixed_version":  "10.107.0 "
           }
       
            
        
          
        ]
    },




    
    {
        "version": "10.105.x",
        "date_of_release": "5 December 2015",
        "issue":[
            {
                "issue id": "JIRAALIGN-4020",
                 "issue_description": "When removing a program from an Epic, the Forecast data is not updated to remove the Business Epic's forecast records for that Program.This seems to occur when the program is removed from the Epic, but a PI remains connected to the Epic that is linked to both the removed program and another program relevant to the Epic.",
          "fixed_version":  "10.121.0 "
          },
      
      
      {
                "issue id": "JIRAALIGN-3996",
                 "issue_description": "Making changes to Epics in a Custom Hierarchy, such as adding and removing products from the Epic, causes any lower values entered for child work items to be wiped out.Expected result is that The subcategory information for the unmet needs should have been preserved for the feature, especially since the Uro product was unrelated to the unmet need.Actual result is that Removing or adding an unrelated product to the Epic is wiping out the subcategory information for the child Feature.",
          "fixed_version":  "10.107.0 "
          }
      
        
          
        ]
    },


    {
        "version": "10.106.x",
        "date_of_release": "5 December 2015",
        "issue":[
            {
                "issue id": "JIRAALIGN-4207",
                 "issue_description": "A feature that has not specifically been assigned to a team, should appear in the Unassigned row of a Program Board. If the details of the Begin and Finish work settings are saved before a Team is assigned then the feature will no longer be displayed in the Program Board .It is expected that the feature will remain in the unassigned row when setting Begin and Finish Work,  if a Team has not been set.",
          "fixed_version":  "10.106.4"
          },
      
      
      {
                "issue id": "JIRAALIGN-4088",
                 "issue_description": "When importing Features, target sprints do not update if they weren't selected before.Expected result is that Import should either update the target sprints, or indicate why it didn't.Actual result is that Target sprints did not update in the Features where they weren't selected before, but import was shown as success.",
          "fixed_version":  "10.118.0 "
          },

      
      
      
      {
              "issue id": "JIRAALIGN-4209",
            "issue_description": "Epic Roadmaps visualization bars pop out and float over other columns when Epic details panel Spend tab is selected.Expected result is that The bars should not pop out of the visualization area.Actual result is that The bars pop out over the column text, selecting other tabs or closing the details panel doesn't help.",
          "fixed_version":  "10.111.0 "
          },
      
      
      {
                "issue id": "JIRAALIGN-4192",
                "issue_description": "An exception is thrown when the connector tries to consolidate duplicate users in Jira Align.Expected result is that No exception is thrown and duplicate accounts should be consolidated successfully.Actual result is that Exception is thrown.",
          "fixed_version":  "10.109.0 "
          },
      
      
      {
              "issue id": "JIRAALIGN-4173 ",
            "issue_description": "Unable to use 'feature state' as a filter in Roadmaps.Expected result is that You see the Feature States list to choose from.Actual result is that We see this is just loading indefinitely.",
          "fixed_version":  "10.108.0"
          },
      
      
      {
           "issue id": "JIRAALIGN-4458",
       "issue_description": "When adjusting Capacity for an Epic or Capability in the Forecast page, the Capacity changes are not reflected in the Audit Log for the work item, although the changes are shown in the Forecast Tab of the specific work item.Expected is that Modifications to Capacity done in the Forecast page will reflect in the Audit Log for any given work item.Actual result is that Modifications to Capacity done in the Forecast page are not recorded in the Audit Log for work items.",
      "fixed_version":  "10.118.0 "
        }
      
            
        
          
        ]
    },


    {
        "version": "10.111.x",
        "date_of_release": "5 December 2015",
        "issue":[
            {
                "issue id": "JIRAALIGN-4461",
                "issue_description": "Feature Map page - Pressing 'Save & Close' after creating Feature don't pin the Features in the Map.After creating and saving a new Feature using 'Save & Close' button  in Feature mapping page it doesn't pin the Feature in the map as expected.However, pressing only 'Save' instead of 'Save & Close' pins correctly the Feature to the map as expected.",
          "fixed_version":  "10.115.3 "
          },
      
      
      {
                "issue id": "JIRAALIGN-4446",
                 "issue_description": "When playing planning poker, stories are removed when pressing the carriage return key from inside the chat box.Expected result is that Stories should not be removed from the game.Actual result is that Stories should not be removed from the game.",
          "fixed_version":  "10.119.0 "
          },
      
      
      {
                "issue id": "JIRAALIGN-4414",
                 "issue_description": "When using the Feature Backlog, if one Feature is opened and updated, after saving/closing, it will disappear from it, and will only re-appear if the page is refreshed. Other Backlogs (like Epics/Stories) don't have the same problem.Expected result is that After saving a Feature, it would be visible on the backlog without the need for a refresh of the page.Actual result is that A refresh is needed to make the Feature appear on the backlog.",
          "fixed_version":  "10.116.0 "
          }
        
          
        ]
    },









    {
        "version": "10.112.x",
        "date_of_release": "5 December 2015",
        "issue":[
            {
                "issue id": "JIRAALIGN-4533",
                 "issue_description": "More Option in Story: Delete Stories permissions is turned off but roles are still able to delete story.Expected result is that As delete permission was turned off in Story, Non-Super Admin role shouldn't have Delete permission.Actual result is that Even though delete permission was turned off in Story, the user still able to delete the story in More Option.",
          "fixed_version":  "10.122.2 "
          },
      
      
      {
                "issue id": "JIRAALIGN-4525",
                 "issue_description": "In Roadmap, after you try to add notes to nested Child work items and hit save the notes look like they were not added at all in addition to showing 'None' in the column. for the notes to be displayed you need to refresh the page.",
          "fixed_version":  "10.115.0 "
          },
      
      
      {
                "issue id": "JIRAALIGN-4515",
                 "issue_description": "When an external user logs into the Jira Align Ideation Portal as a member of a public group, if 'Manage External Users' option in group is disabled, user will be presented a 'You don’t have access to this idea group. Please login or register.' error.Expected result is that User can log into the group and view ideas/vote without approval. Actual result is that User receives 'You don’t have access to this idea group. Please login or register' .",
          "fixed_version":  "10.119.0 "
          },
          {
            "issue id": "JIRAALIGN-4495",
             "issue_description": "Status Report: sort for the columns Rank and Budget is not working as expected.When sorting the status report for an organization, using the columns Rank and Budget, the results are mixed, with data appearing out of order.Expected result is that The sorting would respect the order.Actual result is that Some results appear out of order.",
      "fixed_version":  " 10.115.0"
      },

  
  {
            "issue id": "JIRAALIGN-4493",
             "issue_description": "When using planning poker for estimation games, the stories list keeps scrolling back to the beginning. When we click on the stories nothing happens for a non-Super Admin.Expected result is that The users should be able to scroll down the stories to look at all the records. They should also be able to click on any story to load the story in the game. Actual result is that The stories keep jumping back to the initial record when we scroll down. We cannot click on the stories in the list.",
      "fixed_version":  "10.119.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-4465",
             "issue_description": "When viewing the features in the Program backlog, you may see features displayed twice/duplicated.Expected result is that No duplicate features are shown in the backlog view.Actual result is that Duplicates are shown in the list for some of the features.",
      "fixed_version":  "10.118.1 "
      }
  
        
          
        ]
    },

    {
        "version": "10.113.x",
        "date_of_release": "5 December 2015",
        "issue":[
            {
                "issue id": "JIRAALIGN-4786",
                 "issue_description": "E-mail notifications for Risk: Too many alerts being sent (on prem).Too many email alerts are being generated/sent for the user selected in the 'Notify' field (under risks details). Each email has exactly 15 minutes time diff between them. Expected result is that The user is notified when a Target Resolution Date is not met. Actual result is thatThe user is receiving email notifications every 15 minutes.",
          "fixed_version":  "10.126.0 "
          },
      
      
      {
                "issue id": "JIRAALIGN-4635",
                 "issue_description": "Centralized calculations: Team cost is not re-snapshotted if user was previously deleted from the iterationTeam cost re-snapshot functionality doesn't works for users that were previously deleted.Expected result is that Team cost re-snapshot functionality accounts for users that were previously deleted.Actual result is that Team cost re-snapshot functionality doesn't account for users that were previously deleted.",
          "fixed_version":  "10.123.0 "
          },
      
      
      {
                "issue id": "JIRAALIGN-4582",
                 "issue_description": "Switching the Radio button of a Story Impediment to Team and adding a Team to the new Team field is a stored but undocumented change even if the Radio button is set back to Story.This allows team associations to stick and can cause the Impediment to show for Teams that are not actually associated.",
          "fixed_version":  "10.119.0 "
          },
      
      
      {
                "issue id": "JIRAALIGN-4573",
                 "issue_description": "Unable to identify users with same Full Name.In any work item like Stories, if more than one user has the same full name then there is no way to identify which user is it that has been assigned in the assigned field.Expected result is that We can have the User's email id or UserID visible along with the Full Name, this makes it easy to identify the User quickly.Actual result is  that We see both Users with the same Full Name and are unable to decide on the correct user to select.",
          "fixed_version":  "10.121.0 "
          },
      
      
      {
                "issue id": "JIRAALIGN-4558",
                 "issue_description": "Features are listed twice in the live Roadmap.When opening the Live Roadmap view, duplicate Features may appear in the name column.Expected result is that No duplicate features are shown in the Live Roadmap.Actual result is that Duplicate features appear under the name column.",
          "fixed_version":  " 10.118.1"
          },
      
      
      {
                "issue id": "JIRAALIGN-3698",
                 "issue_description": "Theme names and descriptions are getting updated when different themes are opened in different browsers tabs. Other Theme details seem to be impacted by this, like Strategy, Fiscal year goal, Report color, Program, and PI.Expected result is that the themes are updated successfully. ",
          "fixed_version":  "10.119.0 "
          }
      
        
          
        ]
    },







    {
        "version": "10.114.x",
        "date_of_release": "5 December 2015",
        "issue":[
            {
                "issue id": "JIRAALIGN-4447",
                 "issue_description": "Dependencies and Features are showing RED on the Program Board with no panning issue message in the Quick View panel making it hard to troubleshoot. Expected result is that There must be a message as to why a dependency and/or feature is showing red on the Program Board.Actual result is that There must be a message as to why a dependency and/or feature is showing red on the Program Board. ",
          "fixed_version":  "10.115.3 "
          }        
          
        ]
    },










    {
        "version": "10.115.x",
        "date_of_release": "5 December 2015",
        "issue":[
            {
                "issue id": "JIRAALIGN-4713",
       "issue_description": "Tier 1 Filter: When Custom Hierarchy is selected, it cannot load lower hierarchy level items and shows an empty list.Expected result is that The menu successfully loads all the sub-hierarchy level items.Actual result is that The menu cannot load sub-hierarchy-level items. After a while, it timeout at the backend and shows an empty list. ",
          "fixed_version":  "10.116.3 "
          },
      
      
      {
                "issue id": "JIRAALIGN-4695",
                 "issue_description": "Process Step is not getting reset to the first state while we copy the Feature and create a new Feature.Expected result is that Whenever a Feature is copied, along with Feature state, even Process Step should get Reset.Actual result is that Process Step remains the same as the state of old Feature Process Step. ",
          "fixed_version":  "10.123.0"
          },
      
      
      {
                "issue id": "JIRAALIGN-4691",
                 "issue_description": "Deleting a Sprint from a Jira Integrated team causes a Sprint Name already exists error. If a sprint is deleted/removed from the Jira Align Team but still exists in Jira (and has not been renamed in Jira) , then the Jira Connector will create a new sprint in Jira Align and link it to the Team. This new sprint will have the same name but a new numeric ID. Expected result is that When removing a spring form a team, it should not cause a conflict if the name of the sprint is reused by the Jira Connector  ",
          "fixed_version":  "10.121.0 "
          },
      
      
      
      {
                "issue id": "JIRAALIGN-4675",
                 "issue_description": "Intake Form: changes to case development custom fields orders don't work correctly.If you create case development custom fields with multiple fields and then try to alter the order of the fields using the up/down arrows. The fields do not move as expected. Sometimes moving up jumps 1-2 slots. Sometimes moving down jumps 5 slots.  Sometimes it will move other questions that are not related at all. Looks like a higher number of fields then more issues.Expected result is that The custom fields would move one position up/down..Actual result is that The custom fields move more than one position up/down.",
          "fixed_version":  "10.117.0 "
          },
      
      
      {
                "issue id": "JIRAALIGN-4672",
                 "issue_description": "Report name is not consistent across the product.In Jira Align, there is a report titled Scope Change Report, however when searching, you can't find it by that name. You have to search for Program Increment Scope. But when the report comes up, it's called Scope Change Report. This is confusing when referencing the report to others.Actual result is The report name is different while searching, on the landing page, and in the reports section.Expected result is that The report name should be the same across the product.",
          "fixed_version":  "10.122.0 "
          },
      
      
      {
                "issue id": "JIRAALIGN-4653",
                 "issue_description": "Users in certain system roles are not able to view/add/delete links related to an objective(Portfolio/Program/Team). It works fine with Super Admin and Product Owners. Expected result is that Users should be able to add or delete links related to the objective.Actual result is that Users should be able to add or delete links related to the objective.",
          "fixed_version":  " 10.118.0"
          },
      
      
      {
                "issue id": "JIRAALIGN-4317",
                 "issue_description": "The Cycle Time Control Chart in the Process Flow Cycle Time Report reports values loading from the selected Value Stream rather than the Context Menu selections.Expected result is that All reports honor either the Context Menu or the selected Value Stream.Actual result is that Cycle Time Control Chart honors the Value Stream selected while the other charts honor the Context Menu.",
          "fixed_version":  "10.132.0"
          },
          {
            "issue id": "JIRAALIGN-4771",
             "issue_description": "Roadmap: Capability State filter doesn't work.Capabilities not matching the capability filter are should on the roadmap. Expected Result is that Only capabilities matching the capability filter should be shown. Also, perform extensive testing on other work-items and the filters. ",
      "fixed_version":  "10.124.0"
      },
  
  
  {
            "issue id": "JIRAALIGN-4721",
             "issue_description": "Investment vs Spend not loading accepted spend report. The slide-out report doesn't load and the spinning wheel keeps turning endlessly generating error 500 on the request + Fatal Timeout errors in the Splunk logs. Expected Result is that The Theme's Accepted Spend report to load as usual.",
      "fixed_version":  "10.121.3"
      },
  
  
  {
            "issue id": "JIRAALIGN-4713",
             "issue_description": "In Tier 1 Filter When Custom Hierarchy is selected, it cannot load lower hierarchy level items and shows an empty list.The menu cannot load sub-hierarchy-level items. After a while, it timeout at the backend and shows an empty list.Expected Result is that The menu successfully loads all the sub-hierarchy level items.",
      "fixed_version":  "10.116.3 "
      },
  
  
  {
            "issue id": "JIRAALIGN-4700",
             "issue_description": "New sprint mapping setting not available in Jira V8.10 onwards.It appears the comparison logic in the system fail to recognize version 8.1x as a version above 8.8, and does not enable the feature. Expected Result is that Sprint mapping logic should be enabled for ALL version above 8.8 ",
      "fixed_version":  "10.118.0"
      },
  
  
  {
            "issue id": "JIRAALIGN-4695",
             "issue_description": "Process Step not getting reset on copy Feature. Process Step is not getting reset to the first state while we copy the Feature and create a new Feature.Process Step remains the same as the state of old Feature Process Step. Expected Result is that Whenever a Feature is copied, along with Feature state, even Process Step should get Reset.",
      "fixed_version":  "10.123.0"
      },
  
  
  {
            "issue id": "JIRAALIGN-4691",
             "issue_description": "Deleting a Sprint from a Jira Integrated team causes a Sprint Name already exists error. The red banner error of Sprint name already exists is seen when saving on any attempt to amend a connector created sprint. The deleted sprint causing the conflict cannot be found anywhere in the Jira Align UI.Expected Result is that When removing a spring form a team, it should not cause a conflict if the name of the sprint is reused by the Jira Connector ",
      "fixed_version":  "10.121.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-4690",
             "issue_description": "Cannot edit Key Results against an Objective tree - Goal, just get a spinning wheel.The page should be loading when clicked on the  Edit option",
      "fixed_version":  "10.118.0"
      },
  
  
  {
            "issue id": "JIRAALIGN-4684",
             "issue_description": "Dependency: error 500 is thrown when rejecting a Dependency to a Program without Committed Date. A Server 500 is thrown. Expected Result is that No errors would appear",
      "fixed_version":  "10.117.2"
      },
  
  
  {
            "issue id": "JIRAALIGN-4680",
             "issue_description": "Feature shows Green on Program Board though the dependencies are RED.The feature should be in the red color or red tip (accepted with planning issues) as the dependency is in not committed. Due to this, the customer is missing to fix dependencies and has no insight until the feature is clicked. But The Feature is shown in Green though underlying Dependency is in red",
      "fixed_version":  "10.123.0"
      },
  
  
  {
            "issue id": "JIRAALIGN-4675",
             "issue_description": "Intake Form: changes to case development custom fields orders don't work correctly. The custom fields move more than one position up/down.But  The custom fields Should Move one position up/down. ",
      "fixed_version":  "10.117.0"
      },
  
  
  {
            "issue id": "JIRAALIGN-4672",
             "issue_description": "Report name is not consistent across the product.In Jira Align, there is a report titled Scope Change Report, however when searching, you can't find it by that name. You have to search for Program Increment Scope. But when the report comes up, it's called Scope Change Report.The report name is different while searching, on the landing page, and in the reports section. The report name should be the same across the product. ",
      "fixed_version":  "10.122.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-4671",
             "issue_description": "Program Increments page/grid is no longer visible/accessible. Expected Result is that View/Access to Program Increments",
      "fixed_version":  "None"
      },
  
  
  {
            "issue id": "JIRAALIGN-4660",
             "issue_description": "New Objective Tree: Column Names. Columns labeled with names can be confusing for some customers because by definition they all look at completed items but the column is named {item} completed or {Item} progress",
      "fixed_version":  "10.118.0"
      },
  
  
  {
            "issue id": "JIRAALIGN-4317",
             "issue_description": "Cycle Time Control Chart does not honor Context Menu.The Cycle Time Control Chart in the Process Flow Cycle Time Report reports values loading from the selected Value Stream rather than the Context Menu selections.Cycle Time Control Chart honors the Value Stream selected while the other charts honor the Context Menu. Expected Result is that All reports honor either the Context Menu or the selected Value Stream.",
      "fixed_version":  "10.132.0"
      }
  
            
        
          
        ]
    },

 {
            "version": "10.116.x",
            "date_of_release": "5 December 2015",
            "issue":[
                {
                 "issue id": "JIRAALIGN-5050 ",
                 "issue_description": "Deletion of External Links is not possible without system role permissions in the Portfolio layer. Expected result is that The deletion cross should be seen (and work) without needing the permission to Add Epics in the Portfolio layer of the role..Actual result is that The deletion cross is not displayed (so a deletion of an external link cannot be done) without the permission to Add Epics in the Portfolio layer of the role - which gives too much permission to staff that should not be working in the Portfolio layer.",
	            "fixed_version":  "10.126.2 "
                  },

                  {
                    "issue id": "JIRAALIGN-5048",
                     "issue_description": "A Jira Epic is not being synced to Align as a new Feature after having its JiraKey already synced and replaced in Align once in the past.",
              "fixed_version":  "10.133.0 "
              },
          
          
          {
                    "issue id": "JIRAALIGN-4776",
                     "issue_description": "When the state of a work item is changed the corrected date timestamp is not being captured.The state in the story changed to In Progress, and checked the tables (or EI) and confirm the timestamp is not captured correctly.Expected result is that Regardless of how the state changes, the timestamp will be captured on the corresponding fields.Actual result is that Depending on how the state is changed, the timestamp is not captured accordingly.",
          
          
              "fixed_version":  "10.119.0 "
              },
          
          
          {
                    "issue id": "",
                     "issue_description": "Kanban view in Capability backlog – when filter with Custom Hierarchy, incorrect numbers are shown in Process step column.The filter function is not working in Kanban view of Capability backlog, the correct total numbers are shown, however, all capabilities are listed in Process step column.Expected result is that Correct numbers are shown in Process step column.Actual result is that It is not filtered via Custom Hierarchy in Kanban view in Capability backlog.",
              "fixed_version":  "None "
              },
          
          
          {
                    "issue id": "JIRAALIGN-4761 ",
                     "issue_description": "EI: Custom field drop-down single select does not sync to EI when an option is removed in Details Panel Settings.Custom field drop-down single select does not sync to EI when an option is removed in Details Panel Settings.Expected result is that NULL value should be synced to EI, the same as when updating the field manually to 'Select One' non-option.Actual result is that EI shows the previous dropdown value which is now invalid.",
              "fixed_version":  "10.119.0 "
              },
          
          
          {
                    "issue id": "JIRAALIGN-4759",
                     "issue_description": "Saving just an Objective description and not 'saving and closing' the objective results in the description not being saved.Customer has noted that recently there was a change in the way Objectives are saved on the main objective screen. There are two save buttons, one for the description and then another for the Objective object as a whole. You need to hit save in both places to save the description.Expected result is that The objective description that was recently changed is retained upon closing the objective.Actual result is that When saving just the description and closing out the Objective it does not save the updated description.",
              "fixed_version":  "10.123.3 "
              },
          
          
          {
                    "issue id": "JIRAALIGN-4734 ",
                     "issue_description": "Editing a portfolio tier objective in a portfolio with over 200 projects results in 'Project text length exceeded 1000 characters' error. Even attempting to remove some projects will result in the error and changes not saving.Expected result is that Edits are saved.",
              "fixed_version":  "10.118.1 "
              },
          
          
          {
                    "issue id": "JIRAALIGN-4730",
                     "issue_description": "When runnign a PATCH on the Features endpoint to update the ParentId, it will allow the update if the Epic is in a different Program than the Feature (what the UI doest not allow as it filters the list of possible parents on the same Program). The problem with this is that, the update is only partial, as it will appear on the Contained In, but not on the Parent Epic field on the UI, and any subsequent update made on the Feature on the UI will remove Parent.",
              "fixed_version":  "10.121.0 "
              },
          
          
          {
                    "issue id": "JIRAALIGN-2814 ",
                     "issue_description": "When navigating to Epic grid view and setting the not equals filter for PI or Process step and the correct values aren't displaying. When you turn on columns shown or review the work item slide out fields the filtered data doesn't match.Expected result is that We shouldn't show values selected in the not equals filter.Actual result is  that Not equals isn't showing accurate results.",
              "fixed_version":  "None "
         }
          



            ]
 },

 {
    "version":"10.116.x", 
    "date_of_release":"Sept 16 , 2016",
    "issue":[
        {
            "issue id": "JIRAALIGN-5050",
             "issue_description": "Deletion of External Links is not possible without system role permissions in the Portfolio layer.Expected result is that the deletion cross should be seen (and work) without needing the permission to Add Epics in the Portfolio layer of the role.Actual result id that The deletion cross is not displayed (so a deletion of an external link cannot be done) without the permission to Add Epics in the Portfolio layer of the role - which gives too much permission to staff that should not be working in the Portfolio layer.",
      "fixed_version":  "10.126.2 "
      },
  
  
  {
            "issue id": "JIRAALIGN-4882 ",
             "issue_description": "Needed Capacity under Plan capacity shows incorrect Teams value.The needed capacity value is displayed differently on the Plan capacity page compared to Forecast main page.Expected result is that Teams value should show count of only Active Epics in both Forecast page and under Plan Capacity page.Actual result is that The Needed Capacity ( that can be found when using the button Plan Capacity, under the Forecast), will display the Needed Capacity for the Program correctly (so only counting the current Epics), but for the Teams the value is incorrect, as it continues to count the deleted items. ",
      "fixed_version":  "10.121.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-4849",
             "issue_description": "Clicking External Entity in Program Board displays blank page.Clicking External Entity in Program Board displays blank page.Expected result is that External Entities should be rendered as static text (not hyperlinks) OR should link to 'Manage External Entities' panel.Actual result is that External Entities are rendered as hyperlinks that open to a blank page.",
      "fixed_version":  "10.123.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-4839",
             "issue_description": "If you change a Feature or Story Process Steps from any Step to 'Select One' (default value) it is not recorded in the audit logs.Expected result is that Event should be logged in the audit logs.Actual result is that No event log about the process step change ",
      "fixed_version":  "10.131.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-4826",
             "issue_description": "Dragging a feature in or out of the Parking Lot within the same quarter does not update audit log.Dragging a feature in or out of the parking lot within the same quarter does not update the feature audit log in feature backlog view.The audit log is recorded successfully when moving feature within the same quarter by right clicking on it and then selecting 'Move to Parking Lot' or 'Move to Backlog'.Expected result is that Dragging a feature in/out of a parking lot within the same quarter should be recorded in the audit log. Dragging a feature to the parking lot and using 'Move to Parking Lot' should have the same behavior.Actual result is that Dragging a feature in or out of the parking lot within the same quarter does not update the feature audit log in feature backlog view. ",
      "fixed_version":  "10.125.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-4822 ",
             "issue_description": "The objective name is broken off after the pipe character '|' in search fields.When the objectives' name contains a pipe, it is not possible to view the complete text while searching for existing objectives in the work item panel/slide out.Expected result is that The full text of the objective's name is provided. ",
      "fixed_version":  "10.124.1 "
      },
  
  
  {
            "issue id": "JIRAALIGN-4821",
             "issue_description": "Users will add align users to teams, and occasionally during user addition, Align will delete a batch of members out of the team member list.After a review of the user's actions, they are not doing anything that would 'deselect' team members from the team and the action from Align appears random.Expected result is that No user should be removed when adding manually users to portfolio.Actual result is that User appear to be removed from portfolio during member addition processThere is no identified pattern as to when this would happen, nor a limit reached in portfolio users, or number of Addition action in a row.",
      "fixed_version":  "10.126.2 "
      },
  
  
  {
            "issue id": "JIRAALIGN-4809",
             "issue_description": "When creating a new role using copy role option the manage custom hierarchies settings do not copy to the new role.Expected result is that The manage custom hierarchies permissions are copied to the new role.Actual result is that The manage custom hierarchies permissions are not copied to the new role. ",
      "fixed_version":  "10.130.0 "
      },
  
  
  
  
  {
            "issue id": "JIRAALIGN-4769",
          "issue_description": "Owner names with special encoded characters are not displaying properly in Forecast page. Expected result is that owner name with special characters should be displayed the same way.Actual result is that Owner name with special characters are displayed with some html characters.",
      "fixed_version":  "10.121.0 "
      }
  
    ]
},

{
    "version":"10.118.x",
    "date_of_release":"5 December 2015",
    "issue":[

        {
            "issue id": "JIRAALIGN-4990",
             "issue_description": "The  Primary Program field on the Capability form doesn't interact with the Parent Epic field, which means that no matter what Parent Epic is selected, the Primary Program field will load all the program options, including the programs that are not related to the parent Epic selected.Expected result is that The Primary Program field will be loaded with the options filtered by the Parent Epic Selected. The behavior should be the same as that happens with the Feature form.Actual is that The Primary Program field loads programs that are not related to the parent epic selected and allows the user to save it. ",
      "fixed_version":  "10.126.2 "
      },
  
  
  {
            "issue id": "JIRAALIGN-4954",
             "issue_description": "When there are a lot of Capabilities and Features linked to a Custom Hierarchy and Portfolio Epic, the Live Roadmap page encounters errors displaying all records.Expected result is that Capabilities and or Features are displayed accordingly.Actual result is that No data is loaded or the 'loading more items' icon remains spinning on the page.",
      "fixed_version":  "10.126.2 "
      },
  
  
  {
            "issue id": "JIRAALIGN-4938",
        "issue_description": "Story Audit Report Missing Column.The story audit report in Jira Align is missing the 'Ready to Start' state column between the 'Pending Approval' and 'In Progress' columns.Expected result is that The story audit report should have a column for all the story statuses.Actual result is that The story audit report in Jira Align is missing the 'Ready to Start' state column between the 'Pending Approval' and 'In Progress' columns.",
      "fixed_version":  "10.121.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-4927",
             "issue_description": "Roadmap Sync may fail without a correct/useful information message.When users try to sync, from the Roadmap, the health of a particular feature, the changes may not be propagated. Instead, a generic message without information about why the sync failed and how to fix it is thrown.",
      "fixed_version":  "10.122.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-4920",
             "issue_description": "Cannot add Custom Text Area type in New Objective.There is no issue to add a Custom Text input type, custom (multi) dropdown type, or Custom Text Area in legacy experience objectivesThe user can add a Custom Text input type, custom (multi) dropdown type, however, they cannot add Custom Text Area type in New Objectives.Expected result is that Custom Text Area Type is added in New Objectives.Actual result is that unable to add Custom Text Area Type in New Objectives.",
      "fixed_version":  "10.127.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-4918",
             "issue_description": "Jira Sprints showing 'multiple jira sprints are mapped to a single Jira align team sprint'.Jira Sprints showing 'multiple jira sprints are mapped to a single Jira align team sprint' even after ignoring the Jira sprint from sprint mapping.Expected result is that Jira Sprints showing 'multiple jira sprints are mapped to a single Jira align team sprint' even after ignoring the Jira sprint from sprint mapping.",
      "fixed_version":  "10.121.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-4910",
             "issue_description": "When a Jira Epic contains a label with the same text as the Fix Version assigned to the issue, the corresponding tag is not created in Jira Align.Later if there is more than one label in the Jira issue, all the labels that were not synced in Jira Align (i.e the one with the same text as the Fix Version) will be removed from the issue.",
      "fixed_version":  "10.126.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-4909",
             "issue_description": "The Throughput value is not rounded in the same way across Jira Align.The Throughput value is different depending on the context: In the Team slide out->Manage modal it is rounded up while in the program room and the Forecast it appears to be used with a rounded down value.   All the different pages should be rounding the throughput value in the same way so the information is the same across Jira Align.",
      "fixed_version":  "10.124.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-4892",
             "issue_description": "API: Epics field 'points' will return empty if the estimation used on the Portfolio is Team/Member Weeks.When running a GET to the Endpoint Epics, the field 'points' will be empty if the estimation system of the portfolio is set to Team/Member Weeks, while other estimations will work fine. See the result calls for the same Epic while changing the estimation system.Expected result is that The field 'points' would have the data regardless of the estimation system used on the portfolioActual result is that If the estimation system used is Team/Member Weeks, the field points is empty.",
      "fixed_version":  "10.121.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-2170 ",
          "issue_description": "[JIRAALIGN-2170] Program Tracking: Epic, Capability and Feature dependencies doesn't appear in the Report.Program Tracking: Epic, Capability and Feature dependencies doesn't appear in the Program Tracking Report.Expected result is that Dependencies appear in the report in the sprint cell if Needed by/Committed to falls into the Sprint dates range.Actual result is that Dependencies don't appear in the report.",
      "fixed_version":  "10.121.0 "
      }
  
    ]
},

{
    "version":"10.119.x",
    "date_of_release":"Sept 16 , 2016",
    "issue":[
        {
            "issue id": "JIRAALIGN-5050",
             "issue_description": "Deletion of External Links is not possible without system role permissions in the Portfolio layer.  Expected result is that the deletion cross should be seen (and work) without needing the permission to Add Epics in the Portfolio layer of the role.Actual result is that The deletion cross is not displayed (so a deletion of an external link cannot be done) without the permission to Add Epics in the Portfolio layer of the role - which gives too much permission to staff that should not be working in the Portfolio layer.",
      "fixed_version":  "10.126.2 "
      },
  
  
  {
            "issue id": "JIRAALIGN-5016",
             "issue_description": "Objectives that the user doesn't have access to due to their team/portfolio membership, can still be accessed and modified via direct URL link to Objectives grid with the details panel.This behaviour is inconsistent from other work items, for example when trying to access Features directly that we don't have access too, we get a message saying that we don't have permissions or item doesn't exist.Expected result is that Since the user can't access the objectives through Objective grid or global search, it's expected they'll get an error when trying to access it by URL, just like they would for other work items like Features or Stories.",
      "fixed_version":  "10.123.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-5007 ",
             "issue_description": "Capability Audit Log does not show Parent Epic at Creation.When a Capability is created with a Parent Epic associated , the audit log will not show the Parent Epic associated in the 'Created' entry. Only by modifying the Capability in some way will it show an update that associates the Parent Epic.Expected result is that Created entry in the Audit Log includes Parent Epic.Actual result is that Parent Epic association only happens after the Capability is updated, not on creation. ",
      "fixed_version":  "10.127.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-4999",
             "issue_description": "Responsibility Assignment Matrix approvals not working as expected.Approving/rejecting the process step in the Responsibility Assignment Matrix for any person in the list (except for the last person) approves/rejects the step for the selected person and the ones following them in the list.Due to this behavior, if someone above you on the list approves/rejects the step, you will not be able to evaluate the step any differently. Expected result is that approving/Rejecting a process step in the Responsibility Assignment Matrix evaluates the step only for the approver",
      "fixed_version":  "10.126.2 "
      },
  
  
  {
            "issue id": "JIRAALIGN-4997",
        "issue_description": "The Kanban Team velocity calculation in Forecast is confusing.Kanban teams don't have sprints so the velocity should not be calculated as for agile teams.Kanban teams have throughput, but throughput is calculated differently, and treated differently in the Forecast than it is in the Program Board (mainly because Jira Align is treating throughput as velocity, even though they are different fields). ",
      "fixed_version":  "10.126.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-4995",
             "issue_description": "The Jira Align Audit table of the Epics and/or Capability is not updated with the InRecycleBin information.As a result, the 'Deleted Flag' in the EI History table is not being populated if the item (i.e. capability, epic, feature) is being deleted/recycled using the 'Mass Delete' option .Expected result is that The Jira Align Audit table of the Epics and/or Capability is not updated with the InRecycleBin information.As a result, the 'Deleted Flag' in the EI History table is not being populated if the item (i.e. capability, epic, feature) is being deleted/recycled using the 'Mass Delete' option.Actual result is that When the Epic or the Capability was deleted/put in the recycle bin by the Mass Delete action, the Jira Align Audit table of the Epic or Capability is not updated with the InRecycleBin information. ",
      "fixed_version":  "10.126.2 "
      },
  
  
  {
            "issue id": "JIRAALIGN-4992",
             "issue_description": "In the Themes grid if you apply text content to the filter Theme Planned Budget (Expected Integer) it causes a whoops error. Hence the Page cannot be accessed by this user anymore since every time it tries to go to the Themes grid Jira Align automatically pushes the last filter applied, the broken one, leading again to Whoops.Expected result is that Do not apply the filter if the data type is incompatible, and do not throw a Whoops error",
      "fixed_version":  "10.125.3 "
      },
  
  
  {
            "issue id": "JIRAALIGN-4984",
             "issue_description": "User can overwrite Portfolio Epic via Import despite no visibility to the Epic.A user who has no visibility to a Portfolio and its Epics can still modify those Epics via Import. This is inconsistent with the broader UI and can lead to unintentional overwriting of data that is difficult to identify and fix.Expected result is that Import should be consistent with broader UI and prevent modification of work items for which a user does not have visibility.Actual result is that Import allows modification of work items for which a user does not have visibility which can lead to unintended overwriting of data",
      "fixed_version":  "10.122.3 "
      },
  
  
  {
            "issue id": "JIRAALIGN-4981",
             "issue_description": "Epic Grid: Non SuperAdmins receive an error when sorting by 'Ext Id'.When a non-SuperAdmin tries to sort the Epic Grid by the 'Ext Id' column, he receives a 'Whoops Error'.The same error doesn't happen for a SuperAdmin.Expected result is that No error would be displayed.Actual result is that The User receives a 'Whoops Error'.",
            "fixed_version":  "10.126.2"
      }
  
    ]
},
{
    "version":"10.120.x",
    "date_of_release":"5 December 2015",
    "issue":[
        {
            "issue id": "JIRAALIGN-6742",
          "issue_description": "Inconsistent behavior while updating Process Steps for Epics in Different browsers.When updating Process steps for Epics with multiple browsers, the Process State will not reflect the change made in the other browsers.Expected result is that The data to be consistently updated using different browsers as many times the Process Step field is updated.Actual result is that Inconsistent behavior when saving the Process step field between multiple browsers.",
           "fixed_version":  "10.132.3 "
           },
       
       
       {
               "issue id": "JIRAALIGN-6294 ",
              "issue_description": "New Navigation - Story Point Progress by Team Report - unable to select program.In the new navigation, if you access the Story Point Progress by Team report at the Portfolio level, it is not possible to load any data.  The page displays 'Please select one program or team to see report.'', but this is not possible as there are no additional filter selection buttons/dropdowns anywhere on the page.Actual result is that The page doesn't load and there is no way to select a program or team.Expected result is that  The page would load with the ability to select a Program or Team.",
           "fixed_version":  "10.130.0 "
           },
       
       
       {
                 "issue id": "JIRAALIGN-5354",
                  "issue_description": "Forecast page filters not resetting when moving between portfolios with and without capabilities. Expected result is that the forecast would be filtering by the default work item filter, per the filter display.Actual result is that No work items are appearing in the list.  If you look closer you can see that it is actually filtering by capabilities. ",
           "fixed_version":  " None"
           },
       
       
       {
                 "issue id": "JIRAALIGN-5183",
                  "issue_description": "Scrum Master Role unable to create Acceptance Criteria during locked sprints.The Team Role - Scrum Master should be able to create Acceptance Criteria during locked sprints as per the help article. However, currently Scrum Master roles are unable to add acceptance criteria during a locked sprint.Expected result is that Scrum Mater team roles should be able to create acceptance criteria during locked sprints as per the help article.Actual result is that Scrum Master role are unable to create acceptance criteria during locked sprints.",
           "fixed_version":  "10.131.0 "
           },
       
       
       {
                 "issue id": "JIRAALIGN-5113",
                  "issue_description": "ManagedUsers and FullUsers columns are not populating with values in the Site Metadata view in Enterprise Insights. Expected result is that query result return values for ManagedUsers and FullUsers columns.Actual result is that Query result returns NULL values for ManagedUsers and FullUsers columns.",
           "fixed_version":  "10.123.0 "
           },
       
       
       {
                 "issue id": "JIRAALIGN-5112 ",
                  "issue_description": "Incremental error when update user roles.When updating the user Roles that were created by copying the Super Admin role, the Jira Align triggers an error on HTML with an incremental value.Expected result is that After updating/saving a Jira Align user Role, the pop-up of successful change would appear, and the /RoleSetUpNew page is reloaded. Actual result is that An error is printed on the screen with an incremental value.  ",
           "fixed_version":  "10.125.3 "
           },
       
       
       {
                 "issue id": "JIRAALIGN-5108",
                  "issue_description": "Can't create feature from epics slide-out panel without add epics permission.The users can't create features in the epics slide-out panel without add/create epics permission.Expected result is that There is an option to quick add the feature in the epics slide-out panel.Actual result is that There is no option to quick add the feature in the epics slide-out panel.",
           "fixed_version":  "10.129.0 "
           },
       
       
       {
                 "issue id": "JIRAALIGN-5106",
                  "issue_description": " 'Team goals' report fails to display green icon for sprint goals that have been met. It currently displays red icon for both met and unmet goals which renders the report useless in tracking Teams' sprint goals.Expected result is that Team goals report should display green icon for Sprint goals that are met.Actual result is that Team goals report displays red icon for both met and unmet goals.",
           "fixed_version":  "10.125.0 "
           },
       
       
       {
                 "issue id": "JIRAALIGN-5102 ",
                  "issue_description": "ProgramBoardItemView subrequests which are called by only the ProgramBoard encounter slow performance and therefore affect the overall performance of the ProgramBoard. In the case of performance improvement, the ProgramBoard page will also improve.Expected result is that No slowness/failures to load pages.Actual result is that In certain conditions, pages take a long time to load while making ProgramBoardItemView calls.",
           "fixed_version":  "10.127.0 "
           },
       
       
       {
                 "issue id": "JIRAALIGN-5095",
                  "issue_description": "Some features are showing Red in the Program Board with the warning 'There are conflict dependencies with the feature', however, the dependency related to the feature is color colored orange because there are no stories assigned to the dependency and there are no other issues with the dependency nor the feature.Expected result is that As there are no issues with the feature or the dependency that could cause the feature to appear red, it should not be color colored red.Actual result is that The feature and the objective related to it appears in red in the Program Board.",
           "fixed_version":  "10.128.0 "
           },
       
       
       {
                 "issue id": "JIRAALIGN-5087",
                  "issue_description": "Shared sprints fail to sync when new (end date based) mapping is enabled.Jira Connector stops syncing shared sprints when new (end date based) sprint mapping is enabledExpected result is that Connector should pull in shared sprint for JA sprint mapping as it did with previous (board order based) mapping logic.Actual result is that Connector fails to pull shared sprint into JA sprint mapping with log reporting 'Sprint [X] was not created because this sprint originates from another board'. ",
           "fixed_version":  "10.123.0 "
           },
       
       
       {
                 "issue id": "JIRAALIGN-5081",
                  "issue_description": "Kanban Boards: Lean Metrics are not capturing correctly the number of cards.Reports inside Lean Metrics are not capturing correctly the number of cards on the Kanban Boards.Expected result is that Data of reports would match what the board has..Actual result is that Data in the reports are incorrect. ",
           "fixed_version":  "10.129.0 "
           },
       
       
       {
                 "issue id": "JIRAALIGN-5065",
                  "issue_description": "The default Portfolio configuration setting for the ScoreCards option is ignored.The Epic 'Value' tab, on the details panel, is not taking into account the default ScoreCards settings options of the portfolio configuration unless you explicitly changed/saved the configuration. ",
           "fixed_version":  " 10.127.2"
           },
       
       
       {
                 "issue id": "JIRAALIGN-5059",
                  "issue_description": "The inconsistent behavior of the SAVE function being available for the Feature work item which is different than what is observed in the other work items.The inconsistent behavior of the SAVE function being available for the Feature work item which is different than what is observed in the other work items.Expected result is that The Save and Add behavior should be consistent in all work items. ",
              "fixed_version":  "10.129.0 "
           }
       
    ]
},

{
    "version":"10.121.x",
    "date_of_release":"5 December 2015",
    "issue":[
        {
            "issue id": "JIRAALIGN-5169",
             "issue_description": "Program Dependency - accepting a new proposal date is generating a log without the User name.After accepting a new dependency date proposal the audit log is generating a message pointing to the user ID where would be expected a username to avoid confusion.",
      "fixed_version":  "None "
      },
  
  
  {
            "issue id": "JIRAALIGN-5168",
             "issue_description": "The work item links toggle is not functioning as expected. When this toggle is disabled for the role, the user is still able to view/access the links tab on the work items.Expected result is that When the work item links toggle is disabled system should limit visibility and access to the work item links.Actual result is that The user can go to a work item and add any work-item link even with the work item toggle is off for the role.",
      "fixed_version":  "10.132.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-5159",
             "issue_description": "In the Dependency grid, when opening the dependency details of a dependency with a related capability, the guide message does not match the fields presented as an option.Expected result is that The guide message should follow the button name and type presented in the options, such as when there's no capability enabled/associated.",
      "fixed_version":  "10.129.0 "
      }
  
    ]

},

{
    "version":"10.122.x",
    "date_of_release":"5 December 2015",
    "issue":[
        {
            "issue id": "JIRAALIGN-5822",
             "issue_description": "Creating dependency between programs for epic and capability does not show the 'No Work Req:' field.",
      "fixed_version":  "10.132.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-5289",
             "issue_description": "New Navigation - Work tree page calculations differ between old and new nav.If you view the work tree page in the new navigation and compare it to another window in the old nav with the same exact filters, the data does not match.Expected result is that The data should match.Actual result is that The numbers do not match, despite having the same exact filters selected.",
      "fixed_version":  "10.127.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-5280",
             "issue_description": "New Nav: Super Admin without Product permission can see Products and receive a login prompt.Expected result is for all users/system roles, if the user has access to programs with products enabled, the product menu should show.Actual result is that The products display, but once you click on one, a login screen appears.",
      "fixed_version":  "10.126.2 "
      },
  
  
  {
            "issue id": "JIRAALIGN-5259",
             "issue_description": "Loading story backlog beyond 100 items generates Internal Server Error. Observed in both current and New Nav.",
      "fixed_version":  "10.124.2 "
      },
  
  
  {
            "issue id": "JIRAALIGN-5254",
             "issue_description": "New navigation - cannot filter Dependency Maps by portfolio, solution, or team.Expected result is that dependency Maps links should be removed from the grid and added the reports section on the Portfolio, Solution, and Team menus (already exists on the Program reports menu).",
      "fixed_version":  "10.126.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-5225",
           "issue_description": "New navigation - Program Increment Progress Report does not show Consolidated Release Vehicles in extra configuration.Program Increment Progress Report in the new UI does not show Consolidated Release Vehicles in the Release Vehicle filter/extra configuration.Expected result is that Program Increment Progress Report in the new UI shows Consolidated Release Vehicles in Release Roadmap extra configuration.Actual result is that Program Increment Progress Report in the new UI does not show Consolidated Release Vehicles in extra configuration.",
      "fixed_version":  "10.128.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-5219",
             "issue_description": "Roadmaps in the new UI does not show Consolidated Release Vehicles in the Release Vehicle filter unlike old UI. In the old UI, the Release Vehicle filter option in the the Roadmap filter, we can filter by Consolidated Release Vehicles. This is not possible in the new UI.Expected result is that Roadmap in the new UI shows Consolidated Release Vehicles in Release Roadmap filter.Actual result is that Roadmaps in the new UI does not show Consolidated Release Vehicles in Release Roadmap filter.",
      "fixed_version":  "10.128.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-5214",
             "issue_description": "Program board- New navigation altered the board layout out of the window boundaries.When accessing the program board, with new UI enabled, the board is becoming unessarily wide, making the board extending out of the visible boundaries of the browser window.Expected result is that Display of program board should display as contained within the visible boundaries of the browser.Actual result is that Program board width is extending over the visible part of the window.",
      "fixed_version":  "10.125.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-5210",
             "issue_description": "Jira Sprints Without Issues Assigned are Not Synced to Jira Align.Sprints created in Jira are not syncing to JA unless an Issue/Story is pulled into a new empty Jira Board Sprint. This is occurring due JA is creating duplicated entries on the Sprint Mapping.Expected result is that After a boar sync, the sprints are created in JA regardless they have issues associated with it or not. Actual result is that Sprints created in Jira are not syncing to JA unless an Issue/Story is pulled into a new empty Jira Board Sprint.",
      "fixed_version":  "10.123.1 "
      },
  
  
  {
            "issue id": "JIRAALIGN-5204",
             "issue_description": "Attempting to push new members to related Program teams from Portfolio, gives 'Internal server error'.Expected result is that there should not be any error or performance issue",
      "fixed_version":  "10.125.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-5190",
             "issue_description": "Additional programs for Epic are not updated.With the Multi-Program feature, the Epic 'Additional Programs' is not updated until a manual save is performed on the Feature after a new story is added to the Jira Cloud Epic from a new Program. Expected result is that The additional programs are not updated with the project. Actual result is that The additional programs are updated in Epic similar to the feature.",
      "fixed_version":  " 10.128.0"
      },
  
  
  {
            "issue id": "JIRAALIGN-5188",
             "issue_description": "New nav - Solution menu is showing for all users.The Solution menu should only show if the user has access to a Solution.Expected result is that The Solution menu should only show if the user has access to a Solution.Actual result is that The 'Solution' is not hidden ",
      "fixed_version":  "10.126.2 "
      },
  
  
  {
            "issue id": "JIRAALIGN-5119",
             "issue_description": "When expanding PI to the Forecast page and selecting View By Feature, 'an error occurs that reports An error occurred on the server while processing the URL.'Expected result is that Expand the Forecast PI list as expected. ",
      "fixed_version":  "10.126.0 "
      },
  
  
  {
            "issue id": "IRAALIGN-5172",
             "issue_description": "In the new Navigation, most screens have access to change the program/portfolio and PI in the left sidebar navigation. 'Custom rooms' don't have this. As a result, you are unable to select PIs which means the roadmaps won't display and I will not be able to filter the list of epics or features by a given PI.Expected result is that The program increment can be selected in the left sidebar navigation.Actual result is that The program increment can't be selected in the left sidebar navigation. ",
      "fixed_version":  "10.124.0 "
      }
  
    ]
},

{
    "version":"10.123.x",
    "date_of_release":"5 December 2015",
    "issue":[
        {
            "issue id": "JIRAALIGN-5404",
             "issue_description": "When creating and deleting Work Items in between ETL cycles of EI records are not pushed to EI.When deleting Work Items in between ETL cycle for Enterprise Insights records will not be carried out to the specific Work Items views not even in export_dw schema where the deleted files should appear flagged with deletion field, but will be inserted in History and Log views.Respected result is that Records should be inserted in the export_dw schema as this schema is intended to keep deleted records with the flags of deletion.Actual result is that As the records are deleted prior to the ETL cycles from tables in JA they are not pushed to EI.",
      "fixed_version":  "10.126.0"
      },
  
  
  {
            "issue id": "JIRAALIGN-5399",
             "issue_description": "Clicking on 'Save' and then 'Save and Close' too fast on Risk details panel resulting in unexpected behaviors. Expected result is that clicking on 'Save' and then 'Save and Close' too fast in the Risk details panel does not update the Risk Relationship.Actual result is that Clicking on 'Save' and then 'Save and Close' too fast in the Risk details panel updates the Risk Relationship.",
      "fixed_version":  "10.126.2 "
      },
  
  
  {
            "issue id": "JIRAALIGN-5378",
             "issue_description": "Creating Stories in JA from Jira Connector Results in Automation Field Set to 0, While UI-Created Stories Have NULL Value.When utilizing the Jira Connector, there is a noteworthy divergence in the way stories are generated compared to those created through the user interface (UI). Specifically, stories produced by the Jira Connector exhibit a peculiar behavior whereby the automation field is consistently set to 0, whereas stories initiated via the UI consistently maintain a NULL value in the same field.Expected result is that To have the same behavior independently of how the story was created.Actual result is that The automation field is being created with different values, and this may affect API scripts.",
      "fixed_version":  "10.131.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-5370",
             "issue_description": "API: Can't create custom team mapping with null jira projectKey.Can't create custom team mapping with no Jira project key selected.Expected result is that In the UI it's possible to create a custom team mapping without selecting a specific project. This mapping will still work fine and will apply to all projects that don't have their own mappings specified.",
      "fixed_version":  "10.132.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-5364",
             "issue_description": "Time is mandatory if the date is set in the Key Result check-in modal.In both legacy and new experience objectives, when checking in on a Key Result you receive the message 'Please enter an amount and a date' if you do not enter a time even if the date was set.Expected result is that The correct default date for today appears when the modal opens so the users don't feel the need to change it and/or if the date is changed the Key Result new value is saved regardless of the time.Actual result is that the Key Result new value is not saved and the error message 'Please enter an amount and a date' appears.",
      "fixed_version":  "10.124.2 "
      },
  
  
  {
            "issue id": "JIRAALIGN-5359",
             "issue_description": "When searching for work items such as (Features/Epics) to associate with other work items (such as Story/Risks) the modal window for the search does not always show the new icon for the item type searched.",
      "fixed_version":  "10.126.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-5342",
             "issue_description": "REST API: Inconsistent behaviour in retrieving deleted items.When an Epic is canceled or deleted, and we fetch the item over API, the primaryProgramId shows up as null.",
      "fixed_version":  "10.132.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-5341",
             "issue_description": "Theme: after saving and closing a Theme, the columns from theme grid disappear.When Saving and closing a Theme, the columns from the theme grid disappear from the screens, and will only return after a page refresh.Expected result is that Columns would be kept as is.Actual result is that Columns are removed after saving/closing.",
      "fixed_version":  "10.124.2 "
      },
  
  
  {
            "issue id": "JIRAALIGN-5326",
         "issue_description": "The Program Tracking Report displays Multi-Team Dependencies that match the PI filter, but will ignore the Program Filter if applied, showing Multi-Team Dependencies that are not associated with the select program in any way, but are related to the selected PI.Expected result is that Multi-Team Dependencies respect the Configuration Bar filters.Actual result is that Multi-Team Dependencies display in the Program Tracking report so long as they match the selected PI, ignoring the Program filter.",
              "fixed_version":  "10.129.0, 10.130.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-5309",
             "issue_description": "Forecast - 'Hide Empty Rows and Columns' removes all entries.On the Forecast page, when trying to hide Empty Rows by enabling the toggle 'Hide Empty Rows and Columns', it removes all the columns even if they are not empty.Expected result is that Empty Rows and Columns get hidden.",
      "fixed_version":  "11.0.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-5229",
             "issue_description": "The JA API that creates the mapping for the projects doesn't validate if the projectId used on the POST call is already mapped for that connector, allowing the creation of duplicate ids in JA and resulting in state mapping screen not loading.Expected result is that No duplicated Jira Project ids are returned in the API call.",
      "fixed_version":  "10.125.0 "
      },
  
  
  {
            "issue id": "JIRAALIGN-2729",
             "issue_description": "Duplicate users shown in team allocations, sprints, and organizational hierarchy.When preparing or editing the members assigned to a sprint, users appear multiple times for the same sprint. In some cases, users have more than 3 entries in the same sprint.Those users with multiple entries cannot be deleted or removed from the sprint without leveraging the workaround listed below. In some teams, users that are inactive in Jira Align, are allocated and assigned as team members in sprints. ",
      "fixed_version":  "10.126.2 "
      }
  
    ]
}



]    
 